/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const INNER_VAR: i32 = -1;
pub const OUTER_VAR: i32 = -2;
pub const INDEX_VAR: i32 = -3;
pub const ROWID_VAR: i32 = -4;
pub const PRS2_OLD_VARNO: u32 = 1;
pub const PRS2_NEW_VARNO: u32 = 2;
pub const ACL_INSERT: u32 = 1;
pub const ACL_SELECT: u32 = 2;
pub const ACL_UPDATE: u32 = 4;
pub const ACL_DELETE: u32 = 8;
pub const ACL_TRUNCATE: u32 = 16;
pub const ACL_REFERENCES: u32 = 32;
pub const ACL_TRIGGER: u32 = 64;
pub const ACL_EXECUTE: u32 = 128;
pub const ACL_USAGE: u32 = 256;

pub const ACL_NO_RIGHTS: u32 = 0;
pub const ACL_SELECT_FOR_UPDATE: u32 = 4;
pub const FRAMEOPTION_NONDEFAULT: u32 = 1;
pub const FRAMEOPTION_RANGE: u32 = 2;
pub const FRAMEOPTION_ROWS: u32 = 4;
pub const FRAMEOPTION_GROUPS: u32 = 8;
pub const FRAMEOPTION_BETWEEN: u32 = 16;
pub const FRAMEOPTION_START_UNBOUNDED_PRECEDING: u32 = 32;
pub const FRAMEOPTION_END_UNBOUNDED_PRECEDING: u32 = 64;
pub const FRAMEOPTION_START_UNBOUNDED_FOLLOWING: u32 = 128;
pub const FRAMEOPTION_END_UNBOUNDED_FOLLOWING: u32 = 256;
pub const FRAMEOPTION_START_CURRENT_ROW: u32 = 512;
pub const FRAMEOPTION_END_CURRENT_ROW: u32 = 1024;
pub const FRAMEOPTION_START_OFFSET_PRECEDING: u32 = 2048;
pub const FRAMEOPTION_END_OFFSET_PRECEDING: u32 = 4096;
pub const FRAMEOPTION_START_OFFSET_FOLLOWING: u32 = 8192;
pub const FRAMEOPTION_END_OFFSET_FOLLOWING: u32 = 16384;
pub const FRAMEOPTION_EXCLUDE_CURRENT_ROW: u32 = 32768;
pub const FRAMEOPTION_EXCLUDE_GROUP: u32 = 65536;
pub const FRAMEOPTION_EXCLUDE_TIES: u32 = 131072;
pub const FRAMEOPTION_START_OFFSET: u32 = 10240;
pub const FRAMEOPTION_END_OFFSET: u32 = 20480;
pub const FRAMEOPTION_EXCLUSION: u32 = 229376;
pub const FRAMEOPTION_DEFAULTS: u32 = 1058;
pub const FKCONSTR_ACTION_NOACTION: u8 = 97u8;
pub const FKCONSTR_ACTION_RESTRICT: u8 = 114u8;
pub const FKCONSTR_ACTION_CASCADE: u8 = 99u8;
pub const FKCONSTR_ACTION_SETNULL: u8 = 110u8;
pub const FKCONSTR_ACTION_SETDEFAULT: u8 = 100u8;
pub const FKCONSTR_MATCH_FULL: u8 = 102u8;
pub const FKCONSTR_MATCH_PARTIAL: u8 = 112u8;
pub const FKCONSTR_MATCH_SIMPLE: u8 = 115u8;
pub const OPCLASS_ITEM_OPERATOR: u32 = 1;
pub const OPCLASS_ITEM_FUNCTION: u32 = 2;
pub const OPCLASS_ITEM_STORAGETYPE: u32 = 3;
pub const CURSOR_OPT_BINARY: u32 = 1;
pub const CURSOR_OPT_SCROLL: u32 = 2;
pub const CURSOR_OPT_NO_SCROLL: u32 = 4;
pub const CURSOR_OPT_INSENSITIVE: u32 = 8;
pub const CURSOR_OPT_ASENSITIVE: u32 = 16;
pub const CURSOR_OPT_HOLD: u32 = 32;
pub const CURSOR_OPT_FAST_PLAN: u32 = 256;
pub const CURSOR_OPT_GENERIC_PLAN: u32 = 512;
pub const CURSOR_OPT_CUSTOM_PLAN: u32 = 1024;
pub const CURSOR_OPT_PARALLEL_OK: u32 = 2048;
pub const ALLOCSET_DEFAULT_MINSIZE: u32 = 0;
pub const ALLOCSET_DEFAULT_INITSIZE: u32 = 8192;
pub const ALLOCSET_DEFAULT_MAXSIZE: u32 = 8388608;
pub type Oid = ::std::os::raw::c_uint;
pub type int16 = i16;
pub type int32 = i32;
pub type int64 = i64;
pub type uint32 = u32;
pub type uint64 = u64;
pub type bits32 = uint32;
pub type Size = usize;
pub type Index = ::std::os::raw::c_uint;
pub type TransactionId = uint32;
pub type SubTransactionId = uint32;
pub type MemoryContext = *mut MemoryContextData;
pub type MemoryContextCallbackFunction =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemoryContextCallback {
    pub func: MemoryContextCallbackFunction,
    pub arg: *mut ::std::os::raw::c_void,
    pub next: *mut MemoryContextCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemoryContextCallback"][::std::mem::size_of::<MemoryContextCallback>() - 24usize];
    ["Alignment of MemoryContextCallback"]
        [::std::mem::align_of::<MemoryContextCallback>() - 8usize];
    ["Offset of field: MemoryContextCallback::func"]
        [::std::mem::offset_of!(MemoryContextCallback, func) - 0usize];
    ["Offset of field: MemoryContextCallback::arg"]
        [::std::mem::offset_of!(MemoryContextCallback, arg) - 8usize];
    ["Offset of field: MemoryContextCallback::next"]
        [::std::mem::offset_of!(MemoryContextCallback, next) - 16usize];
};
unsafe extern "C" {
    #[link_name = "MemoryContextSwitchTo__extern"]
    pub fn MemoryContextSwitchTo(context: MemoryContext) -> MemoryContext;
}
pub type Datum = usize;
unsafe extern "C" {
    pub fn pg_query_init();
}
pub type RelFileNumber = Oid;
pub const NodeTag_T_Invalid: NodeTag = 0;
pub const NodeTag_T_List: NodeTag = 1;
pub const NodeTag_T_Alias: NodeTag = 2;
pub const NodeTag_T_RangeVar: NodeTag = 3;
pub const NodeTag_T_TableFunc: NodeTag = 4;
pub const NodeTag_T_IntoClause: NodeTag = 5;
pub const NodeTag_T_Var: NodeTag = 6;
pub const NodeTag_T_Const: NodeTag = 7;
pub const NodeTag_T_Param: NodeTag = 8;
pub const NodeTag_T_Aggref: NodeTag = 9;
pub const NodeTag_T_GroupingFunc: NodeTag = 10;
pub const NodeTag_T_WindowFunc: NodeTag = 11;
pub const NodeTag_T_WindowFuncRunCondition: NodeTag = 12;
pub const NodeTag_T_MergeSupportFunc: NodeTag = 13;
pub const NodeTag_T_SubscriptingRef: NodeTag = 14;
pub const NodeTag_T_FuncExpr: NodeTag = 15;
pub const NodeTag_T_NamedArgExpr: NodeTag = 16;
pub const NodeTag_T_OpExpr: NodeTag = 17;
pub const NodeTag_T_DistinctExpr: NodeTag = 18;
pub const NodeTag_T_NullIfExpr: NodeTag = 19;
pub const NodeTag_T_ScalarArrayOpExpr: NodeTag = 20;
pub const NodeTag_T_BoolExpr: NodeTag = 21;
pub const NodeTag_T_SubLink: NodeTag = 22;
pub const NodeTag_T_SubPlan: NodeTag = 23;
pub const NodeTag_T_AlternativeSubPlan: NodeTag = 24;
pub const NodeTag_T_FieldSelect: NodeTag = 25;
pub const NodeTag_T_FieldStore: NodeTag = 26;
pub const NodeTag_T_RelabelType: NodeTag = 27;
pub const NodeTag_T_CoerceViaIO: NodeTag = 28;
pub const NodeTag_T_ArrayCoerceExpr: NodeTag = 29;
pub const NodeTag_T_ConvertRowtypeExpr: NodeTag = 30;
pub const NodeTag_T_CollateExpr: NodeTag = 31;
pub const NodeTag_T_CaseExpr: NodeTag = 32;
pub const NodeTag_T_CaseWhen: NodeTag = 33;
pub const NodeTag_T_CaseTestExpr: NodeTag = 34;
pub const NodeTag_T_ArrayExpr: NodeTag = 35;
pub const NodeTag_T_RowExpr: NodeTag = 36;
pub const NodeTag_T_RowCompareExpr: NodeTag = 37;
pub const NodeTag_T_CoalesceExpr: NodeTag = 38;
pub const NodeTag_T_MinMaxExpr: NodeTag = 39;
pub const NodeTag_T_SQLValueFunction: NodeTag = 40;
pub const NodeTag_T_XmlExpr: NodeTag = 41;
pub const NodeTag_T_JsonFormat: NodeTag = 42;
pub const NodeTag_T_JsonReturning: NodeTag = 43;
pub const NodeTag_T_JsonValueExpr: NodeTag = 44;
pub const NodeTag_T_JsonConstructorExpr: NodeTag = 45;
pub const NodeTag_T_JsonIsPredicate: NodeTag = 46;
pub const NodeTag_T_JsonBehavior: NodeTag = 47;
pub const NodeTag_T_JsonExpr: NodeTag = 48;
pub const NodeTag_T_JsonTablePath: NodeTag = 49;
pub const NodeTag_T_JsonTablePathScan: NodeTag = 50;
pub const NodeTag_T_JsonTableSiblingJoin: NodeTag = 51;
pub const NodeTag_T_NullTest: NodeTag = 52;
pub const NodeTag_T_BooleanTest: NodeTag = 53;
pub const NodeTag_T_MergeAction: NodeTag = 54;
pub const NodeTag_T_CoerceToDomain: NodeTag = 55;
pub const NodeTag_T_CoerceToDomainValue: NodeTag = 56;
pub const NodeTag_T_SetToDefault: NodeTag = 57;
pub const NodeTag_T_CurrentOfExpr: NodeTag = 58;
pub const NodeTag_T_NextValueExpr: NodeTag = 59;
pub const NodeTag_T_InferenceElem: NodeTag = 60;
pub const NodeTag_T_ReturningExpr: NodeTag = 61;
pub const NodeTag_T_TargetEntry: NodeTag = 62;
pub const NodeTag_T_RangeTblRef: NodeTag = 63;
pub const NodeTag_T_JoinExpr: NodeTag = 64;
pub const NodeTag_T_FromExpr: NodeTag = 65;
pub const NodeTag_T_OnConflictExpr: NodeTag = 66;
pub const NodeTag_T_Query: NodeTag = 67;
pub const NodeTag_T_TypeName: NodeTag = 68;
pub const NodeTag_T_ColumnRef: NodeTag = 69;
pub const NodeTag_T_ParamRef: NodeTag = 70;
pub const NodeTag_T_A_Expr: NodeTag = 71;
pub const NodeTag_T_A_Const: NodeTag = 72;
pub const NodeTag_T_TypeCast: NodeTag = 73;
pub const NodeTag_T_CollateClause: NodeTag = 74;
pub const NodeTag_T_RoleSpec: NodeTag = 75;
pub const NodeTag_T_FuncCall: NodeTag = 76;
pub const NodeTag_T_A_Star: NodeTag = 77;
pub const NodeTag_T_A_Indices: NodeTag = 78;
pub const NodeTag_T_A_Indirection: NodeTag = 79;
pub const NodeTag_T_A_ArrayExpr: NodeTag = 80;
pub const NodeTag_T_ResTarget: NodeTag = 81;
pub const NodeTag_T_MultiAssignRef: NodeTag = 82;
pub const NodeTag_T_SortBy: NodeTag = 83;
pub const NodeTag_T_WindowDef: NodeTag = 84;
pub const NodeTag_T_RangeSubselect: NodeTag = 85;
pub const NodeTag_T_RangeFunction: NodeTag = 86;
pub const NodeTag_T_RangeTableFunc: NodeTag = 87;
pub const NodeTag_T_RangeTableFuncCol: NodeTag = 88;
pub const NodeTag_T_RangeTableSample: NodeTag = 89;
pub const NodeTag_T_ColumnDef: NodeTag = 90;
pub const NodeTag_T_TableLikeClause: NodeTag = 91;
pub const NodeTag_T_IndexElem: NodeTag = 92;
pub const NodeTag_T_DefElem: NodeTag = 93;
pub const NodeTag_T_LockingClause: NodeTag = 94;
pub const NodeTag_T_XmlSerialize: NodeTag = 95;
pub const NodeTag_T_PartitionElem: NodeTag = 96;
pub const NodeTag_T_PartitionSpec: NodeTag = 97;
pub const NodeTag_T_PartitionBoundSpec: NodeTag = 98;
pub const NodeTag_T_PartitionRangeDatum: NodeTag = 99;
pub const NodeTag_T_PartitionCmd: NodeTag = 100;
pub const NodeTag_T_RangeTblEntry: NodeTag = 101;
pub const NodeTag_T_RTEPermissionInfo: NodeTag = 102;
pub const NodeTag_T_RangeTblFunction: NodeTag = 103;
pub const NodeTag_T_TableSampleClause: NodeTag = 104;
pub const NodeTag_T_WithCheckOption: NodeTag = 105;
pub const NodeTag_T_SortGroupClause: NodeTag = 106;
pub const NodeTag_T_GroupingSet: NodeTag = 107;
pub const NodeTag_T_WindowClause: NodeTag = 108;
pub const NodeTag_T_RowMarkClause: NodeTag = 109;
pub const NodeTag_T_WithClause: NodeTag = 110;
pub const NodeTag_T_InferClause: NodeTag = 111;
pub const NodeTag_T_OnConflictClause: NodeTag = 112;
pub const NodeTag_T_CTESearchClause: NodeTag = 113;
pub const NodeTag_T_CTECycleClause: NodeTag = 114;
pub const NodeTag_T_CommonTableExpr: NodeTag = 115;
pub const NodeTag_T_MergeWhenClause: NodeTag = 116;
pub const NodeTag_T_ReturningOption: NodeTag = 117;
pub const NodeTag_T_ReturningClause: NodeTag = 118;
pub const NodeTag_T_TriggerTransition: NodeTag = 119;
pub const NodeTag_T_JsonOutput: NodeTag = 120;
pub const NodeTag_T_JsonArgument: NodeTag = 121;
pub const NodeTag_T_JsonFuncExpr: NodeTag = 122;
pub const NodeTag_T_JsonTablePathSpec: NodeTag = 123;
pub const NodeTag_T_JsonTable: NodeTag = 124;
pub const NodeTag_T_JsonTableColumn: NodeTag = 125;
pub const NodeTag_T_JsonKeyValue: NodeTag = 126;
pub const NodeTag_T_JsonParseExpr: NodeTag = 127;
pub const NodeTag_T_JsonScalarExpr: NodeTag = 128;
pub const NodeTag_T_JsonSerializeExpr: NodeTag = 129;
pub const NodeTag_T_JsonObjectConstructor: NodeTag = 130;
pub const NodeTag_T_JsonArrayConstructor: NodeTag = 131;
pub const NodeTag_T_JsonArrayQueryConstructor: NodeTag = 132;
pub const NodeTag_T_JsonAggConstructor: NodeTag = 133;
pub const NodeTag_T_JsonObjectAgg: NodeTag = 134;
pub const NodeTag_T_JsonArrayAgg: NodeTag = 135;
pub const NodeTag_T_RawStmt: NodeTag = 136;
pub const NodeTag_T_InsertStmt: NodeTag = 137;
pub const NodeTag_T_DeleteStmt: NodeTag = 138;
pub const NodeTag_T_UpdateStmt: NodeTag = 139;
pub const NodeTag_T_MergeStmt: NodeTag = 140;
pub const NodeTag_T_SelectStmt: NodeTag = 141;
pub const NodeTag_T_SetOperationStmt: NodeTag = 142;
pub const NodeTag_T_ReturnStmt: NodeTag = 143;
pub const NodeTag_T_PLAssignStmt: NodeTag = 144;
pub const NodeTag_T_CreateSchemaStmt: NodeTag = 145;
pub const NodeTag_T_AlterTableStmt: NodeTag = 146;
pub const NodeTag_T_AlterTableCmd: NodeTag = 147;
pub const NodeTag_T_ATAlterConstraint: NodeTag = 148;
pub const NodeTag_T_ReplicaIdentityStmt: NodeTag = 149;
pub const NodeTag_T_AlterCollationStmt: NodeTag = 150;
pub const NodeTag_T_AlterDomainStmt: NodeTag = 151;
pub const NodeTag_T_GrantStmt: NodeTag = 152;
pub const NodeTag_T_ObjectWithArgs: NodeTag = 153;
pub const NodeTag_T_AccessPriv: NodeTag = 154;
pub const NodeTag_T_GrantRoleStmt: NodeTag = 155;
pub const NodeTag_T_AlterDefaultPrivilegesStmt: NodeTag = 156;
pub const NodeTag_T_CopyStmt: NodeTag = 157;
pub const NodeTag_T_VariableSetStmt: NodeTag = 158;
pub const NodeTag_T_VariableShowStmt: NodeTag = 159;
pub const NodeTag_T_CreateStmt: NodeTag = 160;
pub const NodeTag_T_Constraint: NodeTag = 161;
pub const NodeTag_T_CreateTableSpaceStmt: NodeTag = 162;
pub const NodeTag_T_DropTableSpaceStmt: NodeTag = 163;
pub const NodeTag_T_AlterTableSpaceOptionsStmt: NodeTag = 164;
pub const NodeTag_T_AlterTableMoveAllStmt: NodeTag = 165;
pub const NodeTag_T_CreateExtensionStmt: NodeTag = 166;
pub const NodeTag_T_AlterExtensionStmt: NodeTag = 167;
pub const NodeTag_T_AlterExtensionContentsStmt: NodeTag = 168;
pub const NodeTag_T_CreateFdwStmt: NodeTag = 169;
pub const NodeTag_T_AlterFdwStmt: NodeTag = 170;
pub const NodeTag_T_CreateForeignServerStmt: NodeTag = 171;
pub const NodeTag_T_AlterForeignServerStmt: NodeTag = 172;
pub const NodeTag_T_CreateForeignTableStmt: NodeTag = 173;
pub const NodeTag_T_CreateUserMappingStmt: NodeTag = 174;
pub const NodeTag_T_AlterUserMappingStmt: NodeTag = 175;
pub const NodeTag_T_DropUserMappingStmt: NodeTag = 176;
pub const NodeTag_T_ImportForeignSchemaStmt: NodeTag = 177;
pub const NodeTag_T_CreatePolicyStmt: NodeTag = 178;
pub const NodeTag_T_AlterPolicyStmt: NodeTag = 179;
pub const NodeTag_T_CreateAmStmt: NodeTag = 180;
pub const NodeTag_T_CreateTrigStmt: NodeTag = 181;
pub const NodeTag_T_CreateEventTrigStmt: NodeTag = 182;
pub const NodeTag_T_AlterEventTrigStmt: NodeTag = 183;
pub const NodeTag_T_CreatePLangStmt: NodeTag = 184;
pub const NodeTag_T_CreateRoleStmt: NodeTag = 185;
pub const NodeTag_T_AlterRoleStmt: NodeTag = 186;
pub const NodeTag_T_AlterRoleSetStmt: NodeTag = 187;
pub const NodeTag_T_DropRoleStmt: NodeTag = 188;
pub const NodeTag_T_CreateSeqStmt: NodeTag = 189;
pub const NodeTag_T_AlterSeqStmt: NodeTag = 190;
pub const NodeTag_T_DefineStmt: NodeTag = 191;
pub const NodeTag_T_CreateDomainStmt: NodeTag = 192;
pub const NodeTag_T_CreateOpClassStmt: NodeTag = 193;
pub const NodeTag_T_CreateOpClassItem: NodeTag = 194;
pub const NodeTag_T_CreateOpFamilyStmt: NodeTag = 195;
pub const NodeTag_T_AlterOpFamilyStmt: NodeTag = 196;
pub const NodeTag_T_DropStmt: NodeTag = 197;
pub const NodeTag_T_TruncateStmt: NodeTag = 198;
pub const NodeTag_T_CommentStmt: NodeTag = 199;
pub const NodeTag_T_SecLabelStmt: NodeTag = 200;
pub const NodeTag_T_DeclareCursorStmt: NodeTag = 201;
pub const NodeTag_T_ClosePortalStmt: NodeTag = 202;
pub const NodeTag_T_FetchStmt: NodeTag = 203;
pub const NodeTag_T_IndexStmt: NodeTag = 204;
pub const NodeTag_T_CreateStatsStmt: NodeTag = 205;
pub const NodeTag_T_StatsElem: NodeTag = 206;
pub const NodeTag_T_AlterStatsStmt: NodeTag = 207;
pub const NodeTag_T_CreateFunctionStmt: NodeTag = 208;
pub const NodeTag_T_FunctionParameter: NodeTag = 209;
pub const NodeTag_T_AlterFunctionStmt: NodeTag = 210;
pub const NodeTag_T_DoStmt: NodeTag = 211;
pub const NodeTag_T_InlineCodeBlock: NodeTag = 212;
pub const NodeTag_T_CallStmt: NodeTag = 213;
pub const NodeTag_T_CallContext: NodeTag = 214;
pub const NodeTag_T_RenameStmt: NodeTag = 215;
pub const NodeTag_T_AlterObjectDependsStmt: NodeTag = 216;
pub const NodeTag_T_AlterObjectSchemaStmt: NodeTag = 217;
pub const NodeTag_T_AlterOwnerStmt: NodeTag = 218;
pub const NodeTag_T_AlterOperatorStmt: NodeTag = 219;
pub const NodeTag_T_AlterTypeStmt: NodeTag = 220;
pub const NodeTag_T_RuleStmt: NodeTag = 221;
pub const NodeTag_T_NotifyStmt: NodeTag = 222;
pub const NodeTag_T_ListenStmt: NodeTag = 223;
pub const NodeTag_T_UnlistenStmt: NodeTag = 224;
pub const NodeTag_T_TransactionStmt: NodeTag = 225;
pub const NodeTag_T_CompositeTypeStmt: NodeTag = 226;
pub const NodeTag_T_CreateEnumStmt: NodeTag = 227;
pub const NodeTag_T_CreateRangeStmt: NodeTag = 228;
pub const NodeTag_T_AlterEnumStmt: NodeTag = 229;
pub const NodeTag_T_ViewStmt: NodeTag = 230;
pub const NodeTag_T_LoadStmt: NodeTag = 231;
pub const NodeTag_T_CreatedbStmt: NodeTag = 232;
pub const NodeTag_T_AlterDatabaseStmt: NodeTag = 233;
pub const NodeTag_T_AlterDatabaseRefreshCollStmt: NodeTag = 234;
pub const NodeTag_T_AlterDatabaseSetStmt: NodeTag = 235;
pub const NodeTag_T_DropdbStmt: NodeTag = 236;
pub const NodeTag_T_AlterSystemStmt: NodeTag = 237;
pub const NodeTag_T_ClusterStmt: NodeTag = 238;
pub const NodeTag_T_VacuumStmt: NodeTag = 239;
pub const NodeTag_T_VacuumRelation: NodeTag = 240;
pub const NodeTag_T_ExplainStmt: NodeTag = 241;
pub const NodeTag_T_CreateTableAsStmt: NodeTag = 242;
pub const NodeTag_T_RefreshMatViewStmt: NodeTag = 243;
pub const NodeTag_T_CheckPointStmt: NodeTag = 244;
pub const NodeTag_T_DiscardStmt: NodeTag = 245;
pub const NodeTag_T_LockStmt: NodeTag = 246;
pub const NodeTag_T_ConstraintsSetStmt: NodeTag = 247;
pub const NodeTag_T_ReindexStmt: NodeTag = 248;
pub const NodeTag_T_CreateConversionStmt: NodeTag = 249;
pub const NodeTag_T_CreateCastStmt: NodeTag = 250;
pub const NodeTag_T_CreateTransformStmt: NodeTag = 251;
pub const NodeTag_T_PrepareStmt: NodeTag = 252;
pub const NodeTag_T_ExecuteStmt: NodeTag = 253;
pub const NodeTag_T_DeallocateStmt: NodeTag = 254;
pub const NodeTag_T_DropOwnedStmt: NodeTag = 255;
pub const NodeTag_T_ReassignOwnedStmt: NodeTag = 256;
pub const NodeTag_T_AlterTSDictionaryStmt: NodeTag = 257;
pub const NodeTag_T_AlterTSConfigurationStmt: NodeTag = 258;
pub const NodeTag_T_PublicationTable: NodeTag = 259;
pub const NodeTag_T_PublicationObjSpec: NodeTag = 260;
pub const NodeTag_T_CreatePublicationStmt: NodeTag = 261;
pub const NodeTag_T_AlterPublicationStmt: NodeTag = 262;
pub const NodeTag_T_CreateSubscriptionStmt: NodeTag = 263;
pub const NodeTag_T_AlterSubscriptionStmt: NodeTag = 264;
pub const NodeTag_T_DropSubscriptionStmt: NodeTag = 265;
pub const NodeTag_T_PlannerGlobal: NodeTag = 266;
pub const NodeTag_T_PlannerInfo: NodeTag = 267;
pub const NodeTag_T_RelOptInfo: NodeTag = 268;
pub const NodeTag_T_IndexOptInfo: NodeTag = 269;
pub const NodeTag_T_ForeignKeyOptInfo: NodeTag = 270;
pub const NodeTag_T_StatisticExtInfo: NodeTag = 271;
pub const NodeTag_T_JoinDomain: NodeTag = 272;
pub const NodeTag_T_EquivalenceClass: NodeTag = 273;
pub const NodeTag_T_EquivalenceMember: NodeTag = 274;
pub const NodeTag_T_PathKey: NodeTag = 275;
pub const NodeTag_T_GroupByOrdering: NodeTag = 276;
pub const NodeTag_T_PathTarget: NodeTag = 277;
pub const NodeTag_T_ParamPathInfo: NodeTag = 278;
pub const NodeTag_T_Path: NodeTag = 279;
pub const NodeTag_T_IndexPath: NodeTag = 280;
pub const NodeTag_T_IndexClause: NodeTag = 281;
pub const NodeTag_T_BitmapHeapPath: NodeTag = 282;
pub const NodeTag_T_BitmapAndPath: NodeTag = 283;
pub const NodeTag_T_BitmapOrPath: NodeTag = 284;
pub const NodeTag_T_TidPath: NodeTag = 285;
pub const NodeTag_T_TidRangePath: NodeTag = 286;
pub const NodeTag_T_SubqueryScanPath: NodeTag = 287;
pub const NodeTag_T_ForeignPath: NodeTag = 288;
pub const NodeTag_T_CustomPath: NodeTag = 289;
pub const NodeTag_T_AppendPath: NodeTag = 290;
pub const NodeTag_T_MergeAppendPath: NodeTag = 291;
pub const NodeTag_T_GroupResultPath: NodeTag = 292;
pub const NodeTag_T_MaterialPath: NodeTag = 293;
pub const NodeTag_T_MemoizePath: NodeTag = 294;
pub const NodeTag_T_UniquePath: NodeTag = 295;
pub const NodeTag_T_GatherPath: NodeTag = 296;
pub const NodeTag_T_GatherMergePath: NodeTag = 297;
pub const NodeTag_T_NestPath: NodeTag = 298;
pub const NodeTag_T_MergePath: NodeTag = 299;
pub const NodeTag_T_HashPath: NodeTag = 300;
pub const NodeTag_T_ProjectionPath: NodeTag = 301;
pub const NodeTag_T_ProjectSetPath: NodeTag = 302;
pub const NodeTag_T_SortPath: NodeTag = 303;
pub const NodeTag_T_IncrementalSortPath: NodeTag = 304;
pub const NodeTag_T_GroupPath: NodeTag = 305;
pub const NodeTag_T_UpperUniquePath: NodeTag = 306;
pub const NodeTag_T_AggPath: NodeTag = 307;
pub const NodeTag_T_GroupingSetData: NodeTag = 308;
pub const NodeTag_T_RollupData: NodeTag = 309;
pub const NodeTag_T_GroupingSetsPath: NodeTag = 310;
pub const NodeTag_T_MinMaxAggPath: NodeTag = 311;
pub const NodeTag_T_WindowAggPath: NodeTag = 312;
pub const NodeTag_T_SetOpPath: NodeTag = 313;
pub const NodeTag_T_RecursiveUnionPath: NodeTag = 314;
pub const NodeTag_T_LockRowsPath: NodeTag = 315;
pub const NodeTag_T_ModifyTablePath: NodeTag = 316;
pub const NodeTag_T_LimitPath: NodeTag = 317;
pub const NodeTag_T_RestrictInfo: NodeTag = 318;
pub const NodeTag_T_PlaceHolderVar: NodeTag = 319;
pub const NodeTag_T_SpecialJoinInfo: NodeTag = 320;
pub const NodeTag_T_OuterJoinClauseInfo: NodeTag = 321;
pub const NodeTag_T_AppendRelInfo: NodeTag = 322;
pub const NodeTag_T_RowIdentityVarInfo: NodeTag = 323;
pub const NodeTag_T_PlaceHolderInfo: NodeTag = 324;
pub const NodeTag_T_MinMaxAggInfo: NodeTag = 325;
pub const NodeTag_T_PlannerParamItem: NodeTag = 326;
pub const NodeTag_T_AggInfo: NodeTag = 327;
pub const NodeTag_T_AggTransInfo: NodeTag = 328;
pub const NodeTag_T_UniqueRelInfo: NodeTag = 329;
pub const NodeTag_T_PlannedStmt: NodeTag = 330;
pub const NodeTag_T_Result: NodeTag = 331;
pub const NodeTag_T_ProjectSet: NodeTag = 332;
pub const NodeTag_T_ModifyTable: NodeTag = 333;
pub const NodeTag_T_Append: NodeTag = 334;
pub const NodeTag_T_MergeAppend: NodeTag = 335;
pub const NodeTag_T_RecursiveUnion: NodeTag = 336;
pub const NodeTag_T_BitmapAnd: NodeTag = 337;
pub const NodeTag_T_BitmapOr: NodeTag = 338;
pub const NodeTag_T_SeqScan: NodeTag = 339;
pub const NodeTag_T_SampleScan: NodeTag = 340;
pub const NodeTag_T_IndexScan: NodeTag = 341;
pub const NodeTag_T_IndexOnlyScan: NodeTag = 342;
pub const NodeTag_T_BitmapIndexScan: NodeTag = 343;
pub const NodeTag_T_BitmapHeapScan: NodeTag = 344;
pub const NodeTag_T_TidScan: NodeTag = 345;
pub const NodeTag_T_TidRangeScan: NodeTag = 346;
pub const NodeTag_T_SubqueryScan: NodeTag = 347;
pub const NodeTag_T_FunctionScan: NodeTag = 348;
pub const NodeTag_T_ValuesScan: NodeTag = 349;
pub const NodeTag_T_TableFuncScan: NodeTag = 350;
pub const NodeTag_T_CteScan: NodeTag = 351;
pub const NodeTag_T_NamedTuplestoreScan: NodeTag = 352;
pub const NodeTag_T_WorkTableScan: NodeTag = 353;
pub const NodeTag_T_ForeignScan: NodeTag = 354;
pub const NodeTag_T_CustomScan: NodeTag = 355;
pub const NodeTag_T_NestLoop: NodeTag = 356;
pub const NodeTag_T_NestLoopParam: NodeTag = 357;
pub const NodeTag_T_MergeJoin: NodeTag = 358;
pub const NodeTag_T_HashJoin: NodeTag = 359;
pub const NodeTag_T_Material: NodeTag = 360;
pub const NodeTag_T_Memoize: NodeTag = 361;
pub const NodeTag_T_Sort: NodeTag = 362;
pub const NodeTag_T_IncrementalSort: NodeTag = 363;
pub const NodeTag_T_Group: NodeTag = 364;
pub const NodeTag_T_Agg: NodeTag = 365;
pub const NodeTag_T_WindowAgg: NodeTag = 366;
pub const NodeTag_T_Unique: NodeTag = 367;
pub const NodeTag_T_Gather: NodeTag = 368;
pub const NodeTag_T_GatherMerge: NodeTag = 369;
pub const NodeTag_T_Hash: NodeTag = 370;
pub const NodeTag_T_SetOp: NodeTag = 371;
pub const NodeTag_T_LockRows: NodeTag = 372;
pub const NodeTag_T_Limit: NodeTag = 373;
pub const NodeTag_T_PlanRowMark: NodeTag = 374;
pub const NodeTag_T_PartitionPruneInfo: NodeTag = 375;
pub const NodeTag_T_PartitionedRelPruneInfo: NodeTag = 376;
pub const NodeTag_T_PartitionPruneStepOp: NodeTag = 377;
pub const NodeTag_T_PartitionPruneStepCombine: NodeTag = 378;
pub const NodeTag_T_PlanInvalItem: NodeTag = 379;
pub const NodeTag_T_ExprState: NodeTag = 380;
pub const NodeTag_T_IndexInfo: NodeTag = 381;
pub const NodeTag_T_ExprContext: NodeTag = 382;
pub const NodeTag_T_ReturnSetInfo: NodeTag = 383;
pub const NodeTag_T_ProjectionInfo: NodeTag = 384;
pub const NodeTag_T_JunkFilter: NodeTag = 385;
pub const NodeTag_T_OnConflictSetState: NodeTag = 386;
pub const NodeTag_T_MergeActionState: NodeTag = 387;
pub const NodeTag_T_ResultRelInfo: NodeTag = 388;
pub const NodeTag_T_EState: NodeTag = 389;
pub const NodeTag_T_WindowFuncExprState: NodeTag = 390;
pub const NodeTag_T_SetExprState: NodeTag = 391;
pub const NodeTag_T_SubPlanState: NodeTag = 392;
pub const NodeTag_T_DomainConstraintState: NodeTag = 393;
pub const NodeTag_T_ResultState: NodeTag = 394;
pub const NodeTag_T_ProjectSetState: NodeTag = 395;
pub const NodeTag_T_ModifyTableState: NodeTag = 396;
pub const NodeTag_T_AppendState: NodeTag = 397;
pub const NodeTag_T_MergeAppendState: NodeTag = 398;
pub const NodeTag_T_RecursiveUnionState: NodeTag = 399;
pub const NodeTag_T_BitmapAndState: NodeTag = 400;
pub const NodeTag_T_BitmapOrState: NodeTag = 401;
pub const NodeTag_T_ScanState: NodeTag = 402;
pub const NodeTag_T_SeqScanState: NodeTag = 403;
pub const NodeTag_T_SampleScanState: NodeTag = 404;
pub const NodeTag_T_IndexScanState: NodeTag = 405;
pub const NodeTag_T_IndexOnlyScanState: NodeTag = 406;
pub const NodeTag_T_BitmapIndexScanState: NodeTag = 407;
pub const NodeTag_T_BitmapHeapScanState: NodeTag = 408;
pub const NodeTag_T_TidScanState: NodeTag = 409;
pub const NodeTag_T_TidRangeScanState: NodeTag = 410;
pub const NodeTag_T_SubqueryScanState: NodeTag = 411;
pub const NodeTag_T_FunctionScanState: NodeTag = 412;
pub const NodeTag_T_ValuesScanState: NodeTag = 413;
pub const NodeTag_T_TableFuncScanState: NodeTag = 414;
pub const NodeTag_T_CteScanState: NodeTag = 415;
pub const NodeTag_T_NamedTuplestoreScanState: NodeTag = 416;
pub const NodeTag_T_WorkTableScanState: NodeTag = 417;
pub const NodeTag_T_ForeignScanState: NodeTag = 418;
pub const NodeTag_T_CustomScanState: NodeTag = 419;
pub const NodeTag_T_JoinState: NodeTag = 420;
pub const NodeTag_T_NestLoopState: NodeTag = 421;
pub const NodeTag_T_MergeJoinState: NodeTag = 422;
pub const NodeTag_T_HashJoinState: NodeTag = 423;
pub const NodeTag_T_MaterialState: NodeTag = 424;
pub const NodeTag_T_MemoizeState: NodeTag = 425;
pub const NodeTag_T_SortState: NodeTag = 426;
pub const NodeTag_T_IncrementalSortState: NodeTag = 427;
pub const NodeTag_T_GroupState: NodeTag = 428;
pub const NodeTag_T_AggState: NodeTag = 429;
pub const NodeTag_T_WindowAggState: NodeTag = 430;
pub const NodeTag_T_UniqueState: NodeTag = 431;
pub const NodeTag_T_GatherState: NodeTag = 432;
pub const NodeTag_T_GatherMergeState: NodeTag = 433;
pub const NodeTag_T_HashState: NodeTag = 434;
pub const NodeTag_T_SetOpState: NodeTag = 435;
pub const NodeTag_T_LockRowsState: NodeTag = 436;
pub const NodeTag_T_LimitState: NodeTag = 437;
pub const NodeTag_T_IndexAmRoutine: NodeTag = 438;
pub const NodeTag_T_TableAmRoutine: NodeTag = 439;
pub const NodeTag_T_TsmRoutine: NodeTag = 440;
pub const NodeTag_T_EventTriggerData: NodeTag = 441;
pub const NodeTag_T_TriggerData: NodeTag = 442;
pub const NodeTag_T_TupleTableSlot: NodeTag = 443;
pub const NodeTag_T_FdwRoutine: NodeTag = 444;
pub const NodeTag_T_Bitmapset: NodeTag = 445;
pub const NodeTag_T_ExtensibleNode: NodeTag = 446;
pub const NodeTag_T_ErrorSaveContext: NodeTag = 447;
pub const NodeTag_T_IdentifySystemCmd: NodeTag = 448;
pub const NodeTag_T_BaseBackupCmd: NodeTag = 449;
pub const NodeTag_T_CreateReplicationSlotCmd: NodeTag = 450;
pub const NodeTag_T_DropReplicationSlotCmd: NodeTag = 451;
pub const NodeTag_T_AlterReplicationSlotCmd: NodeTag = 452;
pub const NodeTag_T_StartReplicationCmd: NodeTag = 453;
pub const NodeTag_T_ReadReplicationSlotCmd: NodeTag = 454;
pub const NodeTag_T_TimeLineHistoryCmd: NodeTag = 455;
pub const NodeTag_T_UploadManifestCmd: NodeTag = 456;
pub const NodeTag_T_SupportRequestSimplify: NodeTag = 457;
pub const NodeTag_T_SupportRequestSelectivity: NodeTag = 458;
pub const NodeTag_T_SupportRequestCost: NodeTag = 459;
pub const NodeTag_T_SupportRequestRows: NodeTag = 460;
pub const NodeTag_T_SupportRequestIndexCondition: NodeTag = 461;
pub const NodeTag_T_SupportRequestWFuncMonotonic: NodeTag = 462;
pub const NodeTag_T_SupportRequestOptimizeWindowClause: NodeTag = 463;
pub const NodeTag_T_SupportRequestModifyInPlace: NodeTag = 464;
pub const NodeTag_T_Integer: NodeTag = 465;
pub const NodeTag_T_Float: NodeTag = 466;
pub const NodeTag_T_Boolean: NodeTag = 467;
pub const NodeTag_T_String: NodeTag = 468;
pub const NodeTag_T_BitString: NodeTag = 469;
pub const NodeTag_T_ForeignKeyCacheInfo: NodeTag = 470;
pub const NodeTag_T_IntList: NodeTag = 471;
pub const NodeTag_T_OidList: NodeTag = 472;
pub const NodeTag_T_XidList: NodeTag = 473;
pub const NodeTag_T_AllocSetContext: NodeTag = 474;
pub const NodeTag_T_GenerationContext: NodeTag = 475;
pub const NodeTag_T_SlabContext: NodeTag = 476;
pub const NodeTag_T_BumpContext: NodeTag = 477;
pub const NodeTag_T_TIDBitmap: NodeTag = 478;
pub const NodeTag_T_WindowObjectData: NodeTag = 479;
pub type NodeTag = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Node {
    pub type_: NodeTag,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Node"][::std::mem::size_of::<Node>() - 4usize];
    ["Alignment of Node"][::std::mem::align_of::<Node>() - 4usize];
    ["Offset of field: Node::type_"][::std::mem::offset_of!(Node, type_) - 0usize];
};
pub type ParseLoc = ::std::os::raw::c_int;
pub type Cost = f64;
pub type Cardinality = f64;
pub const CmdType_CMD_UNKNOWN: CmdType = 0;
pub const CmdType_CMD_SELECT: CmdType = 1;
pub const CmdType_CMD_UPDATE: CmdType = 2;
pub const CmdType_CMD_INSERT: CmdType = 3;
pub const CmdType_CMD_DELETE: CmdType = 4;
pub const CmdType_CMD_MERGE: CmdType = 5;
pub const CmdType_CMD_UTILITY: CmdType = 6;
pub const CmdType_CMD_NOTHING: CmdType = 7;
pub type CmdType = ::std::os::raw::c_uint;
pub const JoinType_JOIN_INNER: JoinType = 0;
pub const JoinType_JOIN_LEFT: JoinType = 1;
pub const JoinType_JOIN_FULL: JoinType = 2;
pub const JoinType_JOIN_RIGHT: JoinType = 3;
pub const JoinType_JOIN_SEMI: JoinType = 4;
pub const JoinType_JOIN_ANTI: JoinType = 5;
pub const JoinType_JOIN_RIGHT_SEMI: JoinType = 6;
pub const JoinType_JOIN_RIGHT_ANTI: JoinType = 7;
pub const JoinType_JOIN_UNIQUE_OUTER: JoinType = 8;
pub const JoinType_JOIN_UNIQUE_INNER: JoinType = 9;
pub type JoinType = ::std::os::raw::c_uint;
pub const AggSplit_AGGSPLIT_SIMPLE: AggSplit = 0;
pub const AggSplit_AGGSPLIT_INITIAL_SERIAL: AggSplit = 6;
pub const AggSplit_AGGSPLIT_FINAL_DESERIAL: AggSplit = 9;
pub type AggSplit = ::std::os::raw::c_uint;
pub const OnConflictAction_ONCONFLICT_NONE: OnConflictAction = 0;
pub const OnConflictAction_ONCONFLICT_NOTHING: OnConflictAction = 1;
pub const OnConflictAction_ONCONFLICT_UPDATE: OnConflictAction = 2;
pub type OnConflictAction = ::std::os::raw::c_uint;
pub const LimitOption_LIMIT_OPTION_DEFAULT: LimitOption = 0;
pub const LimitOption_LIMIT_OPTION_COUNT: LimitOption = 1;
pub const LimitOption_LIMIT_OPTION_WITH_TIES: LimitOption = 2;
pub type LimitOption = ::std::os::raw::c_uint;
pub type bitmapword = uint64;
#[repr(C)]
#[derive(Debug)]
pub struct Bitmapset {
    pub type_: NodeTag,
    pub nwords: ::std::os::raw::c_int,
    pub words: __IncompleteArrayField<bitmapword>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Bitmapset"][::std::mem::size_of::<Bitmapset>() - 8usize];
    ["Alignment of Bitmapset"][::std::mem::align_of::<Bitmapset>() - 8usize];
    ["Offset of field: Bitmapset::type_"][::std::mem::offset_of!(Bitmapset, type_) - 0usize];
    ["Offset of field: Bitmapset::nwords"][::std::mem::offset_of!(Bitmapset, nwords) - 4usize];
    ["Offset of field: Bitmapset::words"][::std::mem::offset_of!(Bitmapset, words) - 8usize];
};
pub const LockClauseStrength_LCS_NONE: LockClauseStrength = 0;
pub const LockClauseStrength_LCS_FORKEYSHARE: LockClauseStrength = 1;
pub const LockClauseStrength_LCS_FORSHARE: LockClauseStrength = 2;
pub const LockClauseStrength_LCS_FORNOKEYUPDATE: LockClauseStrength = 3;
pub const LockClauseStrength_LCS_FORUPDATE: LockClauseStrength = 4;
pub type LockClauseStrength = ::std::os::raw::c_uint;
pub const LockWaitPolicy_LockWaitBlock: LockWaitPolicy = 0;
pub const LockWaitPolicy_LockWaitSkip: LockWaitPolicy = 1;
pub const LockWaitPolicy_LockWaitError: LockWaitPolicy = 2;
pub type LockWaitPolicy = ::std::os::raw::c_uint;
pub type AttrNumber = int16;
pub const CompareType_COMPARE_INVALID: CompareType = 0;
pub const CompareType_COMPARE_LT: CompareType = 1;
pub const CompareType_COMPARE_LE: CompareType = 2;
pub const CompareType_COMPARE_EQ: CompareType = 3;
pub const CompareType_COMPARE_GE: CompareType = 4;
pub const CompareType_COMPARE_GT: CompareType = 5;
pub const CompareType_COMPARE_NE: CompareType = 6;
pub const CompareType_COMPARE_OVERLAP: CompareType = 7;
pub const CompareType_COMPARE_CONTAINED_BY: CompareType = 8;
pub type CompareType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ListCell {
    pub ptr_value: *mut ::std::os::raw::c_void,
    pub int_value: ::std::os::raw::c_int,
    pub oid_value: Oid,
    pub xid_value: TransactionId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ListCell"][::std::mem::size_of::<ListCell>() - 8usize];
    ["Alignment of ListCell"][::std::mem::align_of::<ListCell>() - 8usize];
    ["Offset of field: ListCell::ptr_value"][::std::mem::offset_of!(ListCell, ptr_value) - 0usize];
    ["Offset of field: ListCell::int_value"][::std::mem::offset_of!(ListCell, int_value) - 0usize];
    ["Offset of field: ListCell::oid_value"][::std::mem::offset_of!(ListCell, oid_value) - 0usize];
    ["Offset of field: ListCell::xid_value"][::std::mem::offset_of!(ListCell, xid_value) - 0usize];
};
#[repr(C)]
pub struct List {
    pub type_: NodeTag,
    pub length: ::std::os::raw::c_int,
    pub max_length: ::std::os::raw::c_int,
    pub elements: *mut ListCell,
    pub initial_elements: __IncompleteArrayField<ListCell>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of List"][::std::mem::size_of::<List>() - 24usize];
    ["Alignment of List"][::std::mem::align_of::<List>() - 8usize];
    ["Offset of field: List::type_"][::std::mem::offset_of!(List, type_) - 0usize];
    ["Offset of field: List::length"][::std::mem::offset_of!(List, length) - 4usize];
    ["Offset of field: List::max_length"][::std::mem::offset_of!(List, max_length) - 8usize];
    ["Offset of field: List::elements"][::std::mem::offset_of!(List, elements) - 16usize];
    ["Offset of field: List::initial_elements"]
        [::std::mem::offset_of!(List, initial_elements) - 24usize];
};
pub const OverridingKind_OVERRIDING_NOT_SET: OverridingKind = 0;
pub const OverridingKind_OVERRIDING_USER_VALUE: OverridingKind = 1;
pub const OverridingKind_OVERRIDING_SYSTEM_VALUE: OverridingKind = 2;
pub type OverridingKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Alias {
    pub type_: NodeTag,
    pub aliasname: *mut ::std::os::raw::c_char,
    pub colnames: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Alias"][::std::mem::size_of::<Alias>() - 24usize];
    ["Alignment of Alias"][::std::mem::align_of::<Alias>() - 8usize];
    ["Offset of field: Alias::type_"][::std::mem::offset_of!(Alias, type_) - 0usize];
    ["Offset of field: Alias::aliasname"][::std::mem::offset_of!(Alias, aliasname) - 8usize];
    ["Offset of field: Alias::colnames"][::std::mem::offset_of!(Alias, colnames) - 16usize];
};
pub const OnCommitAction_ONCOMMIT_NOOP: OnCommitAction = 0;
pub const OnCommitAction_ONCOMMIT_PRESERVE_ROWS: OnCommitAction = 1;
pub const OnCommitAction_ONCOMMIT_DELETE_ROWS: OnCommitAction = 2;
pub const OnCommitAction_ONCOMMIT_DROP: OnCommitAction = 3;
pub type OnCommitAction = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeVar {
    pub type_: NodeTag,
    pub catalogname: *mut ::std::os::raw::c_char,
    pub schemaname: *mut ::std::os::raw::c_char,
    pub relname: *mut ::std::os::raw::c_char,
    pub inh: bool,
    pub relpersistence: ::std::os::raw::c_char,
    pub alias: *mut Alias,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeVar"][::std::mem::size_of::<RangeVar>() - 56usize];
    ["Alignment of RangeVar"][::std::mem::align_of::<RangeVar>() - 8usize];
    ["Offset of field: RangeVar::type_"][::std::mem::offset_of!(RangeVar, type_) - 0usize];
    ["Offset of field: RangeVar::catalogname"]
        [::std::mem::offset_of!(RangeVar, catalogname) - 8usize];
    ["Offset of field: RangeVar::schemaname"]
        [::std::mem::offset_of!(RangeVar, schemaname) - 16usize];
    ["Offset of field: RangeVar::relname"][::std::mem::offset_of!(RangeVar, relname) - 24usize];
    ["Offset of field: RangeVar::inh"][::std::mem::offset_of!(RangeVar, inh) - 32usize];
    ["Offset of field: RangeVar::relpersistence"]
        [::std::mem::offset_of!(RangeVar, relpersistence) - 33usize];
    ["Offset of field: RangeVar::alias"][::std::mem::offset_of!(RangeVar, alias) - 40usize];
    ["Offset of field: RangeVar::location"][::std::mem::offset_of!(RangeVar, location) - 48usize];
};
pub const TableFuncType_TFT_XMLTABLE: TableFuncType = 0;
pub const TableFuncType_TFT_JSON_TABLE: TableFuncType = 1;
pub type TableFuncType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableFunc {
    pub type_: NodeTag,
    pub functype: TableFuncType,
    pub ns_uris: *mut List,
    pub ns_names: *mut List,
    pub docexpr: *mut Node,
    pub rowexpr: *mut Node,
    pub colnames: *mut List,
    pub coltypes: *mut List,
    pub coltypmods: *mut List,
    pub colcollations: *mut List,
    pub colexprs: *mut List,
    pub coldefexprs: *mut List,
    pub colvalexprs: *mut List,
    pub passingvalexprs: *mut List,
    pub notnulls: *mut Bitmapset,
    pub plan: *mut Node,
    pub ordinalitycol: ::std::os::raw::c_int,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TableFunc"][::std::mem::size_of::<TableFunc>() - 128usize];
    ["Alignment of TableFunc"][::std::mem::align_of::<TableFunc>() - 8usize];
    ["Offset of field: TableFunc::type_"][::std::mem::offset_of!(TableFunc, type_) - 0usize];
    ["Offset of field: TableFunc::functype"][::std::mem::offset_of!(TableFunc, functype) - 4usize];
    ["Offset of field: TableFunc::ns_uris"][::std::mem::offset_of!(TableFunc, ns_uris) - 8usize];
    ["Offset of field: TableFunc::ns_names"][::std::mem::offset_of!(TableFunc, ns_names) - 16usize];
    ["Offset of field: TableFunc::docexpr"][::std::mem::offset_of!(TableFunc, docexpr) - 24usize];
    ["Offset of field: TableFunc::rowexpr"][::std::mem::offset_of!(TableFunc, rowexpr) - 32usize];
    ["Offset of field: TableFunc::colnames"][::std::mem::offset_of!(TableFunc, colnames) - 40usize];
    ["Offset of field: TableFunc::coltypes"][::std::mem::offset_of!(TableFunc, coltypes) - 48usize];
    ["Offset of field: TableFunc::coltypmods"]
        [::std::mem::offset_of!(TableFunc, coltypmods) - 56usize];
    ["Offset of field: TableFunc::colcollations"]
        [::std::mem::offset_of!(TableFunc, colcollations) - 64usize];
    ["Offset of field: TableFunc::colexprs"][::std::mem::offset_of!(TableFunc, colexprs) - 72usize];
    ["Offset of field: TableFunc::coldefexprs"]
        [::std::mem::offset_of!(TableFunc, coldefexprs) - 80usize];
    ["Offset of field: TableFunc::colvalexprs"]
        [::std::mem::offset_of!(TableFunc, colvalexprs) - 88usize];
    ["Offset of field: TableFunc::passingvalexprs"]
        [::std::mem::offset_of!(TableFunc, passingvalexprs) - 96usize];
    ["Offset of field: TableFunc::notnulls"]
        [::std::mem::offset_of!(TableFunc, notnulls) - 104usize];
    ["Offset of field: TableFunc::plan"][::std::mem::offset_of!(TableFunc, plan) - 112usize];
    ["Offset of field: TableFunc::ordinalitycol"]
        [::std::mem::offset_of!(TableFunc, ordinalitycol) - 120usize];
    ["Offset of field: TableFunc::location"]
        [::std::mem::offset_of!(TableFunc, location) - 124usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IntoClause {
    pub type_: NodeTag,
    pub rel: *mut RangeVar,
    pub colNames: *mut List,
    pub accessMethod: *mut ::std::os::raw::c_char,
    pub options: *mut List,
    pub onCommit: OnCommitAction,
    pub tableSpaceName: *mut ::std::os::raw::c_char,
    pub viewQuery: *mut Query,
    pub skipData: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IntoClause"][::std::mem::size_of::<IntoClause>() - 72usize];
    ["Alignment of IntoClause"][::std::mem::align_of::<IntoClause>() - 8usize];
    ["Offset of field: IntoClause::type_"][::std::mem::offset_of!(IntoClause, type_) - 0usize];
    ["Offset of field: IntoClause::rel"][::std::mem::offset_of!(IntoClause, rel) - 8usize];
    ["Offset of field: IntoClause::colNames"]
        [::std::mem::offset_of!(IntoClause, colNames) - 16usize];
    ["Offset of field: IntoClause::accessMethod"]
        [::std::mem::offset_of!(IntoClause, accessMethod) - 24usize];
    ["Offset of field: IntoClause::options"][::std::mem::offset_of!(IntoClause, options) - 32usize];
    ["Offset of field: IntoClause::onCommit"]
        [::std::mem::offset_of!(IntoClause, onCommit) - 40usize];
    ["Offset of field: IntoClause::tableSpaceName"]
        [::std::mem::offset_of!(IntoClause, tableSpaceName) - 48usize];
    ["Offset of field: IntoClause::viewQuery"]
        [::std::mem::offset_of!(IntoClause, viewQuery) - 56usize];
    ["Offset of field: IntoClause::skipData"]
        [::std::mem::offset_of!(IntoClause, skipData) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Expr {
    pub type_: NodeTag,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Expr"][::std::mem::size_of::<Expr>() - 4usize];
    ["Alignment of Expr"][::std::mem::align_of::<Expr>() - 4usize];
    ["Offset of field: Expr::type_"][::std::mem::offset_of!(Expr, type_) - 0usize];
};
pub const VarReturningType_VAR_RETURNING_DEFAULT: VarReturningType = 0;
pub const VarReturningType_VAR_RETURNING_OLD: VarReturningType = 1;
pub const VarReturningType_VAR_RETURNING_NEW: VarReturningType = 2;
pub type VarReturningType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Var {
    pub xpr: Expr,
    pub varno: ::std::os::raw::c_int,
    pub varattno: AttrNumber,
    pub vartype: Oid,
    pub vartypmod: int32,
    pub varcollid: Oid,
    pub varnullingrels: *mut Bitmapset,
    pub varlevelsup: Index,
    pub varreturningtype: VarReturningType,
    pub varnosyn: Index,
    pub varattnosyn: AttrNumber,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Var"][::std::mem::size_of::<Var>() - 56usize];
    ["Alignment of Var"][::std::mem::align_of::<Var>() - 8usize];
    ["Offset of field: Var::xpr"][::std::mem::offset_of!(Var, xpr) - 0usize];
    ["Offset of field: Var::varno"][::std::mem::offset_of!(Var, varno) - 4usize];
    ["Offset of field: Var::varattno"][::std::mem::offset_of!(Var, varattno) - 8usize];
    ["Offset of field: Var::vartype"][::std::mem::offset_of!(Var, vartype) - 12usize];
    ["Offset of field: Var::vartypmod"][::std::mem::offset_of!(Var, vartypmod) - 16usize];
    ["Offset of field: Var::varcollid"][::std::mem::offset_of!(Var, varcollid) - 20usize];
    ["Offset of field: Var::varnullingrels"][::std::mem::offset_of!(Var, varnullingrels) - 24usize];
    ["Offset of field: Var::varlevelsup"][::std::mem::offset_of!(Var, varlevelsup) - 32usize];
    ["Offset of field: Var::varreturningtype"]
        [::std::mem::offset_of!(Var, varreturningtype) - 36usize];
    ["Offset of field: Var::varnosyn"][::std::mem::offset_of!(Var, varnosyn) - 40usize];
    ["Offset of field: Var::varattnosyn"][::std::mem::offset_of!(Var, varattnosyn) - 44usize];
    ["Offset of field: Var::location"][::std::mem::offset_of!(Var, location) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Const {
    pub xpr: Expr,
    pub consttype: Oid,
    pub consttypmod: int32,
    pub constcollid: Oid,
    pub constlen: ::std::os::raw::c_int,
    pub constvalue: Datum,
    pub constisnull: bool,
    pub constbyval: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Const"][::std::mem::size_of::<Const>() - 40usize];
    ["Alignment of Const"][::std::mem::align_of::<Const>() - 8usize];
    ["Offset of field: Const::xpr"][::std::mem::offset_of!(Const, xpr) - 0usize];
    ["Offset of field: Const::consttype"][::std::mem::offset_of!(Const, consttype) - 4usize];
    ["Offset of field: Const::consttypmod"][::std::mem::offset_of!(Const, consttypmod) - 8usize];
    ["Offset of field: Const::constcollid"][::std::mem::offset_of!(Const, constcollid) - 12usize];
    ["Offset of field: Const::constlen"][::std::mem::offset_of!(Const, constlen) - 16usize];
    ["Offset of field: Const::constvalue"][::std::mem::offset_of!(Const, constvalue) - 24usize];
    ["Offset of field: Const::constisnull"][::std::mem::offset_of!(Const, constisnull) - 32usize];
    ["Offset of field: Const::constbyval"][::std::mem::offset_of!(Const, constbyval) - 33usize];
    ["Offset of field: Const::location"][::std::mem::offset_of!(Const, location) - 36usize];
};
pub const ParamKind_PARAM_EXTERN: ParamKind = 0;
pub const ParamKind_PARAM_EXEC: ParamKind = 1;
pub const ParamKind_PARAM_SUBLINK: ParamKind = 2;
pub const ParamKind_PARAM_MULTIEXPR: ParamKind = 3;
pub type ParamKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Param {
    pub xpr: Expr,
    pub paramkind: ParamKind,
    pub paramid: ::std::os::raw::c_int,
    pub paramtype: Oid,
    pub paramtypmod: int32,
    pub paramcollid: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Param"][::std::mem::size_of::<Param>() - 28usize];
    ["Alignment of Param"][::std::mem::align_of::<Param>() - 4usize];
    ["Offset of field: Param::xpr"][::std::mem::offset_of!(Param, xpr) - 0usize];
    ["Offset of field: Param::paramkind"][::std::mem::offset_of!(Param, paramkind) - 4usize];
    ["Offset of field: Param::paramid"][::std::mem::offset_of!(Param, paramid) - 8usize];
    ["Offset of field: Param::paramtype"][::std::mem::offset_of!(Param, paramtype) - 12usize];
    ["Offset of field: Param::paramtypmod"][::std::mem::offset_of!(Param, paramtypmod) - 16usize];
    ["Offset of field: Param::paramcollid"][::std::mem::offset_of!(Param, paramcollid) - 20usize];
    ["Offset of field: Param::location"][::std::mem::offset_of!(Param, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Aggref {
    pub xpr: Expr,
    pub aggfnoid: Oid,
    pub aggtype: Oid,
    pub aggcollid: Oid,
    pub inputcollid: Oid,
    pub aggtranstype: Oid,
    pub aggargtypes: *mut List,
    pub aggdirectargs: *mut List,
    pub args: *mut List,
    pub aggorder: *mut List,
    pub aggdistinct: *mut List,
    pub aggfilter: *mut Expr,
    pub aggstar: bool,
    pub aggvariadic: bool,
    pub aggkind: ::std::os::raw::c_char,
    pub aggpresorted: bool,
    pub agglevelsup: Index,
    pub aggsplit: AggSplit,
    pub aggno: ::std::os::raw::c_int,
    pub aggtransno: ::std::os::raw::c_int,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Aggref"][::std::mem::size_of::<Aggref>() - 96usize];
    ["Alignment of Aggref"][::std::mem::align_of::<Aggref>() - 8usize];
    ["Offset of field: Aggref::xpr"][::std::mem::offset_of!(Aggref, xpr) - 0usize];
    ["Offset of field: Aggref::aggfnoid"][::std::mem::offset_of!(Aggref, aggfnoid) - 4usize];
    ["Offset of field: Aggref::aggtype"][::std::mem::offset_of!(Aggref, aggtype) - 8usize];
    ["Offset of field: Aggref::aggcollid"][::std::mem::offset_of!(Aggref, aggcollid) - 12usize];
    ["Offset of field: Aggref::inputcollid"][::std::mem::offset_of!(Aggref, inputcollid) - 16usize];
    ["Offset of field: Aggref::aggtranstype"]
        [::std::mem::offset_of!(Aggref, aggtranstype) - 20usize];
    ["Offset of field: Aggref::aggargtypes"][::std::mem::offset_of!(Aggref, aggargtypes) - 24usize];
    ["Offset of field: Aggref::aggdirectargs"]
        [::std::mem::offset_of!(Aggref, aggdirectargs) - 32usize];
    ["Offset of field: Aggref::args"][::std::mem::offset_of!(Aggref, args) - 40usize];
    ["Offset of field: Aggref::aggorder"][::std::mem::offset_of!(Aggref, aggorder) - 48usize];
    ["Offset of field: Aggref::aggdistinct"][::std::mem::offset_of!(Aggref, aggdistinct) - 56usize];
    ["Offset of field: Aggref::aggfilter"][::std::mem::offset_of!(Aggref, aggfilter) - 64usize];
    ["Offset of field: Aggref::aggstar"][::std::mem::offset_of!(Aggref, aggstar) - 72usize];
    ["Offset of field: Aggref::aggvariadic"][::std::mem::offset_of!(Aggref, aggvariadic) - 73usize];
    ["Offset of field: Aggref::aggkind"][::std::mem::offset_of!(Aggref, aggkind) - 74usize];
    ["Offset of field: Aggref::aggpresorted"]
        [::std::mem::offset_of!(Aggref, aggpresorted) - 75usize];
    ["Offset of field: Aggref::agglevelsup"][::std::mem::offset_of!(Aggref, agglevelsup) - 76usize];
    ["Offset of field: Aggref::aggsplit"][::std::mem::offset_of!(Aggref, aggsplit) - 80usize];
    ["Offset of field: Aggref::aggno"][::std::mem::offset_of!(Aggref, aggno) - 84usize];
    ["Offset of field: Aggref::aggtransno"][::std::mem::offset_of!(Aggref, aggtransno) - 88usize];
    ["Offset of field: Aggref::location"][::std::mem::offset_of!(Aggref, location) - 92usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GroupingFunc {
    pub xpr: Expr,
    pub args: *mut List,
    pub refs: *mut List,
    pub cols: *mut List,
    pub agglevelsup: Index,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GroupingFunc"][::std::mem::size_of::<GroupingFunc>() - 40usize];
    ["Alignment of GroupingFunc"][::std::mem::align_of::<GroupingFunc>() - 8usize];
    ["Offset of field: GroupingFunc::xpr"][::std::mem::offset_of!(GroupingFunc, xpr) - 0usize];
    ["Offset of field: GroupingFunc::args"][::std::mem::offset_of!(GroupingFunc, args) - 8usize];
    ["Offset of field: GroupingFunc::refs"][::std::mem::offset_of!(GroupingFunc, refs) - 16usize];
    ["Offset of field: GroupingFunc::cols"][::std::mem::offset_of!(GroupingFunc, cols) - 24usize];
    ["Offset of field: GroupingFunc::agglevelsup"]
        [::std::mem::offset_of!(GroupingFunc, agglevelsup) - 32usize];
    ["Offset of field: GroupingFunc::location"]
        [::std::mem::offset_of!(GroupingFunc, location) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WindowFunc {
    pub xpr: Expr,
    pub winfnoid: Oid,
    pub wintype: Oid,
    pub wincollid: Oid,
    pub inputcollid: Oid,
    pub args: *mut List,
    pub aggfilter: *mut Expr,
    pub runCondition: *mut List,
    pub winref: Index,
    pub winstar: bool,
    pub winagg: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WindowFunc"][::std::mem::size_of::<WindowFunc>() - 64usize];
    ["Alignment of WindowFunc"][::std::mem::align_of::<WindowFunc>() - 8usize];
    ["Offset of field: WindowFunc::xpr"][::std::mem::offset_of!(WindowFunc, xpr) - 0usize];
    ["Offset of field: WindowFunc::winfnoid"]
        [::std::mem::offset_of!(WindowFunc, winfnoid) - 4usize];
    ["Offset of field: WindowFunc::wintype"][::std::mem::offset_of!(WindowFunc, wintype) - 8usize];
    ["Offset of field: WindowFunc::wincollid"]
        [::std::mem::offset_of!(WindowFunc, wincollid) - 12usize];
    ["Offset of field: WindowFunc::inputcollid"]
        [::std::mem::offset_of!(WindowFunc, inputcollid) - 16usize];
    ["Offset of field: WindowFunc::args"][::std::mem::offset_of!(WindowFunc, args) - 24usize];
    ["Offset of field: WindowFunc::aggfilter"]
        [::std::mem::offset_of!(WindowFunc, aggfilter) - 32usize];
    ["Offset of field: WindowFunc::runCondition"]
        [::std::mem::offset_of!(WindowFunc, runCondition) - 40usize];
    ["Offset of field: WindowFunc::winref"][::std::mem::offset_of!(WindowFunc, winref) - 48usize];
    ["Offset of field: WindowFunc::winstar"][::std::mem::offset_of!(WindowFunc, winstar) - 52usize];
    ["Offset of field: WindowFunc::winagg"][::std::mem::offset_of!(WindowFunc, winagg) - 53usize];
    ["Offset of field: WindowFunc::location"]
        [::std::mem::offset_of!(WindowFunc, location) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WindowFuncRunCondition {
    pub xpr: Expr,
    pub opno: Oid,
    pub inputcollid: Oid,
    pub wfunc_left: bool,
    pub arg: *mut Expr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WindowFuncRunCondition"][::std::mem::size_of::<WindowFuncRunCondition>() - 24usize];
    ["Alignment of WindowFuncRunCondition"]
        [::std::mem::align_of::<WindowFuncRunCondition>() - 8usize];
    ["Offset of field: WindowFuncRunCondition::xpr"]
        [::std::mem::offset_of!(WindowFuncRunCondition, xpr) - 0usize];
    ["Offset of field: WindowFuncRunCondition::opno"]
        [::std::mem::offset_of!(WindowFuncRunCondition, opno) - 4usize];
    ["Offset of field: WindowFuncRunCondition::inputcollid"]
        [::std::mem::offset_of!(WindowFuncRunCondition, inputcollid) - 8usize];
    ["Offset of field: WindowFuncRunCondition::wfunc_left"]
        [::std::mem::offset_of!(WindowFuncRunCondition, wfunc_left) - 12usize];
    ["Offset of field: WindowFuncRunCondition::arg"]
        [::std::mem::offset_of!(WindowFuncRunCondition, arg) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MergeSupportFunc {
    pub xpr: Expr,
    pub msftype: Oid,
    pub msfcollid: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MergeSupportFunc"][::std::mem::size_of::<MergeSupportFunc>() - 16usize];
    ["Alignment of MergeSupportFunc"][::std::mem::align_of::<MergeSupportFunc>() - 4usize];
    ["Offset of field: MergeSupportFunc::xpr"]
        [::std::mem::offset_of!(MergeSupportFunc, xpr) - 0usize];
    ["Offset of field: MergeSupportFunc::msftype"]
        [::std::mem::offset_of!(MergeSupportFunc, msftype) - 4usize];
    ["Offset of field: MergeSupportFunc::msfcollid"]
        [::std::mem::offset_of!(MergeSupportFunc, msfcollid) - 8usize];
    ["Offset of field: MergeSupportFunc::location"]
        [::std::mem::offset_of!(MergeSupportFunc, location) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SubscriptingRef {
    pub xpr: Expr,
    pub refcontainertype: Oid,
    pub refelemtype: Oid,
    pub refrestype: Oid,
    pub reftypmod: int32,
    pub refcollid: Oid,
    pub refupperindexpr: *mut List,
    pub reflowerindexpr: *mut List,
    pub refexpr: *mut Expr,
    pub refassgnexpr: *mut Expr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SubscriptingRef"][::std::mem::size_of::<SubscriptingRef>() - 56usize];
    ["Alignment of SubscriptingRef"][::std::mem::align_of::<SubscriptingRef>() - 8usize];
    ["Offset of field: SubscriptingRef::xpr"]
        [::std::mem::offset_of!(SubscriptingRef, xpr) - 0usize];
    ["Offset of field: SubscriptingRef::refcontainertype"]
        [::std::mem::offset_of!(SubscriptingRef, refcontainertype) - 4usize];
    ["Offset of field: SubscriptingRef::refelemtype"]
        [::std::mem::offset_of!(SubscriptingRef, refelemtype) - 8usize];
    ["Offset of field: SubscriptingRef::refrestype"]
        [::std::mem::offset_of!(SubscriptingRef, refrestype) - 12usize];
    ["Offset of field: SubscriptingRef::reftypmod"]
        [::std::mem::offset_of!(SubscriptingRef, reftypmod) - 16usize];
    ["Offset of field: SubscriptingRef::refcollid"]
        [::std::mem::offset_of!(SubscriptingRef, refcollid) - 20usize];
    ["Offset of field: SubscriptingRef::refupperindexpr"]
        [::std::mem::offset_of!(SubscriptingRef, refupperindexpr) - 24usize];
    ["Offset of field: SubscriptingRef::reflowerindexpr"]
        [::std::mem::offset_of!(SubscriptingRef, reflowerindexpr) - 32usize];
    ["Offset of field: SubscriptingRef::refexpr"]
        [::std::mem::offset_of!(SubscriptingRef, refexpr) - 40usize];
    ["Offset of field: SubscriptingRef::refassgnexpr"]
        [::std::mem::offset_of!(SubscriptingRef, refassgnexpr) - 48usize];
};
pub const CoercionContext_COERCION_IMPLICIT: CoercionContext = 0;
pub const CoercionContext_COERCION_ASSIGNMENT: CoercionContext = 1;
pub const CoercionContext_COERCION_PLPGSQL: CoercionContext = 2;
pub const CoercionContext_COERCION_EXPLICIT: CoercionContext = 3;
pub type CoercionContext = ::std::os::raw::c_uint;
pub const CoercionForm_COERCE_EXPLICIT_CALL: CoercionForm = 0;
pub const CoercionForm_COERCE_EXPLICIT_CAST: CoercionForm = 1;
pub const CoercionForm_COERCE_IMPLICIT_CAST: CoercionForm = 2;
pub const CoercionForm_COERCE_SQL_SYNTAX: CoercionForm = 3;
pub type CoercionForm = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FuncExpr {
    pub xpr: Expr,
    pub funcid: Oid,
    pub funcresulttype: Oid,
    pub funcretset: bool,
    pub funcvariadic: bool,
    pub funcformat: CoercionForm,
    pub funccollid: Oid,
    pub inputcollid: Oid,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FuncExpr"][::std::mem::size_of::<FuncExpr>() - 48usize];
    ["Alignment of FuncExpr"][::std::mem::align_of::<FuncExpr>() - 8usize];
    ["Offset of field: FuncExpr::xpr"][::std::mem::offset_of!(FuncExpr, xpr) - 0usize];
    ["Offset of field: FuncExpr::funcid"][::std::mem::offset_of!(FuncExpr, funcid) - 4usize];
    ["Offset of field: FuncExpr::funcresulttype"]
        [::std::mem::offset_of!(FuncExpr, funcresulttype) - 8usize];
    ["Offset of field: FuncExpr::funcretset"]
        [::std::mem::offset_of!(FuncExpr, funcretset) - 12usize];
    ["Offset of field: FuncExpr::funcvariadic"]
        [::std::mem::offset_of!(FuncExpr, funcvariadic) - 13usize];
    ["Offset of field: FuncExpr::funcformat"]
        [::std::mem::offset_of!(FuncExpr, funcformat) - 16usize];
    ["Offset of field: FuncExpr::funccollid"]
        [::std::mem::offset_of!(FuncExpr, funccollid) - 20usize];
    ["Offset of field: FuncExpr::inputcollid"]
        [::std::mem::offset_of!(FuncExpr, inputcollid) - 24usize];
    ["Offset of field: FuncExpr::args"][::std::mem::offset_of!(FuncExpr, args) - 32usize];
    ["Offset of field: FuncExpr::location"][::std::mem::offset_of!(FuncExpr, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NamedArgExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub name: *mut ::std::os::raw::c_char,
    pub argnumber: ::std::os::raw::c_int,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NamedArgExpr"][::std::mem::size_of::<NamedArgExpr>() - 32usize];
    ["Alignment of NamedArgExpr"][::std::mem::align_of::<NamedArgExpr>() - 8usize];
    ["Offset of field: NamedArgExpr::xpr"][::std::mem::offset_of!(NamedArgExpr, xpr) - 0usize];
    ["Offset of field: NamedArgExpr::arg"][::std::mem::offset_of!(NamedArgExpr, arg) - 8usize];
    ["Offset of field: NamedArgExpr::name"][::std::mem::offset_of!(NamedArgExpr, name) - 16usize];
    ["Offset of field: NamedArgExpr::argnumber"]
        [::std::mem::offset_of!(NamedArgExpr, argnumber) - 24usize];
    ["Offset of field: NamedArgExpr::location"]
        [::std::mem::offset_of!(NamedArgExpr, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpExpr {
    pub xpr: Expr,
    pub opno: Oid,
    pub opfuncid: Oid,
    pub opresulttype: Oid,
    pub opretset: bool,
    pub opcollid: Oid,
    pub inputcollid: Oid,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpExpr"][::std::mem::size_of::<OpExpr>() - 48usize];
    ["Alignment of OpExpr"][::std::mem::align_of::<OpExpr>() - 8usize];
    ["Offset of field: OpExpr::xpr"][::std::mem::offset_of!(OpExpr, xpr) - 0usize];
    ["Offset of field: OpExpr::opno"][::std::mem::offset_of!(OpExpr, opno) - 4usize];
    ["Offset of field: OpExpr::opfuncid"][::std::mem::offset_of!(OpExpr, opfuncid) - 8usize];
    ["Offset of field: OpExpr::opresulttype"]
        [::std::mem::offset_of!(OpExpr, opresulttype) - 12usize];
    ["Offset of field: OpExpr::opretset"][::std::mem::offset_of!(OpExpr, opretset) - 16usize];
    ["Offset of field: OpExpr::opcollid"][::std::mem::offset_of!(OpExpr, opcollid) - 20usize];
    ["Offset of field: OpExpr::inputcollid"][::std::mem::offset_of!(OpExpr, inputcollid) - 24usize];
    ["Offset of field: OpExpr::args"][::std::mem::offset_of!(OpExpr, args) - 32usize];
    ["Offset of field: OpExpr::location"][::std::mem::offset_of!(OpExpr, location) - 40usize];
};
pub type DistinctExpr = OpExpr;
pub type NullIfExpr = OpExpr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScalarArrayOpExpr {
    pub xpr: Expr,
    pub opno: Oid,
    pub opfuncid: Oid,
    pub hashfuncid: Oid,
    pub negfuncid: Oid,
    pub useOr: bool,
    pub inputcollid: Oid,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScalarArrayOpExpr"][::std::mem::size_of::<ScalarArrayOpExpr>() - 48usize];
    ["Alignment of ScalarArrayOpExpr"][::std::mem::align_of::<ScalarArrayOpExpr>() - 8usize];
    ["Offset of field: ScalarArrayOpExpr::xpr"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, xpr) - 0usize];
    ["Offset of field: ScalarArrayOpExpr::opno"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, opno) - 4usize];
    ["Offset of field: ScalarArrayOpExpr::opfuncid"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, opfuncid) - 8usize];
    ["Offset of field: ScalarArrayOpExpr::hashfuncid"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, hashfuncid) - 12usize];
    ["Offset of field: ScalarArrayOpExpr::negfuncid"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, negfuncid) - 16usize];
    ["Offset of field: ScalarArrayOpExpr::useOr"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, useOr) - 20usize];
    ["Offset of field: ScalarArrayOpExpr::inputcollid"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, inputcollid) - 24usize];
    ["Offset of field: ScalarArrayOpExpr::args"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, args) - 32usize];
    ["Offset of field: ScalarArrayOpExpr::location"]
        [::std::mem::offset_of!(ScalarArrayOpExpr, location) - 40usize];
};
pub const BoolExprType_AND_EXPR: BoolExprType = 0;
pub const BoolExprType_OR_EXPR: BoolExprType = 1;
pub const BoolExprType_NOT_EXPR: BoolExprType = 2;
pub type BoolExprType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BoolExpr {
    pub xpr: Expr,
    pub boolop: BoolExprType,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoolExpr"][::std::mem::size_of::<BoolExpr>() - 24usize];
    ["Alignment of BoolExpr"][::std::mem::align_of::<BoolExpr>() - 8usize];
    ["Offset of field: BoolExpr::xpr"][::std::mem::offset_of!(BoolExpr, xpr) - 0usize];
    ["Offset of field: BoolExpr::boolop"][::std::mem::offset_of!(BoolExpr, boolop) - 4usize];
    ["Offset of field: BoolExpr::args"][::std::mem::offset_of!(BoolExpr, args) - 8usize];
    ["Offset of field: BoolExpr::location"][::std::mem::offset_of!(BoolExpr, location) - 16usize];
};
pub const SubLinkType_EXISTS_SUBLINK: SubLinkType = 0;
pub const SubLinkType_ALL_SUBLINK: SubLinkType = 1;
pub const SubLinkType_ANY_SUBLINK: SubLinkType = 2;
pub const SubLinkType_ROWCOMPARE_SUBLINK: SubLinkType = 3;
pub const SubLinkType_EXPR_SUBLINK: SubLinkType = 4;
pub const SubLinkType_MULTIEXPR_SUBLINK: SubLinkType = 5;
pub const SubLinkType_ARRAY_SUBLINK: SubLinkType = 6;
pub const SubLinkType_CTE_SUBLINK: SubLinkType = 7;
pub type SubLinkType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SubLink {
    pub xpr: Expr,
    pub subLinkType: SubLinkType,
    pub subLinkId: ::std::os::raw::c_int,
    pub testexpr: *mut Node,
    pub operName: *mut List,
    pub subselect: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SubLink"][::std::mem::size_of::<SubLink>() - 48usize];
    ["Alignment of SubLink"][::std::mem::align_of::<SubLink>() - 8usize];
    ["Offset of field: SubLink::xpr"][::std::mem::offset_of!(SubLink, xpr) - 0usize];
    ["Offset of field: SubLink::subLinkType"]
        [::std::mem::offset_of!(SubLink, subLinkType) - 4usize];
    ["Offset of field: SubLink::subLinkId"][::std::mem::offset_of!(SubLink, subLinkId) - 8usize];
    ["Offset of field: SubLink::testexpr"][::std::mem::offset_of!(SubLink, testexpr) - 16usize];
    ["Offset of field: SubLink::operName"][::std::mem::offset_of!(SubLink, operName) - 24usize];
    ["Offset of field: SubLink::subselect"][::std::mem::offset_of!(SubLink, subselect) - 32usize];
    ["Offset of field: SubLink::location"][::std::mem::offset_of!(SubLink, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SubPlan {
    pub xpr: Expr,
    pub subLinkType: SubLinkType,
    pub testexpr: *mut Node,
    pub paramIds: *mut List,
    pub plan_id: ::std::os::raw::c_int,
    pub plan_name: *mut ::std::os::raw::c_char,
    pub firstColType: Oid,
    pub firstColTypmod: int32,
    pub firstColCollation: Oid,
    pub useHashTable: bool,
    pub unknownEqFalse: bool,
    pub parallel_safe: bool,
    pub setParam: *mut List,
    pub parParam: *mut List,
    pub args: *mut List,
    pub startup_cost: Cost,
    pub per_call_cost: Cost,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SubPlan"][::std::mem::size_of::<SubPlan>() - 96usize];
    ["Alignment of SubPlan"][::std::mem::align_of::<SubPlan>() - 8usize];
    ["Offset of field: SubPlan::xpr"][::std::mem::offset_of!(SubPlan, xpr) - 0usize];
    ["Offset of field: SubPlan::subLinkType"]
        [::std::mem::offset_of!(SubPlan, subLinkType) - 4usize];
    ["Offset of field: SubPlan::testexpr"][::std::mem::offset_of!(SubPlan, testexpr) - 8usize];
    ["Offset of field: SubPlan::paramIds"][::std::mem::offset_of!(SubPlan, paramIds) - 16usize];
    ["Offset of field: SubPlan::plan_id"][::std::mem::offset_of!(SubPlan, plan_id) - 24usize];
    ["Offset of field: SubPlan::plan_name"][::std::mem::offset_of!(SubPlan, plan_name) - 32usize];
    ["Offset of field: SubPlan::firstColType"]
        [::std::mem::offset_of!(SubPlan, firstColType) - 40usize];
    ["Offset of field: SubPlan::firstColTypmod"]
        [::std::mem::offset_of!(SubPlan, firstColTypmod) - 44usize];
    ["Offset of field: SubPlan::firstColCollation"]
        [::std::mem::offset_of!(SubPlan, firstColCollation) - 48usize];
    ["Offset of field: SubPlan::useHashTable"]
        [::std::mem::offset_of!(SubPlan, useHashTable) - 52usize];
    ["Offset of field: SubPlan::unknownEqFalse"]
        [::std::mem::offset_of!(SubPlan, unknownEqFalse) - 53usize];
    ["Offset of field: SubPlan::parallel_safe"]
        [::std::mem::offset_of!(SubPlan, parallel_safe) - 54usize];
    ["Offset of field: SubPlan::setParam"][::std::mem::offset_of!(SubPlan, setParam) - 56usize];
    ["Offset of field: SubPlan::parParam"][::std::mem::offset_of!(SubPlan, parParam) - 64usize];
    ["Offset of field: SubPlan::args"][::std::mem::offset_of!(SubPlan, args) - 72usize];
    ["Offset of field: SubPlan::startup_cost"]
        [::std::mem::offset_of!(SubPlan, startup_cost) - 80usize];
    ["Offset of field: SubPlan::per_call_cost"]
        [::std::mem::offset_of!(SubPlan, per_call_cost) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlternativeSubPlan {
    pub xpr: Expr,
    pub subplans: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlternativeSubPlan"][::std::mem::size_of::<AlternativeSubPlan>() - 16usize];
    ["Alignment of AlternativeSubPlan"][::std::mem::align_of::<AlternativeSubPlan>() - 8usize];
    ["Offset of field: AlternativeSubPlan::xpr"]
        [::std::mem::offset_of!(AlternativeSubPlan, xpr) - 0usize];
    ["Offset of field: AlternativeSubPlan::subplans"]
        [::std::mem::offset_of!(AlternativeSubPlan, subplans) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FieldSelect {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub fieldnum: AttrNumber,
    pub resulttype: Oid,
    pub resulttypmod: int32,
    pub resultcollid: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldSelect"][::std::mem::size_of::<FieldSelect>() - 32usize];
    ["Alignment of FieldSelect"][::std::mem::align_of::<FieldSelect>() - 8usize];
    ["Offset of field: FieldSelect::xpr"][::std::mem::offset_of!(FieldSelect, xpr) - 0usize];
    ["Offset of field: FieldSelect::arg"][::std::mem::offset_of!(FieldSelect, arg) - 8usize];
    ["Offset of field: FieldSelect::fieldnum"]
        [::std::mem::offset_of!(FieldSelect, fieldnum) - 16usize];
    ["Offset of field: FieldSelect::resulttype"]
        [::std::mem::offset_of!(FieldSelect, resulttype) - 20usize];
    ["Offset of field: FieldSelect::resulttypmod"]
        [::std::mem::offset_of!(FieldSelect, resulttypmod) - 24usize];
    ["Offset of field: FieldSelect::resultcollid"]
        [::std::mem::offset_of!(FieldSelect, resultcollid) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FieldStore {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub newvals: *mut List,
    pub fieldnums: *mut List,
    pub resulttype: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldStore"][::std::mem::size_of::<FieldStore>() - 40usize];
    ["Alignment of FieldStore"][::std::mem::align_of::<FieldStore>() - 8usize];
    ["Offset of field: FieldStore::xpr"][::std::mem::offset_of!(FieldStore, xpr) - 0usize];
    ["Offset of field: FieldStore::arg"][::std::mem::offset_of!(FieldStore, arg) - 8usize];
    ["Offset of field: FieldStore::newvals"][::std::mem::offset_of!(FieldStore, newvals) - 16usize];
    ["Offset of field: FieldStore::fieldnums"]
        [::std::mem::offset_of!(FieldStore, fieldnums) - 24usize];
    ["Offset of field: FieldStore::resulttype"]
        [::std::mem::offset_of!(FieldStore, resulttype) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RelabelType {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub resulttype: Oid,
    pub resulttypmod: int32,
    pub resultcollid: Oid,
    pub relabelformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RelabelType"][::std::mem::size_of::<RelabelType>() - 40usize];
    ["Alignment of RelabelType"][::std::mem::align_of::<RelabelType>() - 8usize];
    ["Offset of field: RelabelType::xpr"][::std::mem::offset_of!(RelabelType, xpr) - 0usize];
    ["Offset of field: RelabelType::arg"][::std::mem::offset_of!(RelabelType, arg) - 8usize];
    ["Offset of field: RelabelType::resulttype"]
        [::std::mem::offset_of!(RelabelType, resulttype) - 16usize];
    ["Offset of field: RelabelType::resulttypmod"]
        [::std::mem::offset_of!(RelabelType, resulttypmod) - 20usize];
    ["Offset of field: RelabelType::resultcollid"]
        [::std::mem::offset_of!(RelabelType, resultcollid) - 24usize];
    ["Offset of field: RelabelType::relabelformat"]
        [::std::mem::offset_of!(RelabelType, relabelformat) - 28usize];
    ["Offset of field: RelabelType::location"]
        [::std::mem::offset_of!(RelabelType, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoerceViaIO {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub resulttype: Oid,
    pub resultcollid: Oid,
    pub coerceformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoerceViaIO"][::std::mem::size_of::<CoerceViaIO>() - 32usize];
    ["Alignment of CoerceViaIO"][::std::mem::align_of::<CoerceViaIO>() - 8usize];
    ["Offset of field: CoerceViaIO::xpr"][::std::mem::offset_of!(CoerceViaIO, xpr) - 0usize];
    ["Offset of field: CoerceViaIO::arg"][::std::mem::offset_of!(CoerceViaIO, arg) - 8usize];
    ["Offset of field: CoerceViaIO::resulttype"]
        [::std::mem::offset_of!(CoerceViaIO, resulttype) - 16usize];
    ["Offset of field: CoerceViaIO::resultcollid"]
        [::std::mem::offset_of!(CoerceViaIO, resultcollid) - 20usize];
    ["Offset of field: CoerceViaIO::coerceformat"]
        [::std::mem::offset_of!(CoerceViaIO, coerceformat) - 24usize];
    ["Offset of field: CoerceViaIO::location"]
        [::std::mem::offset_of!(CoerceViaIO, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayCoerceExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub elemexpr: *mut Expr,
    pub resulttype: Oid,
    pub resulttypmod: int32,
    pub resultcollid: Oid,
    pub coerceformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayCoerceExpr"][::std::mem::size_of::<ArrayCoerceExpr>() - 48usize];
    ["Alignment of ArrayCoerceExpr"][::std::mem::align_of::<ArrayCoerceExpr>() - 8usize];
    ["Offset of field: ArrayCoerceExpr::xpr"]
        [::std::mem::offset_of!(ArrayCoerceExpr, xpr) - 0usize];
    ["Offset of field: ArrayCoerceExpr::arg"]
        [::std::mem::offset_of!(ArrayCoerceExpr, arg) - 8usize];
    ["Offset of field: ArrayCoerceExpr::elemexpr"]
        [::std::mem::offset_of!(ArrayCoerceExpr, elemexpr) - 16usize];
    ["Offset of field: ArrayCoerceExpr::resulttype"]
        [::std::mem::offset_of!(ArrayCoerceExpr, resulttype) - 24usize];
    ["Offset of field: ArrayCoerceExpr::resulttypmod"]
        [::std::mem::offset_of!(ArrayCoerceExpr, resulttypmod) - 28usize];
    ["Offset of field: ArrayCoerceExpr::resultcollid"]
        [::std::mem::offset_of!(ArrayCoerceExpr, resultcollid) - 32usize];
    ["Offset of field: ArrayCoerceExpr::coerceformat"]
        [::std::mem::offset_of!(ArrayCoerceExpr, coerceformat) - 36usize];
    ["Offset of field: ArrayCoerceExpr::location"]
        [::std::mem::offset_of!(ArrayCoerceExpr, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConvertRowtypeExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub resulttype: Oid,
    pub convertformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ConvertRowtypeExpr"][::std::mem::size_of::<ConvertRowtypeExpr>() - 32usize];
    ["Alignment of ConvertRowtypeExpr"][::std::mem::align_of::<ConvertRowtypeExpr>() - 8usize];
    ["Offset of field: ConvertRowtypeExpr::xpr"]
        [::std::mem::offset_of!(ConvertRowtypeExpr, xpr) - 0usize];
    ["Offset of field: ConvertRowtypeExpr::arg"]
        [::std::mem::offset_of!(ConvertRowtypeExpr, arg) - 8usize];
    ["Offset of field: ConvertRowtypeExpr::resulttype"]
        [::std::mem::offset_of!(ConvertRowtypeExpr, resulttype) - 16usize];
    ["Offset of field: ConvertRowtypeExpr::convertformat"]
        [::std::mem::offset_of!(ConvertRowtypeExpr, convertformat) - 20usize];
    ["Offset of field: ConvertRowtypeExpr::location"]
        [::std::mem::offset_of!(ConvertRowtypeExpr, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollateExpr {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub collOid: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CollateExpr"][::std::mem::size_of::<CollateExpr>() - 24usize];
    ["Alignment of CollateExpr"][::std::mem::align_of::<CollateExpr>() - 8usize];
    ["Offset of field: CollateExpr::xpr"][::std::mem::offset_of!(CollateExpr, xpr) - 0usize];
    ["Offset of field: CollateExpr::arg"][::std::mem::offset_of!(CollateExpr, arg) - 8usize];
    ["Offset of field: CollateExpr::collOid"]
        [::std::mem::offset_of!(CollateExpr, collOid) - 16usize];
    ["Offset of field: CollateExpr::location"]
        [::std::mem::offset_of!(CollateExpr, location) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CaseExpr {
    pub xpr: Expr,
    pub casetype: Oid,
    pub casecollid: Oid,
    pub arg: *mut Expr,
    pub args: *mut List,
    pub defresult: *mut Expr,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CaseExpr"][::std::mem::size_of::<CaseExpr>() - 48usize];
    ["Alignment of CaseExpr"][::std::mem::align_of::<CaseExpr>() - 8usize];
    ["Offset of field: CaseExpr::xpr"][::std::mem::offset_of!(CaseExpr, xpr) - 0usize];
    ["Offset of field: CaseExpr::casetype"][::std::mem::offset_of!(CaseExpr, casetype) - 4usize];
    ["Offset of field: CaseExpr::casecollid"]
        [::std::mem::offset_of!(CaseExpr, casecollid) - 8usize];
    ["Offset of field: CaseExpr::arg"][::std::mem::offset_of!(CaseExpr, arg) - 16usize];
    ["Offset of field: CaseExpr::args"][::std::mem::offset_of!(CaseExpr, args) - 24usize];
    ["Offset of field: CaseExpr::defresult"][::std::mem::offset_of!(CaseExpr, defresult) - 32usize];
    ["Offset of field: CaseExpr::location"][::std::mem::offset_of!(CaseExpr, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CaseWhen {
    pub xpr: Expr,
    pub expr: *mut Expr,
    pub result: *mut Expr,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CaseWhen"][::std::mem::size_of::<CaseWhen>() - 32usize];
    ["Alignment of CaseWhen"][::std::mem::align_of::<CaseWhen>() - 8usize];
    ["Offset of field: CaseWhen::xpr"][::std::mem::offset_of!(CaseWhen, xpr) - 0usize];
    ["Offset of field: CaseWhen::expr"][::std::mem::offset_of!(CaseWhen, expr) - 8usize];
    ["Offset of field: CaseWhen::result"][::std::mem::offset_of!(CaseWhen, result) - 16usize];
    ["Offset of field: CaseWhen::location"][::std::mem::offset_of!(CaseWhen, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CaseTestExpr {
    pub xpr: Expr,
    pub typeId: Oid,
    pub typeMod: int32,
    pub collation: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CaseTestExpr"][::std::mem::size_of::<CaseTestExpr>() - 16usize];
    ["Alignment of CaseTestExpr"][::std::mem::align_of::<CaseTestExpr>() - 4usize];
    ["Offset of field: CaseTestExpr::xpr"][::std::mem::offset_of!(CaseTestExpr, xpr) - 0usize];
    ["Offset of field: CaseTestExpr::typeId"]
        [::std::mem::offset_of!(CaseTestExpr, typeId) - 4usize];
    ["Offset of field: CaseTestExpr::typeMod"]
        [::std::mem::offset_of!(CaseTestExpr, typeMod) - 8usize];
    ["Offset of field: CaseTestExpr::collation"]
        [::std::mem::offset_of!(CaseTestExpr, collation) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayExpr {
    pub xpr: Expr,
    pub array_typeid: Oid,
    pub array_collid: Oid,
    pub element_typeid: Oid,
    pub elements: *mut List,
    pub multidims: bool,
    pub list_start: ParseLoc,
    pub list_end: ParseLoc,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayExpr"][::std::mem::size_of::<ArrayExpr>() - 40usize];
    ["Alignment of ArrayExpr"][::std::mem::align_of::<ArrayExpr>() - 8usize];
    ["Offset of field: ArrayExpr::xpr"][::std::mem::offset_of!(ArrayExpr, xpr) - 0usize];
    ["Offset of field: ArrayExpr::array_typeid"]
        [::std::mem::offset_of!(ArrayExpr, array_typeid) - 4usize];
    ["Offset of field: ArrayExpr::array_collid"]
        [::std::mem::offset_of!(ArrayExpr, array_collid) - 8usize];
    ["Offset of field: ArrayExpr::element_typeid"]
        [::std::mem::offset_of!(ArrayExpr, element_typeid) - 12usize];
    ["Offset of field: ArrayExpr::elements"][::std::mem::offset_of!(ArrayExpr, elements) - 16usize];
    ["Offset of field: ArrayExpr::multidims"]
        [::std::mem::offset_of!(ArrayExpr, multidims) - 24usize];
    ["Offset of field: ArrayExpr::list_start"]
        [::std::mem::offset_of!(ArrayExpr, list_start) - 28usize];
    ["Offset of field: ArrayExpr::list_end"][::std::mem::offset_of!(ArrayExpr, list_end) - 32usize];
    ["Offset of field: ArrayExpr::location"][::std::mem::offset_of!(ArrayExpr, location) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RowExpr {
    pub xpr: Expr,
    pub args: *mut List,
    pub row_typeid: Oid,
    pub row_format: CoercionForm,
    pub colnames: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RowExpr"][::std::mem::size_of::<RowExpr>() - 40usize];
    ["Alignment of RowExpr"][::std::mem::align_of::<RowExpr>() - 8usize];
    ["Offset of field: RowExpr::xpr"][::std::mem::offset_of!(RowExpr, xpr) - 0usize];
    ["Offset of field: RowExpr::args"][::std::mem::offset_of!(RowExpr, args) - 8usize];
    ["Offset of field: RowExpr::row_typeid"][::std::mem::offset_of!(RowExpr, row_typeid) - 16usize];
    ["Offset of field: RowExpr::row_format"][::std::mem::offset_of!(RowExpr, row_format) - 20usize];
    ["Offset of field: RowExpr::colnames"][::std::mem::offset_of!(RowExpr, colnames) - 24usize];
    ["Offset of field: RowExpr::location"][::std::mem::offset_of!(RowExpr, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RowCompareExpr {
    pub xpr: Expr,
    pub cmptype: CompareType,
    pub opnos: *mut List,
    pub opfamilies: *mut List,
    pub inputcollids: *mut List,
    pub largs: *mut List,
    pub rargs: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RowCompareExpr"][::std::mem::size_of::<RowCompareExpr>() - 48usize];
    ["Alignment of RowCompareExpr"][::std::mem::align_of::<RowCompareExpr>() - 8usize];
    ["Offset of field: RowCompareExpr::xpr"][::std::mem::offset_of!(RowCompareExpr, xpr) - 0usize];
    ["Offset of field: RowCompareExpr::cmptype"]
        [::std::mem::offset_of!(RowCompareExpr, cmptype) - 4usize];
    ["Offset of field: RowCompareExpr::opnos"]
        [::std::mem::offset_of!(RowCompareExpr, opnos) - 8usize];
    ["Offset of field: RowCompareExpr::opfamilies"]
        [::std::mem::offset_of!(RowCompareExpr, opfamilies) - 16usize];
    ["Offset of field: RowCompareExpr::inputcollids"]
        [::std::mem::offset_of!(RowCompareExpr, inputcollids) - 24usize];
    ["Offset of field: RowCompareExpr::largs"]
        [::std::mem::offset_of!(RowCompareExpr, largs) - 32usize];
    ["Offset of field: RowCompareExpr::rargs"]
        [::std::mem::offset_of!(RowCompareExpr, rargs) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoalesceExpr {
    pub xpr: Expr,
    pub coalescetype: Oid,
    pub coalescecollid: Oid,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoalesceExpr"][::std::mem::size_of::<CoalesceExpr>() - 32usize];
    ["Alignment of CoalesceExpr"][::std::mem::align_of::<CoalesceExpr>() - 8usize];
    ["Offset of field: CoalesceExpr::xpr"][::std::mem::offset_of!(CoalesceExpr, xpr) - 0usize];
    ["Offset of field: CoalesceExpr::coalescetype"]
        [::std::mem::offset_of!(CoalesceExpr, coalescetype) - 4usize];
    ["Offset of field: CoalesceExpr::coalescecollid"]
        [::std::mem::offset_of!(CoalesceExpr, coalescecollid) - 8usize];
    ["Offset of field: CoalesceExpr::args"][::std::mem::offset_of!(CoalesceExpr, args) - 16usize];
    ["Offset of field: CoalesceExpr::location"]
        [::std::mem::offset_of!(CoalesceExpr, location) - 24usize];
};
pub const MinMaxOp_IS_GREATEST: MinMaxOp = 0;
pub const MinMaxOp_IS_LEAST: MinMaxOp = 1;
pub type MinMaxOp = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MinMaxExpr {
    pub xpr: Expr,
    pub minmaxtype: Oid,
    pub minmaxcollid: Oid,
    pub inputcollid: Oid,
    pub op: MinMaxOp,
    pub args: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MinMaxExpr"][::std::mem::size_of::<MinMaxExpr>() - 40usize];
    ["Alignment of MinMaxExpr"][::std::mem::align_of::<MinMaxExpr>() - 8usize];
    ["Offset of field: MinMaxExpr::xpr"][::std::mem::offset_of!(MinMaxExpr, xpr) - 0usize];
    ["Offset of field: MinMaxExpr::minmaxtype"]
        [::std::mem::offset_of!(MinMaxExpr, minmaxtype) - 4usize];
    ["Offset of field: MinMaxExpr::minmaxcollid"]
        [::std::mem::offset_of!(MinMaxExpr, minmaxcollid) - 8usize];
    ["Offset of field: MinMaxExpr::inputcollid"]
        [::std::mem::offset_of!(MinMaxExpr, inputcollid) - 12usize];
    ["Offset of field: MinMaxExpr::op"][::std::mem::offset_of!(MinMaxExpr, op) - 16usize];
    ["Offset of field: MinMaxExpr::args"][::std::mem::offset_of!(MinMaxExpr, args) - 24usize];
    ["Offset of field: MinMaxExpr::location"]
        [::std::mem::offset_of!(MinMaxExpr, location) - 32usize];
};
pub const SQLValueFunctionOp_SVFOP_CURRENT_DATE: SQLValueFunctionOp = 0;
pub const SQLValueFunctionOp_SVFOP_CURRENT_TIME: SQLValueFunctionOp = 1;
pub const SQLValueFunctionOp_SVFOP_CURRENT_TIME_N: SQLValueFunctionOp = 2;
pub const SQLValueFunctionOp_SVFOP_CURRENT_TIMESTAMP: SQLValueFunctionOp = 3;
pub const SQLValueFunctionOp_SVFOP_CURRENT_TIMESTAMP_N: SQLValueFunctionOp = 4;
pub const SQLValueFunctionOp_SVFOP_LOCALTIME: SQLValueFunctionOp = 5;
pub const SQLValueFunctionOp_SVFOP_LOCALTIME_N: SQLValueFunctionOp = 6;
pub const SQLValueFunctionOp_SVFOP_LOCALTIMESTAMP: SQLValueFunctionOp = 7;
pub const SQLValueFunctionOp_SVFOP_LOCALTIMESTAMP_N: SQLValueFunctionOp = 8;
pub const SQLValueFunctionOp_SVFOP_CURRENT_ROLE: SQLValueFunctionOp = 9;
pub const SQLValueFunctionOp_SVFOP_CURRENT_USER: SQLValueFunctionOp = 10;
pub const SQLValueFunctionOp_SVFOP_USER: SQLValueFunctionOp = 11;
pub const SQLValueFunctionOp_SVFOP_SESSION_USER: SQLValueFunctionOp = 12;
pub const SQLValueFunctionOp_SVFOP_CURRENT_CATALOG: SQLValueFunctionOp = 13;
pub const SQLValueFunctionOp_SVFOP_CURRENT_SCHEMA: SQLValueFunctionOp = 14;
pub type SQLValueFunctionOp = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SQLValueFunction {
    pub xpr: Expr,
    pub op: SQLValueFunctionOp,
    pub type_: Oid,
    pub typmod: int32,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SQLValueFunction"][::std::mem::size_of::<SQLValueFunction>() - 20usize];
    ["Alignment of SQLValueFunction"][::std::mem::align_of::<SQLValueFunction>() - 4usize];
    ["Offset of field: SQLValueFunction::xpr"]
        [::std::mem::offset_of!(SQLValueFunction, xpr) - 0usize];
    ["Offset of field: SQLValueFunction::op"]
        [::std::mem::offset_of!(SQLValueFunction, op) - 4usize];
    ["Offset of field: SQLValueFunction::type_"]
        [::std::mem::offset_of!(SQLValueFunction, type_) - 8usize];
    ["Offset of field: SQLValueFunction::typmod"]
        [::std::mem::offset_of!(SQLValueFunction, typmod) - 12usize];
    ["Offset of field: SQLValueFunction::location"]
        [::std::mem::offset_of!(SQLValueFunction, location) - 16usize];
};
pub const XmlExprOp_IS_XMLCONCAT: XmlExprOp = 0;
pub const XmlExprOp_IS_XMLELEMENT: XmlExprOp = 1;
pub const XmlExprOp_IS_XMLFOREST: XmlExprOp = 2;
pub const XmlExprOp_IS_XMLPARSE: XmlExprOp = 3;
pub const XmlExprOp_IS_XMLPI: XmlExprOp = 4;
pub const XmlExprOp_IS_XMLROOT: XmlExprOp = 5;
pub const XmlExprOp_IS_XMLSERIALIZE: XmlExprOp = 6;
pub const XmlExprOp_IS_DOCUMENT: XmlExprOp = 7;
pub type XmlExprOp = ::std::os::raw::c_uint;
pub const XmlOptionType_XMLOPTION_DOCUMENT: XmlOptionType = 0;
pub const XmlOptionType_XMLOPTION_CONTENT: XmlOptionType = 1;
pub type XmlOptionType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XmlExpr {
    pub xpr: Expr,
    pub op: XmlExprOp,
    pub name: *mut ::std::os::raw::c_char,
    pub named_args: *mut List,
    pub arg_names: *mut List,
    pub args: *mut List,
    pub xmloption: XmlOptionType,
    pub indent: bool,
    pub type_: Oid,
    pub typmod: int32,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XmlExpr"][::std::mem::size_of::<XmlExpr>() - 64usize];
    ["Alignment of XmlExpr"][::std::mem::align_of::<XmlExpr>() - 8usize];
    ["Offset of field: XmlExpr::xpr"][::std::mem::offset_of!(XmlExpr, xpr) - 0usize];
    ["Offset of field: XmlExpr::op"][::std::mem::offset_of!(XmlExpr, op) - 4usize];
    ["Offset of field: XmlExpr::name"][::std::mem::offset_of!(XmlExpr, name) - 8usize];
    ["Offset of field: XmlExpr::named_args"][::std::mem::offset_of!(XmlExpr, named_args) - 16usize];
    ["Offset of field: XmlExpr::arg_names"][::std::mem::offset_of!(XmlExpr, arg_names) - 24usize];
    ["Offset of field: XmlExpr::args"][::std::mem::offset_of!(XmlExpr, args) - 32usize];
    ["Offset of field: XmlExpr::xmloption"][::std::mem::offset_of!(XmlExpr, xmloption) - 40usize];
    ["Offset of field: XmlExpr::indent"][::std::mem::offset_of!(XmlExpr, indent) - 44usize];
    ["Offset of field: XmlExpr::type_"][::std::mem::offset_of!(XmlExpr, type_) - 48usize];
    ["Offset of field: XmlExpr::typmod"][::std::mem::offset_of!(XmlExpr, typmod) - 52usize];
    ["Offset of field: XmlExpr::location"][::std::mem::offset_of!(XmlExpr, location) - 56usize];
};
pub const JsonEncoding_JS_ENC_DEFAULT: JsonEncoding = 0;
pub const JsonEncoding_JS_ENC_UTF8: JsonEncoding = 1;
pub const JsonEncoding_JS_ENC_UTF16: JsonEncoding = 2;
pub const JsonEncoding_JS_ENC_UTF32: JsonEncoding = 3;
pub type JsonEncoding = ::std::os::raw::c_uint;
pub const JsonFormatType_JS_FORMAT_DEFAULT: JsonFormatType = 0;
pub const JsonFormatType_JS_FORMAT_JSON: JsonFormatType = 1;
pub const JsonFormatType_JS_FORMAT_JSONB: JsonFormatType = 2;
pub type JsonFormatType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonFormat {
    pub type_: NodeTag,
    pub format_type: JsonFormatType,
    pub encoding: JsonEncoding,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonFormat"][::std::mem::size_of::<JsonFormat>() - 16usize];
    ["Alignment of JsonFormat"][::std::mem::align_of::<JsonFormat>() - 4usize];
    ["Offset of field: JsonFormat::type_"][::std::mem::offset_of!(JsonFormat, type_) - 0usize];
    ["Offset of field: JsonFormat::format_type"]
        [::std::mem::offset_of!(JsonFormat, format_type) - 4usize];
    ["Offset of field: JsonFormat::encoding"]
        [::std::mem::offset_of!(JsonFormat, encoding) - 8usize];
    ["Offset of field: JsonFormat::location"]
        [::std::mem::offset_of!(JsonFormat, location) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonReturning {
    pub type_: NodeTag,
    pub format: *mut JsonFormat,
    pub typid: Oid,
    pub typmod: int32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonReturning"][::std::mem::size_of::<JsonReturning>() - 24usize];
    ["Alignment of JsonReturning"][::std::mem::align_of::<JsonReturning>() - 8usize];
    ["Offset of field: JsonReturning::type_"]
        [::std::mem::offset_of!(JsonReturning, type_) - 0usize];
    ["Offset of field: JsonReturning::format"]
        [::std::mem::offset_of!(JsonReturning, format) - 8usize];
    ["Offset of field: JsonReturning::typid"]
        [::std::mem::offset_of!(JsonReturning, typid) - 16usize];
    ["Offset of field: JsonReturning::typmod"]
        [::std::mem::offset_of!(JsonReturning, typmod) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonValueExpr {
    pub type_: NodeTag,
    pub raw_expr: *mut Expr,
    pub formatted_expr: *mut Expr,
    pub format: *mut JsonFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonValueExpr"][::std::mem::size_of::<JsonValueExpr>() - 32usize];
    ["Alignment of JsonValueExpr"][::std::mem::align_of::<JsonValueExpr>() - 8usize];
    ["Offset of field: JsonValueExpr::type_"]
        [::std::mem::offset_of!(JsonValueExpr, type_) - 0usize];
    ["Offset of field: JsonValueExpr::raw_expr"]
        [::std::mem::offset_of!(JsonValueExpr, raw_expr) - 8usize];
    ["Offset of field: JsonValueExpr::formatted_expr"]
        [::std::mem::offset_of!(JsonValueExpr, formatted_expr) - 16usize];
    ["Offset of field: JsonValueExpr::format"]
        [::std::mem::offset_of!(JsonValueExpr, format) - 24usize];
};
pub const JsonConstructorType_JSCTOR_JSON_OBJECT: JsonConstructorType = 1;
pub const JsonConstructorType_JSCTOR_JSON_ARRAY: JsonConstructorType = 2;
pub const JsonConstructorType_JSCTOR_JSON_OBJECTAGG: JsonConstructorType = 3;
pub const JsonConstructorType_JSCTOR_JSON_ARRAYAGG: JsonConstructorType = 4;
pub const JsonConstructorType_JSCTOR_JSON_PARSE: JsonConstructorType = 5;
pub const JsonConstructorType_JSCTOR_JSON_SCALAR: JsonConstructorType = 6;
pub const JsonConstructorType_JSCTOR_JSON_SERIALIZE: JsonConstructorType = 7;
pub type JsonConstructorType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonConstructorExpr {
    pub xpr: Expr,
    pub type_: JsonConstructorType,
    pub args: *mut List,
    pub func: *mut Expr,
    pub coercion: *mut Expr,
    pub returning: *mut JsonReturning,
    pub absent_on_null: bool,
    pub unique: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonConstructorExpr"][::std::mem::size_of::<JsonConstructorExpr>() - 48usize];
    ["Alignment of JsonConstructorExpr"][::std::mem::align_of::<JsonConstructorExpr>() - 8usize];
    ["Offset of field: JsonConstructorExpr::xpr"]
        [::std::mem::offset_of!(JsonConstructorExpr, xpr) - 0usize];
    ["Offset of field: JsonConstructorExpr::type_"]
        [::std::mem::offset_of!(JsonConstructorExpr, type_) - 4usize];
    ["Offset of field: JsonConstructorExpr::args"]
        [::std::mem::offset_of!(JsonConstructorExpr, args) - 8usize];
    ["Offset of field: JsonConstructorExpr::func"]
        [::std::mem::offset_of!(JsonConstructorExpr, func) - 16usize];
    ["Offset of field: JsonConstructorExpr::coercion"]
        [::std::mem::offset_of!(JsonConstructorExpr, coercion) - 24usize];
    ["Offset of field: JsonConstructorExpr::returning"]
        [::std::mem::offset_of!(JsonConstructorExpr, returning) - 32usize];
    ["Offset of field: JsonConstructorExpr::absent_on_null"]
        [::std::mem::offset_of!(JsonConstructorExpr, absent_on_null) - 40usize];
    ["Offset of field: JsonConstructorExpr::unique"]
        [::std::mem::offset_of!(JsonConstructorExpr, unique) - 41usize];
    ["Offset of field: JsonConstructorExpr::location"]
        [::std::mem::offset_of!(JsonConstructorExpr, location) - 44usize];
};
pub const JsonValueType_JS_TYPE_ANY: JsonValueType = 0;
pub const JsonValueType_JS_TYPE_OBJECT: JsonValueType = 1;
pub const JsonValueType_JS_TYPE_ARRAY: JsonValueType = 2;
pub const JsonValueType_JS_TYPE_SCALAR: JsonValueType = 3;
pub type JsonValueType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonIsPredicate {
    pub type_: NodeTag,
    pub expr: *mut Node,
    pub format: *mut JsonFormat,
    pub item_type: JsonValueType,
    pub unique_keys: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonIsPredicate"][::std::mem::size_of::<JsonIsPredicate>() - 40usize];
    ["Alignment of JsonIsPredicate"][::std::mem::align_of::<JsonIsPredicate>() - 8usize];
    ["Offset of field: JsonIsPredicate::type_"]
        [::std::mem::offset_of!(JsonIsPredicate, type_) - 0usize];
    ["Offset of field: JsonIsPredicate::expr"]
        [::std::mem::offset_of!(JsonIsPredicate, expr) - 8usize];
    ["Offset of field: JsonIsPredicate::format"]
        [::std::mem::offset_of!(JsonIsPredicate, format) - 16usize];
    ["Offset of field: JsonIsPredicate::item_type"]
        [::std::mem::offset_of!(JsonIsPredicate, item_type) - 24usize];
    ["Offset of field: JsonIsPredicate::unique_keys"]
        [::std::mem::offset_of!(JsonIsPredicate, unique_keys) - 28usize];
    ["Offset of field: JsonIsPredicate::location"]
        [::std::mem::offset_of!(JsonIsPredicate, location) - 32usize];
};
pub const JsonWrapper_JSW_UNSPEC: JsonWrapper = 0;
pub const JsonWrapper_JSW_NONE: JsonWrapper = 1;
pub const JsonWrapper_JSW_CONDITIONAL: JsonWrapper = 2;
pub const JsonWrapper_JSW_UNCONDITIONAL: JsonWrapper = 3;
pub type JsonWrapper = ::std::os::raw::c_uint;
pub const JsonBehaviorType_JSON_BEHAVIOR_NULL: JsonBehaviorType = 0;
pub const JsonBehaviorType_JSON_BEHAVIOR_ERROR: JsonBehaviorType = 1;
pub const JsonBehaviorType_JSON_BEHAVIOR_EMPTY: JsonBehaviorType = 2;
pub const JsonBehaviorType_JSON_BEHAVIOR_TRUE: JsonBehaviorType = 3;
pub const JsonBehaviorType_JSON_BEHAVIOR_FALSE: JsonBehaviorType = 4;
pub const JsonBehaviorType_JSON_BEHAVIOR_UNKNOWN: JsonBehaviorType = 5;
pub const JsonBehaviorType_JSON_BEHAVIOR_EMPTY_ARRAY: JsonBehaviorType = 6;
pub const JsonBehaviorType_JSON_BEHAVIOR_EMPTY_OBJECT: JsonBehaviorType = 7;
pub const JsonBehaviorType_JSON_BEHAVIOR_DEFAULT: JsonBehaviorType = 8;
pub type JsonBehaviorType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonBehavior {
    pub type_: NodeTag,
    pub btype: JsonBehaviorType,
    pub expr: *mut Node,
    pub coerce: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonBehavior"][::std::mem::size_of::<JsonBehavior>() - 24usize];
    ["Alignment of JsonBehavior"][::std::mem::align_of::<JsonBehavior>() - 8usize];
    ["Offset of field: JsonBehavior::type_"][::std::mem::offset_of!(JsonBehavior, type_) - 0usize];
    ["Offset of field: JsonBehavior::btype"][::std::mem::offset_of!(JsonBehavior, btype) - 4usize];
    ["Offset of field: JsonBehavior::expr"][::std::mem::offset_of!(JsonBehavior, expr) - 8usize];
    ["Offset of field: JsonBehavior::coerce"]
        [::std::mem::offset_of!(JsonBehavior, coerce) - 16usize];
    ["Offset of field: JsonBehavior::location"]
        [::std::mem::offset_of!(JsonBehavior, location) - 20usize];
};
pub const JsonExprOp_JSON_EXISTS_OP: JsonExprOp = 0;
pub const JsonExprOp_JSON_QUERY_OP: JsonExprOp = 1;
pub const JsonExprOp_JSON_VALUE_OP: JsonExprOp = 2;
pub const JsonExprOp_JSON_TABLE_OP: JsonExprOp = 3;
pub type JsonExprOp = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonExpr {
    pub xpr: Expr,
    pub op: JsonExprOp,
    pub column_name: *mut ::std::os::raw::c_char,
    pub formatted_expr: *mut Node,
    pub format: *mut JsonFormat,
    pub path_spec: *mut Node,
    pub returning: *mut JsonReturning,
    pub passing_names: *mut List,
    pub passing_values: *mut List,
    pub on_empty: *mut JsonBehavior,
    pub on_error: *mut JsonBehavior,
    pub use_io_coercion: bool,
    pub use_json_coercion: bool,
    pub wrapper: JsonWrapper,
    pub omit_quotes: bool,
    pub collation: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonExpr"][::std::mem::size_of::<JsonExpr>() - 104usize];
    ["Alignment of JsonExpr"][::std::mem::align_of::<JsonExpr>() - 8usize];
    ["Offset of field: JsonExpr::xpr"][::std::mem::offset_of!(JsonExpr, xpr) - 0usize];
    ["Offset of field: JsonExpr::op"][::std::mem::offset_of!(JsonExpr, op) - 4usize];
    ["Offset of field: JsonExpr::column_name"]
        [::std::mem::offset_of!(JsonExpr, column_name) - 8usize];
    ["Offset of field: JsonExpr::formatted_expr"]
        [::std::mem::offset_of!(JsonExpr, formatted_expr) - 16usize];
    ["Offset of field: JsonExpr::format"][::std::mem::offset_of!(JsonExpr, format) - 24usize];
    ["Offset of field: JsonExpr::path_spec"][::std::mem::offset_of!(JsonExpr, path_spec) - 32usize];
    ["Offset of field: JsonExpr::returning"][::std::mem::offset_of!(JsonExpr, returning) - 40usize];
    ["Offset of field: JsonExpr::passing_names"]
        [::std::mem::offset_of!(JsonExpr, passing_names) - 48usize];
    ["Offset of field: JsonExpr::passing_values"]
        [::std::mem::offset_of!(JsonExpr, passing_values) - 56usize];
    ["Offset of field: JsonExpr::on_empty"][::std::mem::offset_of!(JsonExpr, on_empty) - 64usize];
    ["Offset of field: JsonExpr::on_error"][::std::mem::offset_of!(JsonExpr, on_error) - 72usize];
    ["Offset of field: JsonExpr::use_io_coercion"]
        [::std::mem::offset_of!(JsonExpr, use_io_coercion) - 80usize];
    ["Offset of field: JsonExpr::use_json_coercion"]
        [::std::mem::offset_of!(JsonExpr, use_json_coercion) - 81usize];
    ["Offset of field: JsonExpr::wrapper"][::std::mem::offset_of!(JsonExpr, wrapper) - 84usize];
    ["Offset of field: JsonExpr::omit_quotes"]
        [::std::mem::offset_of!(JsonExpr, omit_quotes) - 88usize];
    ["Offset of field: JsonExpr::collation"][::std::mem::offset_of!(JsonExpr, collation) - 92usize];
    ["Offset of field: JsonExpr::location"][::std::mem::offset_of!(JsonExpr, location) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTablePath {
    pub type_: NodeTag,
    pub value: *mut Const,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTablePath"][::std::mem::size_of::<JsonTablePath>() - 24usize];
    ["Alignment of JsonTablePath"][::std::mem::align_of::<JsonTablePath>() - 8usize];
    ["Offset of field: JsonTablePath::type_"]
        [::std::mem::offset_of!(JsonTablePath, type_) - 0usize];
    ["Offset of field: JsonTablePath::value"]
        [::std::mem::offset_of!(JsonTablePath, value) - 8usize];
    ["Offset of field: JsonTablePath::name"][::std::mem::offset_of!(JsonTablePath, name) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTablePlan {
    pub type_: NodeTag,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTablePlan"][::std::mem::size_of::<JsonTablePlan>() - 4usize];
    ["Alignment of JsonTablePlan"][::std::mem::align_of::<JsonTablePlan>() - 4usize];
    ["Offset of field: JsonTablePlan::type_"]
        [::std::mem::offset_of!(JsonTablePlan, type_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTablePathScan {
    pub plan: JsonTablePlan,
    pub path: *mut JsonTablePath,
    pub errorOnError: bool,
    pub child: *mut JsonTablePlan,
    pub colMin: ::std::os::raw::c_int,
    pub colMax: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTablePathScan"][::std::mem::size_of::<JsonTablePathScan>() - 40usize];
    ["Alignment of JsonTablePathScan"][::std::mem::align_of::<JsonTablePathScan>() - 8usize];
    ["Offset of field: JsonTablePathScan::plan"]
        [::std::mem::offset_of!(JsonTablePathScan, plan) - 0usize];
    ["Offset of field: JsonTablePathScan::path"]
        [::std::mem::offset_of!(JsonTablePathScan, path) - 8usize];
    ["Offset of field: JsonTablePathScan::errorOnError"]
        [::std::mem::offset_of!(JsonTablePathScan, errorOnError) - 16usize];
    ["Offset of field: JsonTablePathScan::child"]
        [::std::mem::offset_of!(JsonTablePathScan, child) - 24usize];
    ["Offset of field: JsonTablePathScan::colMin"]
        [::std::mem::offset_of!(JsonTablePathScan, colMin) - 32usize];
    ["Offset of field: JsonTablePathScan::colMax"]
        [::std::mem::offset_of!(JsonTablePathScan, colMax) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTableSiblingJoin {
    pub plan: JsonTablePlan,
    pub lplan: *mut JsonTablePlan,
    pub rplan: *mut JsonTablePlan,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTableSiblingJoin"][::std::mem::size_of::<JsonTableSiblingJoin>() - 24usize];
    ["Alignment of JsonTableSiblingJoin"][::std::mem::align_of::<JsonTableSiblingJoin>() - 8usize];
    ["Offset of field: JsonTableSiblingJoin::plan"]
        [::std::mem::offset_of!(JsonTableSiblingJoin, plan) - 0usize];
    ["Offset of field: JsonTableSiblingJoin::lplan"]
        [::std::mem::offset_of!(JsonTableSiblingJoin, lplan) - 8usize];
    ["Offset of field: JsonTableSiblingJoin::rplan"]
        [::std::mem::offset_of!(JsonTableSiblingJoin, rplan) - 16usize];
};
pub const NullTestType_IS_NULL: NullTestType = 0;
pub const NullTestType_IS_NOT_NULL: NullTestType = 1;
pub type NullTestType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NullTest {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub nulltesttype: NullTestType,
    pub argisrow: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NullTest"][::std::mem::size_of::<NullTest>() - 32usize];
    ["Alignment of NullTest"][::std::mem::align_of::<NullTest>() - 8usize];
    ["Offset of field: NullTest::xpr"][::std::mem::offset_of!(NullTest, xpr) - 0usize];
    ["Offset of field: NullTest::arg"][::std::mem::offset_of!(NullTest, arg) - 8usize];
    ["Offset of field: NullTest::nulltesttype"]
        [::std::mem::offset_of!(NullTest, nulltesttype) - 16usize];
    ["Offset of field: NullTest::argisrow"][::std::mem::offset_of!(NullTest, argisrow) - 20usize];
    ["Offset of field: NullTest::location"][::std::mem::offset_of!(NullTest, location) - 24usize];
};
pub const BoolTestType_IS_TRUE: BoolTestType = 0;
pub const BoolTestType_IS_NOT_TRUE: BoolTestType = 1;
pub const BoolTestType_IS_FALSE: BoolTestType = 2;
pub const BoolTestType_IS_NOT_FALSE: BoolTestType = 3;
pub const BoolTestType_IS_UNKNOWN: BoolTestType = 4;
pub const BoolTestType_IS_NOT_UNKNOWN: BoolTestType = 5;
pub type BoolTestType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BooleanTest {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub booltesttype: BoolTestType,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BooleanTest"][::std::mem::size_of::<BooleanTest>() - 24usize];
    ["Alignment of BooleanTest"][::std::mem::align_of::<BooleanTest>() - 8usize];
    ["Offset of field: BooleanTest::xpr"][::std::mem::offset_of!(BooleanTest, xpr) - 0usize];
    ["Offset of field: BooleanTest::arg"][::std::mem::offset_of!(BooleanTest, arg) - 8usize];
    ["Offset of field: BooleanTest::booltesttype"]
        [::std::mem::offset_of!(BooleanTest, booltesttype) - 16usize];
    ["Offset of field: BooleanTest::location"]
        [::std::mem::offset_of!(BooleanTest, location) - 20usize];
};
pub const MergeMatchKind_MERGE_WHEN_MATCHED: MergeMatchKind = 0;
pub const MergeMatchKind_MERGE_WHEN_NOT_MATCHED_BY_SOURCE: MergeMatchKind = 1;
pub const MergeMatchKind_MERGE_WHEN_NOT_MATCHED_BY_TARGET: MergeMatchKind = 2;
pub type MergeMatchKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MergeAction {
    pub type_: NodeTag,
    pub matchKind: MergeMatchKind,
    pub commandType: CmdType,
    pub override_: OverridingKind,
    pub qual: *mut Node,
    pub targetList: *mut List,
    pub updateColnos: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MergeAction"][::std::mem::size_of::<MergeAction>() - 40usize];
    ["Alignment of MergeAction"][::std::mem::align_of::<MergeAction>() - 8usize];
    ["Offset of field: MergeAction::type_"][::std::mem::offset_of!(MergeAction, type_) - 0usize];
    ["Offset of field: MergeAction::matchKind"]
        [::std::mem::offset_of!(MergeAction, matchKind) - 4usize];
    ["Offset of field: MergeAction::commandType"]
        [::std::mem::offset_of!(MergeAction, commandType) - 8usize];
    ["Offset of field: MergeAction::override_"]
        [::std::mem::offset_of!(MergeAction, override_) - 12usize];
    ["Offset of field: MergeAction::qual"][::std::mem::offset_of!(MergeAction, qual) - 16usize];
    ["Offset of field: MergeAction::targetList"]
        [::std::mem::offset_of!(MergeAction, targetList) - 24usize];
    ["Offset of field: MergeAction::updateColnos"]
        [::std::mem::offset_of!(MergeAction, updateColnos) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoerceToDomain {
    pub xpr: Expr,
    pub arg: *mut Expr,
    pub resulttype: Oid,
    pub resulttypmod: int32,
    pub resultcollid: Oid,
    pub coercionformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoerceToDomain"][::std::mem::size_of::<CoerceToDomain>() - 40usize];
    ["Alignment of CoerceToDomain"][::std::mem::align_of::<CoerceToDomain>() - 8usize];
    ["Offset of field: CoerceToDomain::xpr"][::std::mem::offset_of!(CoerceToDomain, xpr) - 0usize];
    ["Offset of field: CoerceToDomain::arg"][::std::mem::offset_of!(CoerceToDomain, arg) - 8usize];
    ["Offset of field: CoerceToDomain::resulttype"]
        [::std::mem::offset_of!(CoerceToDomain, resulttype) - 16usize];
    ["Offset of field: CoerceToDomain::resulttypmod"]
        [::std::mem::offset_of!(CoerceToDomain, resulttypmod) - 20usize];
    ["Offset of field: CoerceToDomain::resultcollid"]
        [::std::mem::offset_of!(CoerceToDomain, resultcollid) - 24usize];
    ["Offset of field: CoerceToDomain::coercionformat"]
        [::std::mem::offset_of!(CoerceToDomain, coercionformat) - 28usize];
    ["Offset of field: CoerceToDomain::location"]
        [::std::mem::offset_of!(CoerceToDomain, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoerceToDomainValue {
    pub xpr: Expr,
    pub typeId: Oid,
    pub typeMod: int32,
    pub collation: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoerceToDomainValue"][::std::mem::size_of::<CoerceToDomainValue>() - 20usize];
    ["Alignment of CoerceToDomainValue"][::std::mem::align_of::<CoerceToDomainValue>() - 4usize];
    ["Offset of field: CoerceToDomainValue::xpr"]
        [::std::mem::offset_of!(CoerceToDomainValue, xpr) - 0usize];
    ["Offset of field: CoerceToDomainValue::typeId"]
        [::std::mem::offset_of!(CoerceToDomainValue, typeId) - 4usize];
    ["Offset of field: CoerceToDomainValue::typeMod"]
        [::std::mem::offset_of!(CoerceToDomainValue, typeMod) - 8usize];
    ["Offset of field: CoerceToDomainValue::collation"]
        [::std::mem::offset_of!(CoerceToDomainValue, collation) - 12usize];
    ["Offset of field: CoerceToDomainValue::location"]
        [::std::mem::offset_of!(CoerceToDomainValue, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SetToDefault {
    pub xpr: Expr,
    pub typeId: Oid,
    pub typeMod: int32,
    pub collation: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SetToDefault"][::std::mem::size_of::<SetToDefault>() - 20usize];
    ["Alignment of SetToDefault"][::std::mem::align_of::<SetToDefault>() - 4usize];
    ["Offset of field: SetToDefault::xpr"][::std::mem::offset_of!(SetToDefault, xpr) - 0usize];
    ["Offset of field: SetToDefault::typeId"]
        [::std::mem::offset_of!(SetToDefault, typeId) - 4usize];
    ["Offset of field: SetToDefault::typeMod"]
        [::std::mem::offset_of!(SetToDefault, typeMod) - 8usize];
    ["Offset of field: SetToDefault::collation"]
        [::std::mem::offset_of!(SetToDefault, collation) - 12usize];
    ["Offset of field: SetToDefault::location"]
        [::std::mem::offset_of!(SetToDefault, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CurrentOfExpr {
    pub xpr: Expr,
    pub cvarno: Index,
    pub cursor_name: *mut ::std::os::raw::c_char,
    pub cursor_param: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CurrentOfExpr"][::std::mem::size_of::<CurrentOfExpr>() - 24usize];
    ["Alignment of CurrentOfExpr"][::std::mem::align_of::<CurrentOfExpr>() - 8usize];
    ["Offset of field: CurrentOfExpr::xpr"][::std::mem::offset_of!(CurrentOfExpr, xpr) - 0usize];
    ["Offset of field: CurrentOfExpr::cvarno"]
        [::std::mem::offset_of!(CurrentOfExpr, cvarno) - 4usize];
    ["Offset of field: CurrentOfExpr::cursor_name"]
        [::std::mem::offset_of!(CurrentOfExpr, cursor_name) - 8usize];
    ["Offset of field: CurrentOfExpr::cursor_param"]
        [::std::mem::offset_of!(CurrentOfExpr, cursor_param) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NextValueExpr {
    pub xpr: Expr,
    pub seqid: Oid,
    pub typeId: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NextValueExpr"][::std::mem::size_of::<NextValueExpr>() - 12usize];
    ["Alignment of NextValueExpr"][::std::mem::align_of::<NextValueExpr>() - 4usize];
    ["Offset of field: NextValueExpr::xpr"][::std::mem::offset_of!(NextValueExpr, xpr) - 0usize];
    ["Offset of field: NextValueExpr::seqid"]
        [::std::mem::offset_of!(NextValueExpr, seqid) - 4usize];
    ["Offset of field: NextValueExpr::typeId"]
        [::std::mem::offset_of!(NextValueExpr, typeId) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InferenceElem {
    pub xpr: Expr,
    pub expr: *mut Node,
    pub infercollid: Oid,
    pub inferopclass: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InferenceElem"][::std::mem::size_of::<InferenceElem>() - 24usize];
    ["Alignment of InferenceElem"][::std::mem::align_of::<InferenceElem>() - 8usize];
    ["Offset of field: InferenceElem::xpr"][::std::mem::offset_of!(InferenceElem, xpr) - 0usize];
    ["Offset of field: InferenceElem::expr"][::std::mem::offset_of!(InferenceElem, expr) - 8usize];
    ["Offset of field: InferenceElem::infercollid"]
        [::std::mem::offset_of!(InferenceElem, infercollid) - 16usize];
    ["Offset of field: InferenceElem::inferopclass"]
        [::std::mem::offset_of!(InferenceElem, inferopclass) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReturningExpr {
    pub xpr: Expr,
    pub retlevelsup: ::std::os::raw::c_int,
    pub retold: bool,
    pub retexpr: *mut Expr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReturningExpr"][::std::mem::size_of::<ReturningExpr>() - 24usize];
    ["Alignment of ReturningExpr"][::std::mem::align_of::<ReturningExpr>() - 8usize];
    ["Offset of field: ReturningExpr::xpr"][::std::mem::offset_of!(ReturningExpr, xpr) - 0usize];
    ["Offset of field: ReturningExpr::retlevelsup"]
        [::std::mem::offset_of!(ReturningExpr, retlevelsup) - 4usize];
    ["Offset of field: ReturningExpr::retold"]
        [::std::mem::offset_of!(ReturningExpr, retold) - 8usize];
    ["Offset of field: ReturningExpr::retexpr"]
        [::std::mem::offset_of!(ReturningExpr, retexpr) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TargetEntry {
    pub xpr: Expr,
    pub expr: *mut Expr,
    pub resno: AttrNumber,
    pub resname: *mut ::std::os::raw::c_char,
    pub ressortgroupref: Index,
    pub resorigtbl: Oid,
    pub resorigcol: AttrNumber,
    pub resjunk: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TargetEntry"][::std::mem::size_of::<TargetEntry>() - 48usize];
    ["Alignment of TargetEntry"][::std::mem::align_of::<TargetEntry>() - 8usize];
    ["Offset of field: TargetEntry::xpr"][::std::mem::offset_of!(TargetEntry, xpr) - 0usize];
    ["Offset of field: TargetEntry::expr"][::std::mem::offset_of!(TargetEntry, expr) - 8usize];
    ["Offset of field: TargetEntry::resno"][::std::mem::offset_of!(TargetEntry, resno) - 16usize];
    ["Offset of field: TargetEntry::resname"]
        [::std::mem::offset_of!(TargetEntry, resname) - 24usize];
    ["Offset of field: TargetEntry::ressortgroupref"]
        [::std::mem::offset_of!(TargetEntry, ressortgroupref) - 32usize];
    ["Offset of field: TargetEntry::resorigtbl"]
        [::std::mem::offset_of!(TargetEntry, resorigtbl) - 36usize];
    ["Offset of field: TargetEntry::resorigcol"]
        [::std::mem::offset_of!(TargetEntry, resorigcol) - 40usize];
    ["Offset of field: TargetEntry::resjunk"]
        [::std::mem::offset_of!(TargetEntry, resjunk) - 42usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTblRef {
    pub type_: NodeTag,
    pub rtindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTblRef"][::std::mem::size_of::<RangeTblRef>() - 8usize];
    ["Alignment of RangeTblRef"][::std::mem::align_of::<RangeTblRef>() - 4usize];
    ["Offset of field: RangeTblRef::type_"][::std::mem::offset_of!(RangeTblRef, type_) - 0usize];
    ["Offset of field: RangeTblRef::rtindex"]
        [::std::mem::offset_of!(RangeTblRef, rtindex) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JoinExpr {
    pub type_: NodeTag,
    pub jointype: JoinType,
    pub isNatural: bool,
    pub larg: *mut Node,
    pub rarg: *mut Node,
    pub usingClause: *mut List,
    pub join_using_alias: *mut Alias,
    pub quals: *mut Node,
    pub alias: *mut Alias,
    pub rtindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JoinExpr"][::std::mem::size_of::<JoinExpr>() - 72usize];
    ["Alignment of JoinExpr"][::std::mem::align_of::<JoinExpr>() - 8usize];
    ["Offset of field: JoinExpr::type_"][::std::mem::offset_of!(JoinExpr, type_) - 0usize];
    ["Offset of field: JoinExpr::jointype"][::std::mem::offset_of!(JoinExpr, jointype) - 4usize];
    ["Offset of field: JoinExpr::isNatural"][::std::mem::offset_of!(JoinExpr, isNatural) - 8usize];
    ["Offset of field: JoinExpr::larg"][::std::mem::offset_of!(JoinExpr, larg) - 16usize];
    ["Offset of field: JoinExpr::rarg"][::std::mem::offset_of!(JoinExpr, rarg) - 24usize];
    ["Offset of field: JoinExpr::usingClause"]
        [::std::mem::offset_of!(JoinExpr, usingClause) - 32usize];
    ["Offset of field: JoinExpr::join_using_alias"]
        [::std::mem::offset_of!(JoinExpr, join_using_alias) - 40usize];
    ["Offset of field: JoinExpr::quals"][::std::mem::offset_of!(JoinExpr, quals) - 48usize];
    ["Offset of field: JoinExpr::alias"][::std::mem::offset_of!(JoinExpr, alias) - 56usize];
    ["Offset of field: JoinExpr::rtindex"][::std::mem::offset_of!(JoinExpr, rtindex) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FromExpr {
    pub type_: NodeTag,
    pub fromlist: *mut List,
    pub quals: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FromExpr"][::std::mem::size_of::<FromExpr>() - 24usize];
    ["Alignment of FromExpr"][::std::mem::align_of::<FromExpr>() - 8usize];
    ["Offset of field: FromExpr::type_"][::std::mem::offset_of!(FromExpr, type_) - 0usize];
    ["Offset of field: FromExpr::fromlist"][::std::mem::offset_of!(FromExpr, fromlist) - 8usize];
    ["Offset of field: FromExpr::quals"][::std::mem::offset_of!(FromExpr, quals) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OnConflictExpr {
    pub type_: NodeTag,
    pub action: OnConflictAction,
    pub arbiterElems: *mut List,
    pub arbiterWhere: *mut Node,
    pub constraint: Oid,
    pub onConflictSet: *mut List,
    pub onConflictWhere: *mut Node,
    pub exclRelIndex: ::std::os::raw::c_int,
    pub exclRelTlist: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OnConflictExpr"][::std::mem::size_of::<OnConflictExpr>() - 64usize];
    ["Alignment of OnConflictExpr"][::std::mem::align_of::<OnConflictExpr>() - 8usize];
    ["Offset of field: OnConflictExpr::type_"]
        [::std::mem::offset_of!(OnConflictExpr, type_) - 0usize];
    ["Offset of field: OnConflictExpr::action"]
        [::std::mem::offset_of!(OnConflictExpr, action) - 4usize];
    ["Offset of field: OnConflictExpr::arbiterElems"]
        [::std::mem::offset_of!(OnConflictExpr, arbiterElems) - 8usize];
    ["Offset of field: OnConflictExpr::arbiterWhere"]
        [::std::mem::offset_of!(OnConflictExpr, arbiterWhere) - 16usize];
    ["Offset of field: OnConflictExpr::constraint"]
        [::std::mem::offset_of!(OnConflictExpr, constraint) - 24usize];
    ["Offset of field: OnConflictExpr::onConflictSet"]
        [::std::mem::offset_of!(OnConflictExpr, onConflictSet) - 32usize];
    ["Offset of field: OnConflictExpr::onConflictWhere"]
        [::std::mem::offset_of!(OnConflictExpr, onConflictWhere) - 40usize];
    ["Offset of field: OnConflictExpr::exclRelIndex"]
        [::std::mem::offset_of!(OnConflictExpr, exclRelIndex) - 48usize];
    ["Offset of field: OnConflictExpr::exclRelTlist"]
        [::std::mem::offset_of!(OnConflictExpr, exclRelTlist) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Integer {
    pub type_: NodeTag,
    pub ival: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Integer"][::std::mem::size_of::<Integer>() - 8usize];
    ["Alignment of Integer"][::std::mem::align_of::<Integer>() - 4usize];
    ["Offset of field: Integer::type_"][::std::mem::offset_of!(Integer, type_) - 0usize];
    ["Offset of field: Integer::ival"][::std::mem::offset_of!(Integer, ival) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Float {
    pub type_: NodeTag,
    pub fval: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Float"][::std::mem::size_of::<Float>() - 16usize];
    ["Alignment of Float"][::std::mem::align_of::<Float>() - 8usize];
    ["Offset of field: Float::type_"][::std::mem::offset_of!(Float, type_) - 0usize];
    ["Offset of field: Float::fval"][::std::mem::offset_of!(Float, fval) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Boolean {
    pub type_: NodeTag,
    pub boolval: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Boolean"][::std::mem::size_of::<Boolean>() - 8usize];
    ["Alignment of Boolean"][::std::mem::align_of::<Boolean>() - 4usize];
    ["Offset of field: Boolean::type_"][::std::mem::offset_of!(Boolean, type_) - 0usize];
    ["Offset of field: Boolean::boolval"][::std::mem::offset_of!(Boolean, boolval) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct String {
    pub type_: NodeTag,
    pub sval: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of String"][::std::mem::size_of::<String>() - 16usize];
    ["Alignment of String"][::std::mem::align_of::<String>() - 8usize];
    ["Offset of field: String::type_"][::std::mem::offset_of!(String, type_) - 0usize];
    ["Offset of field: String::sval"][::std::mem::offset_of!(String, sval) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitString {
    pub type_: NodeTag,
    pub bsval: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BitString"][::std::mem::size_of::<BitString>() - 16usize];
    ["Alignment of BitString"][::std::mem::align_of::<BitString>() - 8usize];
    ["Offset of field: BitString::type_"][::std::mem::offset_of!(BitString, type_) - 0usize];
    ["Offset of field: BitString::bsval"][::std::mem::offset_of!(BitString, bsval) - 8usize];
};
pub const QuerySource_QSRC_ORIGINAL: QuerySource = 0;
pub const QuerySource_QSRC_PARSER: QuerySource = 1;
pub const QuerySource_QSRC_INSTEAD_RULE: QuerySource = 2;
pub const QuerySource_QSRC_QUAL_INSTEAD_RULE: QuerySource = 3;
pub const QuerySource_QSRC_NON_INSTEAD_RULE: QuerySource = 4;
pub type QuerySource = ::std::os::raw::c_uint;
pub const SortByDir_SORTBY_DEFAULT: SortByDir = 0;
pub const SortByDir_SORTBY_ASC: SortByDir = 1;
pub const SortByDir_SORTBY_DESC: SortByDir = 2;
pub const SortByDir_SORTBY_USING: SortByDir = 3;
pub type SortByDir = ::std::os::raw::c_uint;
pub const SortByNulls_SORTBY_NULLS_DEFAULT: SortByNulls = 0;
pub const SortByNulls_SORTBY_NULLS_FIRST: SortByNulls = 1;
pub const SortByNulls_SORTBY_NULLS_LAST: SortByNulls = 2;
pub type SortByNulls = ::std::os::raw::c_uint;
pub const SetQuantifier_SET_QUANTIFIER_DEFAULT: SetQuantifier = 0;
pub const SetQuantifier_SET_QUANTIFIER_ALL: SetQuantifier = 1;
pub const SetQuantifier_SET_QUANTIFIER_DISTINCT: SetQuantifier = 2;
pub type SetQuantifier = ::std::os::raw::c_uint;
pub type AclMode = uint64;
#[doc = "\tQuery Tree"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Query {
    pub type_: NodeTag,
    pub commandType: CmdType,
    pub querySource: QuerySource,
    pub queryId: int64,
    pub canSetTag: bool,
    pub utilityStmt: *mut Node,
    pub resultRelation: ::std::os::raw::c_int,
    pub hasAggs: bool,
    pub hasWindowFuncs: bool,
    pub hasTargetSRFs: bool,
    pub hasSubLinks: bool,
    pub hasDistinctOn: bool,
    pub hasRecursive: bool,
    pub hasModifyingCTE: bool,
    pub hasForUpdate: bool,
    pub hasRowSecurity: bool,
    pub hasGroupRTE: bool,
    pub isReturn: bool,
    pub cteList: *mut List,
    pub rtable: *mut List,
    pub rteperminfos: *mut List,
    pub jointree: *mut FromExpr,
    pub mergeActionList: *mut List,
    pub mergeTargetRelation: ::std::os::raw::c_int,
    pub mergeJoinCondition: *mut Node,
    pub targetList: *mut List,
    pub override_: OverridingKind,
    pub onConflict: *mut OnConflictExpr,
    pub returningOldAlias: *mut ::std::os::raw::c_char,
    pub returningNewAlias: *mut ::std::os::raw::c_char,
    pub returningList: *mut List,
    pub groupClause: *mut List,
    pub groupDistinct: bool,
    pub groupingSets: *mut List,
    pub havingQual: *mut Node,
    pub windowClause: *mut List,
    pub distinctClause: *mut List,
    pub sortClause: *mut List,
    pub limitOffset: *mut Node,
    pub limitCount: *mut Node,
    pub limitOption: LimitOption,
    pub rowMarks: *mut List,
    pub setOperations: *mut Node,
    pub constraintDeps: *mut List,
    pub withCheckOptions: *mut List,
    pub stmt_location: ParseLoc,
    pub stmt_len: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Query"][::std::mem::size_of::<Query>() - 280usize];
    ["Alignment of Query"][::std::mem::align_of::<Query>() - 8usize];
    ["Offset of field: Query::type_"][::std::mem::offset_of!(Query, type_) - 0usize];
    ["Offset of field: Query::commandType"][::std::mem::offset_of!(Query, commandType) - 4usize];
    ["Offset of field: Query::querySource"][::std::mem::offset_of!(Query, querySource) - 8usize];
    ["Offset of field: Query::queryId"][::std::mem::offset_of!(Query, queryId) - 16usize];
    ["Offset of field: Query::canSetTag"][::std::mem::offset_of!(Query, canSetTag) - 24usize];
    ["Offset of field: Query::utilityStmt"][::std::mem::offset_of!(Query, utilityStmt) - 32usize];
    ["Offset of field: Query::resultRelation"]
        [::std::mem::offset_of!(Query, resultRelation) - 40usize];
    ["Offset of field: Query::hasAggs"][::std::mem::offset_of!(Query, hasAggs) - 44usize];
    ["Offset of field: Query::hasWindowFuncs"]
        [::std::mem::offset_of!(Query, hasWindowFuncs) - 45usize];
    ["Offset of field: Query::hasTargetSRFs"]
        [::std::mem::offset_of!(Query, hasTargetSRFs) - 46usize];
    ["Offset of field: Query::hasSubLinks"][::std::mem::offset_of!(Query, hasSubLinks) - 47usize];
    ["Offset of field: Query::hasDistinctOn"]
        [::std::mem::offset_of!(Query, hasDistinctOn) - 48usize];
    ["Offset of field: Query::hasRecursive"][::std::mem::offset_of!(Query, hasRecursive) - 49usize];
    ["Offset of field: Query::hasModifyingCTE"]
        [::std::mem::offset_of!(Query, hasModifyingCTE) - 50usize];
    ["Offset of field: Query::hasForUpdate"][::std::mem::offset_of!(Query, hasForUpdate) - 51usize];
    ["Offset of field: Query::hasRowSecurity"]
        [::std::mem::offset_of!(Query, hasRowSecurity) - 52usize];
    ["Offset of field: Query::hasGroupRTE"][::std::mem::offset_of!(Query, hasGroupRTE) - 53usize];
    ["Offset of field: Query::isReturn"][::std::mem::offset_of!(Query, isReturn) - 54usize];
    ["Offset of field: Query::cteList"][::std::mem::offset_of!(Query, cteList) - 56usize];
    ["Offset of field: Query::rtable"][::std::mem::offset_of!(Query, rtable) - 64usize];
    ["Offset of field: Query::rteperminfos"][::std::mem::offset_of!(Query, rteperminfos) - 72usize];
    ["Offset of field: Query::jointree"][::std::mem::offset_of!(Query, jointree) - 80usize];
    ["Offset of field: Query::mergeActionList"]
        [::std::mem::offset_of!(Query, mergeActionList) - 88usize];
    ["Offset of field: Query::mergeTargetRelation"]
        [::std::mem::offset_of!(Query, mergeTargetRelation) - 96usize];
    ["Offset of field: Query::mergeJoinCondition"]
        [::std::mem::offset_of!(Query, mergeJoinCondition) - 104usize];
    ["Offset of field: Query::targetList"][::std::mem::offset_of!(Query, targetList) - 112usize];
    ["Offset of field: Query::override_"][::std::mem::offset_of!(Query, override_) - 120usize];
    ["Offset of field: Query::onConflict"][::std::mem::offset_of!(Query, onConflict) - 128usize];
    ["Offset of field: Query::returningOldAlias"]
        [::std::mem::offset_of!(Query, returningOldAlias) - 136usize];
    ["Offset of field: Query::returningNewAlias"]
        [::std::mem::offset_of!(Query, returningNewAlias) - 144usize];
    ["Offset of field: Query::returningList"]
        [::std::mem::offset_of!(Query, returningList) - 152usize];
    ["Offset of field: Query::groupClause"][::std::mem::offset_of!(Query, groupClause) - 160usize];
    ["Offset of field: Query::groupDistinct"]
        [::std::mem::offset_of!(Query, groupDistinct) - 168usize];
    ["Offset of field: Query::groupingSets"]
        [::std::mem::offset_of!(Query, groupingSets) - 176usize];
    ["Offset of field: Query::havingQual"][::std::mem::offset_of!(Query, havingQual) - 184usize];
    ["Offset of field: Query::windowClause"]
        [::std::mem::offset_of!(Query, windowClause) - 192usize];
    ["Offset of field: Query::distinctClause"]
        [::std::mem::offset_of!(Query, distinctClause) - 200usize];
    ["Offset of field: Query::sortClause"][::std::mem::offset_of!(Query, sortClause) - 208usize];
    ["Offset of field: Query::limitOffset"][::std::mem::offset_of!(Query, limitOffset) - 216usize];
    ["Offset of field: Query::limitCount"][::std::mem::offset_of!(Query, limitCount) - 224usize];
    ["Offset of field: Query::limitOption"][::std::mem::offset_of!(Query, limitOption) - 232usize];
    ["Offset of field: Query::rowMarks"][::std::mem::offset_of!(Query, rowMarks) - 240usize];
    ["Offset of field: Query::setOperations"]
        [::std::mem::offset_of!(Query, setOperations) - 248usize];
    ["Offset of field: Query::constraintDeps"]
        [::std::mem::offset_of!(Query, constraintDeps) - 256usize];
    ["Offset of field: Query::withCheckOptions"]
        [::std::mem::offset_of!(Query, withCheckOptions) - 264usize];
    ["Offset of field: Query::stmt_location"]
        [::std::mem::offset_of!(Query, stmt_location) - 272usize];
    ["Offset of field: Query::stmt_len"][::std::mem::offset_of!(Query, stmt_len) - 276usize];
};
#[doc = "\tSupporting data structures for Parse Trees\n\n\tMost of these node types appear in raw parsetrees output by the grammar,\n\tand get transformed to something else by the analyzer.  A few of them\n\tare used as-is in transformed querytrees."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeName {
    pub type_: NodeTag,
    pub names: *mut List,
    pub typeOid: Oid,
    pub setof: bool,
    pub pct_type: bool,
    pub typmods: *mut List,
    pub typemod: int32,
    pub arrayBounds: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TypeName"][::std::mem::size_of::<TypeName>() - 56usize];
    ["Alignment of TypeName"][::std::mem::align_of::<TypeName>() - 8usize];
    ["Offset of field: TypeName::type_"][::std::mem::offset_of!(TypeName, type_) - 0usize];
    ["Offset of field: TypeName::names"][::std::mem::offset_of!(TypeName, names) - 8usize];
    ["Offset of field: TypeName::typeOid"][::std::mem::offset_of!(TypeName, typeOid) - 16usize];
    ["Offset of field: TypeName::setof"][::std::mem::offset_of!(TypeName, setof) - 20usize];
    ["Offset of field: TypeName::pct_type"][::std::mem::offset_of!(TypeName, pct_type) - 21usize];
    ["Offset of field: TypeName::typmods"][::std::mem::offset_of!(TypeName, typmods) - 24usize];
    ["Offset of field: TypeName::typemod"][::std::mem::offset_of!(TypeName, typemod) - 32usize];
    ["Offset of field: TypeName::arrayBounds"]
        [::std::mem::offset_of!(TypeName, arrayBounds) - 40usize];
    ["Offset of field: TypeName::location"][::std::mem::offset_of!(TypeName, location) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColumnRef {
    pub type_: NodeTag,
    pub fields: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColumnRef"][::std::mem::size_of::<ColumnRef>() - 24usize];
    ["Alignment of ColumnRef"][::std::mem::align_of::<ColumnRef>() - 8usize];
    ["Offset of field: ColumnRef::type_"][::std::mem::offset_of!(ColumnRef, type_) - 0usize];
    ["Offset of field: ColumnRef::fields"][::std::mem::offset_of!(ColumnRef, fields) - 8usize];
    ["Offset of field: ColumnRef::location"][::std::mem::offset_of!(ColumnRef, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParamRef {
    pub type_: NodeTag,
    pub number: ::std::os::raw::c_int,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ParamRef"][::std::mem::size_of::<ParamRef>() - 12usize];
    ["Alignment of ParamRef"][::std::mem::align_of::<ParamRef>() - 4usize];
    ["Offset of field: ParamRef::type_"][::std::mem::offset_of!(ParamRef, type_) - 0usize];
    ["Offset of field: ParamRef::number"][::std::mem::offset_of!(ParamRef, number) - 4usize];
    ["Offset of field: ParamRef::location"][::std::mem::offset_of!(ParamRef, location) - 8usize];
};
pub const A_Expr_Kind_AEXPR_OP: A_Expr_Kind = 0;
pub const A_Expr_Kind_AEXPR_OP_ANY: A_Expr_Kind = 1;
pub const A_Expr_Kind_AEXPR_OP_ALL: A_Expr_Kind = 2;
pub const A_Expr_Kind_AEXPR_DISTINCT: A_Expr_Kind = 3;
pub const A_Expr_Kind_AEXPR_NOT_DISTINCT: A_Expr_Kind = 4;
pub const A_Expr_Kind_AEXPR_NULLIF: A_Expr_Kind = 5;
pub const A_Expr_Kind_AEXPR_IN: A_Expr_Kind = 6;
pub const A_Expr_Kind_AEXPR_LIKE: A_Expr_Kind = 7;
pub const A_Expr_Kind_AEXPR_ILIKE: A_Expr_Kind = 8;
pub const A_Expr_Kind_AEXPR_SIMILAR: A_Expr_Kind = 9;
pub const A_Expr_Kind_AEXPR_BETWEEN: A_Expr_Kind = 10;
pub const A_Expr_Kind_AEXPR_NOT_BETWEEN: A_Expr_Kind = 11;
pub const A_Expr_Kind_AEXPR_BETWEEN_SYM: A_Expr_Kind = 12;
pub const A_Expr_Kind_AEXPR_NOT_BETWEEN_SYM: A_Expr_Kind = 13;
pub type A_Expr_Kind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A_Expr {
    pub type_: NodeTag,
    pub kind: A_Expr_Kind,
    pub name: *mut List,
    pub lexpr: *mut Node,
    pub rexpr: *mut Node,
    pub rexpr_list_start: ParseLoc,
    pub rexpr_list_end: ParseLoc,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_Expr"][::std::mem::size_of::<A_Expr>() - 48usize];
    ["Alignment of A_Expr"][::std::mem::align_of::<A_Expr>() - 8usize];
    ["Offset of field: A_Expr::type_"][::std::mem::offset_of!(A_Expr, type_) - 0usize];
    ["Offset of field: A_Expr::kind"][::std::mem::offset_of!(A_Expr, kind) - 4usize];
    ["Offset of field: A_Expr::name"][::std::mem::offset_of!(A_Expr, name) - 8usize];
    ["Offset of field: A_Expr::lexpr"][::std::mem::offset_of!(A_Expr, lexpr) - 16usize];
    ["Offset of field: A_Expr::rexpr"][::std::mem::offset_of!(A_Expr, rexpr) - 24usize];
    ["Offset of field: A_Expr::rexpr_list_start"]
        [::std::mem::offset_of!(A_Expr, rexpr_list_start) - 32usize];
    ["Offset of field: A_Expr::rexpr_list_end"]
        [::std::mem::offset_of!(A_Expr, rexpr_list_end) - 36usize];
    ["Offset of field: A_Expr::location"][::std::mem::offset_of!(A_Expr, location) - 40usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ValUnion {
    pub node: Node,
    pub ival: Integer,
    pub fval: Float,
    pub boolval: Boolean,
    pub sval: String,
    pub bsval: BitString,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ValUnion"][::std::mem::size_of::<ValUnion>() - 16usize];
    ["Alignment of ValUnion"][::std::mem::align_of::<ValUnion>() - 8usize];
    ["Offset of field: ValUnion::node"][::std::mem::offset_of!(ValUnion, node) - 0usize];
    ["Offset of field: ValUnion::ival"][::std::mem::offset_of!(ValUnion, ival) - 0usize];
    ["Offset of field: ValUnion::fval"][::std::mem::offset_of!(ValUnion, fval) - 0usize];
    ["Offset of field: ValUnion::boolval"][::std::mem::offset_of!(ValUnion, boolval) - 0usize];
    ["Offset of field: ValUnion::sval"][::std::mem::offset_of!(ValUnion, sval) - 0usize];
    ["Offset of field: ValUnion::bsval"][::std::mem::offset_of!(ValUnion, bsval) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct A_Const {
    pub type_: NodeTag,
    pub val: ValUnion,
    pub isnull: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_Const"][::std::mem::size_of::<A_Const>() - 32usize];
    ["Alignment of A_Const"][::std::mem::align_of::<A_Const>() - 8usize];
    ["Offset of field: A_Const::type_"][::std::mem::offset_of!(A_Const, type_) - 0usize];
    ["Offset of field: A_Const::val"][::std::mem::offset_of!(A_Const, val) - 8usize];
    ["Offset of field: A_Const::isnull"][::std::mem::offset_of!(A_Const, isnull) - 24usize];
    ["Offset of field: A_Const::location"][::std::mem::offset_of!(A_Const, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeCast {
    pub type_: NodeTag,
    pub arg: *mut Node,
    pub typeName: *mut TypeName,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TypeCast"][::std::mem::size_of::<TypeCast>() - 32usize];
    ["Alignment of TypeCast"][::std::mem::align_of::<TypeCast>() - 8usize];
    ["Offset of field: TypeCast::type_"][::std::mem::offset_of!(TypeCast, type_) - 0usize];
    ["Offset of field: TypeCast::arg"][::std::mem::offset_of!(TypeCast, arg) - 8usize];
    ["Offset of field: TypeCast::typeName"][::std::mem::offset_of!(TypeCast, typeName) - 16usize];
    ["Offset of field: TypeCast::location"][::std::mem::offset_of!(TypeCast, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollateClause {
    pub type_: NodeTag,
    pub arg: *mut Node,
    pub collname: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CollateClause"][::std::mem::size_of::<CollateClause>() - 32usize];
    ["Alignment of CollateClause"][::std::mem::align_of::<CollateClause>() - 8usize];
    ["Offset of field: CollateClause::type_"]
        [::std::mem::offset_of!(CollateClause, type_) - 0usize];
    ["Offset of field: CollateClause::arg"][::std::mem::offset_of!(CollateClause, arg) - 8usize];
    ["Offset of field: CollateClause::collname"]
        [::std::mem::offset_of!(CollateClause, collname) - 16usize];
    ["Offset of field: CollateClause::location"]
        [::std::mem::offset_of!(CollateClause, location) - 24usize];
};
pub const RoleSpecType_ROLESPEC_CSTRING: RoleSpecType = 0;
pub const RoleSpecType_ROLESPEC_CURRENT_ROLE: RoleSpecType = 1;
pub const RoleSpecType_ROLESPEC_CURRENT_USER: RoleSpecType = 2;
pub const RoleSpecType_ROLESPEC_SESSION_USER: RoleSpecType = 3;
pub const RoleSpecType_ROLESPEC_PUBLIC: RoleSpecType = 4;
pub type RoleSpecType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RoleSpec {
    pub type_: NodeTag,
    pub roletype: RoleSpecType,
    pub rolename: *mut ::std::os::raw::c_char,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RoleSpec"][::std::mem::size_of::<RoleSpec>() - 24usize];
    ["Alignment of RoleSpec"][::std::mem::align_of::<RoleSpec>() - 8usize];
    ["Offset of field: RoleSpec::type_"][::std::mem::offset_of!(RoleSpec, type_) - 0usize];
    ["Offset of field: RoleSpec::roletype"][::std::mem::offset_of!(RoleSpec, roletype) - 4usize];
    ["Offset of field: RoleSpec::rolename"][::std::mem::offset_of!(RoleSpec, rolename) - 8usize];
    ["Offset of field: RoleSpec::location"][::std::mem::offset_of!(RoleSpec, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FuncCall {
    pub type_: NodeTag,
    pub funcname: *mut List,
    pub args: *mut List,
    pub agg_order: *mut List,
    pub agg_filter: *mut Node,
    pub over: *mut WindowDef,
    pub agg_within_group: bool,
    pub agg_star: bool,
    pub agg_distinct: bool,
    pub func_variadic: bool,
    pub funcformat: CoercionForm,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FuncCall"][::std::mem::size_of::<FuncCall>() - 64usize];
    ["Alignment of FuncCall"][::std::mem::align_of::<FuncCall>() - 8usize];
    ["Offset of field: FuncCall::type_"][::std::mem::offset_of!(FuncCall, type_) - 0usize];
    ["Offset of field: FuncCall::funcname"][::std::mem::offset_of!(FuncCall, funcname) - 8usize];
    ["Offset of field: FuncCall::args"][::std::mem::offset_of!(FuncCall, args) - 16usize];
    ["Offset of field: FuncCall::agg_order"][::std::mem::offset_of!(FuncCall, agg_order) - 24usize];
    ["Offset of field: FuncCall::agg_filter"]
        [::std::mem::offset_of!(FuncCall, agg_filter) - 32usize];
    ["Offset of field: FuncCall::over"][::std::mem::offset_of!(FuncCall, over) - 40usize];
    ["Offset of field: FuncCall::agg_within_group"]
        [::std::mem::offset_of!(FuncCall, agg_within_group) - 48usize];
    ["Offset of field: FuncCall::agg_star"][::std::mem::offset_of!(FuncCall, agg_star) - 49usize];
    ["Offset of field: FuncCall::agg_distinct"]
        [::std::mem::offset_of!(FuncCall, agg_distinct) - 50usize];
    ["Offset of field: FuncCall::func_variadic"]
        [::std::mem::offset_of!(FuncCall, func_variadic) - 51usize];
    ["Offset of field: FuncCall::funcformat"]
        [::std::mem::offset_of!(FuncCall, funcformat) - 52usize];
    ["Offset of field: FuncCall::location"][::std::mem::offset_of!(FuncCall, location) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A_Star {
    pub type_: NodeTag,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_Star"][::std::mem::size_of::<A_Star>() - 4usize];
    ["Alignment of A_Star"][::std::mem::align_of::<A_Star>() - 4usize];
    ["Offset of field: A_Star::type_"][::std::mem::offset_of!(A_Star, type_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A_Indices {
    pub type_: NodeTag,
    pub is_slice: bool,
    pub lidx: *mut Node,
    pub uidx: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_Indices"][::std::mem::size_of::<A_Indices>() - 24usize];
    ["Alignment of A_Indices"][::std::mem::align_of::<A_Indices>() - 8usize];
    ["Offset of field: A_Indices::type_"][::std::mem::offset_of!(A_Indices, type_) - 0usize];
    ["Offset of field: A_Indices::is_slice"][::std::mem::offset_of!(A_Indices, is_slice) - 4usize];
    ["Offset of field: A_Indices::lidx"][::std::mem::offset_of!(A_Indices, lidx) - 8usize];
    ["Offset of field: A_Indices::uidx"][::std::mem::offset_of!(A_Indices, uidx) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A_Indirection {
    pub type_: NodeTag,
    pub arg: *mut Node,
    pub indirection: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_Indirection"][::std::mem::size_of::<A_Indirection>() - 24usize];
    ["Alignment of A_Indirection"][::std::mem::align_of::<A_Indirection>() - 8usize];
    ["Offset of field: A_Indirection::type_"]
        [::std::mem::offset_of!(A_Indirection, type_) - 0usize];
    ["Offset of field: A_Indirection::arg"][::std::mem::offset_of!(A_Indirection, arg) - 8usize];
    ["Offset of field: A_Indirection::indirection"]
        [::std::mem::offset_of!(A_Indirection, indirection) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A_ArrayExpr {
    pub type_: NodeTag,
    pub elements: *mut List,
    pub list_start: ParseLoc,
    pub list_end: ParseLoc,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A_ArrayExpr"][::std::mem::size_of::<A_ArrayExpr>() - 32usize];
    ["Alignment of A_ArrayExpr"][::std::mem::align_of::<A_ArrayExpr>() - 8usize];
    ["Offset of field: A_ArrayExpr::type_"][::std::mem::offset_of!(A_ArrayExpr, type_) - 0usize];
    ["Offset of field: A_ArrayExpr::elements"]
        [::std::mem::offset_of!(A_ArrayExpr, elements) - 8usize];
    ["Offset of field: A_ArrayExpr::list_start"]
        [::std::mem::offset_of!(A_ArrayExpr, list_start) - 16usize];
    ["Offset of field: A_ArrayExpr::list_end"]
        [::std::mem::offset_of!(A_ArrayExpr, list_end) - 20usize];
    ["Offset of field: A_ArrayExpr::location"]
        [::std::mem::offset_of!(A_ArrayExpr, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ResTarget {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub indirection: *mut List,
    pub val: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ResTarget"][::std::mem::size_of::<ResTarget>() - 40usize];
    ["Alignment of ResTarget"][::std::mem::align_of::<ResTarget>() - 8usize];
    ["Offset of field: ResTarget::type_"][::std::mem::offset_of!(ResTarget, type_) - 0usize];
    ["Offset of field: ResTarget::name"][::std::mem::offset_of!(ResTarget, name) - 8usize];
    ["Offset of field: ResTarget::indirection"]
        [::std::mem::offset_of!(ResTarget, indirection) - 16usize];
    ["Offset of field: ResTarget::val"][::std::mem::offset_of!(ResTarget, val) - 24usize];
    ["Offset of field: ResTarget::location"][::std::mem::offset_of!(ResTarget, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MultiAssignRef {
    pub type_: NodeTag,
    pub source: *mut Node,
    pub colno: ::std::os::raw::c_int,
    pub ncolumns: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MultiAssignRef"][::std::mem::size_of::<MultiAssignRef>() - 24usize];
    ["Alignment of MultiAssignRef"][::std::mem::align_of::<MultiAssignRef>() - 8usize];
    ["Offset of field: MultiAssignRef::type_"]
        [::std::mem::offset_of!(MultiAssignRef, type_) - 0usize];
    ["Offset of field: MultiAssignRef::source"]
        [::std::mem::offset_of!(MultiAssignRef, source) - 8usize];
    ["Offset of field: MultiAssignRef::colno"]
        [::std::mem::offset_of!(MultiAssignRef, colno) - 16usize];
    ["Offset of field: MultiAssignRef::ncolumns"]
        [::std::mem::offset_of!(MultiAssignRef, ncolumns) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SortBy {
    pub type_: NodeTag,
    pub node: *mut Node,
    pub sortby_dir: SortByDir,
    pub sortby_nulls: SortByNulls,
    pub useOp: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SortBy"][::std::mem::size_of::<SortBy>() - 40usize];
    ["Alignment of SortBy"][::std::mem::align_of::<SortBy>() - 8usize];
    ["Offset of field: SortBy::type_"][::std::mem::offset_of!(SortBy, type_) - 0usize];
    ["Offset of field: SortBy::node"][::std::mem::offset_of!(SortBy, node) - 8usize];
    ["Offset of field: SortBy::sortby_dir"][::std::mem::offset_of!(SortBy, sortby_dir) - 16usize];
    ["Offset of field: SortBy::sortby_nulls"]
        [::std::mem::offset_of!(SortBy, sortby_nulls) - 20usize];
    ["Offset of field: SortBy::useOp"][::std::mem::offset_of!(SortBy, useOp) - 24usize];
    ["Offset of field: SortBy::location"][::std::mem::offset_of!(SortBy, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WindowDef {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub refname: *mut ::std::os::raw::c_char,
    pub partitionClause: *mut List,
    pub orderClause: *mut List,
    pub frameOptions: ::std::os::raw::c_int,
    pub startOffset: *mut Node,
    pub endOffset: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WindowDef"][::std::mem::size_of::<WindowDef>() - 72usize];
    ["Alignment of WindowDef"][::std::mem::align_of::<WindowDef>() - 8usize];
    ["Offset of field: WindowDef::type_"][::std::mem::offset_of!(WindowDef, type_) - 0usize];
    ["Offset of field: WindowDef::name"][::std::mem::offset_of!(WindowDef, name) - 8usize];
    ["Offset of field: WindowDef::refname"][::std::mem::offset_of!(WindowDef, refname) - 16usize];
    ["Offset of field: WindowDef::partitionClause"]
        [::std::mem::offset_of!(WindowDef, partitionClause) - 24usize];
    ["Offset of field: WindowDef::orderClause"]
        [::std::mem::offset_of!(WindowDef, orderClause) - 32usize];
    ["Offset of field: WindowDef::frameOptions"]
        [::std::mem::offset_of!(WindowDef, frameOptions) - 40usize];
    ["Offset of field: WindowDef::startOffset"]
        [::std::mem::offset_of!(WindowDef, startOffset) - 48usize];
    ["Offset of field: WindowDef::endOffset"]
        [::std::mem::offset_of!(WindowDef, endOffset) - 56usize];
    ["Offset of field: WindowDef::location"][::std::mem::offset_of!(WindowDef, location) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeSubselect {
    pub type_: NodeTag,
    pub lateral: bool,
    pub subquery: *mut Node,
    pub alias: *mut Alias,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeSubselect"][::std::mem::size_of::<RangeSubselect>() - 24usize];
    ["Alignment of RangeSubselect"][::std::mem::align_of::<RangeSubselect>() - 8usize];
    ["Offset of field: RangeSubselect::type_"]
        [::std::mem::offset_of!(RangeSubselect, type_) - 0usize];
    ["Offset of field: RangeSubselect::lateral"]
        [::std::mem::offset_of!(RangeSubselect, lateral) - 4usize];
    ["Offset of field: RangeSubselect::subquery"]
        [::std::mem::offset_of!(RangeSubselect, subquery) - 8usize];
    ["Offset of field: RangeSubselect::alias"]
        [::std::mem::offset_of!(RangeSubselect, alias) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeFunction {
    pub type_: NodeTag,
    pub lateral: bool,
    pub ordinality: bool,
    pub is_rowsfrom: bool,
    pub functions: *mut List,
    pub alias: *mut Alias,
    pub coldeflist: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeFunction"][::std::mem::size_of::<RangeFunction>() - 32usize];
    ["Alignment of RangeFunction"][::std::mem::align_of::<RangeFunction>() - 8usize];
    ["Offset of field: RangeFunction::type_"]
        [::std::mem::offset_of!(RangeFunction, type_) - 0usize];
    ["Offset of field: RangeFunction::lateral"]
        [::std::mem::offset_of!(RangeFunction, lateral) - 4usize];
    ["Offset of field: RangeFunction::ordinality"]
        [::std::mem::offset_of!(RangeFunction, ordinality) - 5usize];
    ["Offset of field: RangeFunction::is_rowsfrom"]
        [::std::mem::offset_of!(RangeFunction, is_rowsfrom) - 6usize];
    ["Offset of field: RangeFunction::functions"]
        [::std::mem::offset_of!(RangeFunction, functions) - 8usize];
    ["Offset of field: RangeFunction::alias"]
        [::std::mem::offset_of!(RangeFunction, alias) - 16usize];
    ["Offset of field: RangeFunction::coldeflist"]
        [::std::mem::offset_of!(RangeFunction, coldeflist) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTableFunc {
    pub type_: NodeTag,
    pub lateral: bool,
    pub docexpr: *mut Node,
    pub rowexpr: *mut Node,
    pub namespaces: *mut List,
    pub columns: *mut List,
    pub alias: *mut Alias,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTableFunc"][::std::mem::size_of::<RangeTableFunc>() - 56usize];
    ["Alignment of RangeTableFunc"][::std::mem::align_of::<RangeTableFunc>() - 8usize];
    ["Offset of field: RangeTableFunc::type_"]
        [::std::mem::offset_of!(RangeTableFunc, type_) - 0usize];
    ["Offset of field: RangeTableFunc::lateral"]
        [::std::mem::offset_of!(RangeTableFunc, lateral) - 4usize];
    ["Offset of field: RangeTableFunc::docexpr"]
        [::std::mem::offset_of!(RangeTableFunc, docexpr) - 8usize];
    ["Offset of field: RangeTableFunc::rowexpr"]
        [::std::mem::offset_of!(RangeTableFunc, rowexpr) - 16usize];
    ["Offset of field: RangeTableFunc::namespaces"]
        [::std::mem::offset_of!(RangeTableFunc, namespaces) - 24usize];
    ["Offset of field: RangeTableFunc::columns"]
        [::std::mem::offset_of!(RangeTableFunc, columns) - 32usize];
    ["Offset of field: RangeTableFunc::alias"]
        [::std::mem::offset_of!(RangeTableFunc, alias) - 40usize];
    ["Offset of field: RangeTableFunc::location"]
        [::std::mem::offset_of!(RangeTableFunc, location) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTableFuncCol {
    pub type_: NodeTag,
    pub colname: *mut ::std::os::raw::c_char,
    pub typeName: *mut TypeName,
    pub for_ordinality: bool,
    pub is_not_null: bool,
    pub colexpr: *mut Node,
    pub coldefexpr: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTableFuncCol"][::std::mem::size_of::<RangeTableFuncCol>() - 56usize];
    ["Alignment of RangeTableFuncCol"][::std::mem::align_of::<RangeTableFuncCol>() - 8usize];
    ["Offset of field: RangeTableFuncCol::type_"]
        [::std::mem::offset_of!(RangeTableFuncCol, type_) - 0usize];
    ["Offset of field: RangeTableFuncCol::colname"]
        [::std::mem::offset_of!(RangeTableFuncCol, colname) - 8usize];
    ["Offset of field: RangeTableFuncCol::typeName"]
        [::std::mem::offset_of!(RangeTableFuncCol, typeName) - 16usize];
    ["Offset of field: RangeTableFuncCol::for_ordinality"]
        [::std::mem::offset_of!(RangeTableFuncCol, for_ordinality) - 24usize];
    ["Offset of field: RangeTableFuncCol::is_not_null"]
        [::std::mem::offset_of!(RangeTableFuncCol, is_not_null) - 25usize];
    ["Offset of field: RangeTableFuncCol::colexpr"]
        [::std::mem::offset_of!(RangeTableFuncCol, colexpr) - 32usize];
    ["Offset of field: RangeTableFuncCol::coldefexpr"]
        [::std::mem::offset_of!(RangeTableFuncCol, coldefexpr) - 40usize];
    ["Offset of field: RangeTableFuncCol::location"]
        [::std::mem::offset_of!(RangeTableFuncCol, location) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTableSample {
    pub type_: NodeTag,
    pub relation: *mut Node,
    pub method: *mut List,
    pub args: *mut List,
    pub repeatable: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTableSample"][::std::mem::size_of::<RangeTableSample>() - 48usize];
    ["Alignment of RangeTableSample"][::std::mem::align_of::<RangeTableSample>() - 8usize];
    ["Offset of field: RangeTableSample::type_"]
        [::std::mem::offset_of!(RangeTableSample, type_) - 0usize];
    ["Offset of field: RangeTableSample::relation"]
        [::std::mem::offset_of!(RangeTableSample, relation) - 8usize];
    ["Offset of field: RangeTableSample::method"]
        [::std::mem::offset_of!(RangeTableSample, method) - 16usize];
    ["Offset of field: RangeTableSample::args"]
        [::std::mem::offset_of!(RangeTableSample, args) - 24usize];
    ["Offset of field: RangeTableSample::repeatable"]
        [::std::mem::offset_of!(RangeTableSample, repeatable) - 32usize];
    ["Offset of field: RangeTableSample::location"]
        [::std::mem::offset_of!(RangeTableSample, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColumnDef {
    pub type_: NodeTag,
    pub colname: *mut ::std::os::raw::c_char,
    pub typeName: *mut TypeName,
    pub compression: *mut ::std::os::raw::c_char,
    pub inhcount: int16,
    pub is_local: bool,
    pub is_not_null: bool,
    pub is_from_type: bool,
    pub storage: ::std::os::raw::c_char,
    pub storage_name: *mut ::std::os::raw::c_char,
    pub raw_default: *mut Node,
    pub cooked_default: *mut Node,
    pub identity: ::std::os::raw::c_char,
    pub identitySequence: *mut RangeVar,
    pub generated: ::std::os::raw::c_char,
    pub collClause: *mut CollateClause,
    pub collOid: Oid,
    pub constraints: *mut List,
    pub fdwoptions: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColumnDef"][::std::mem::size_of::<ColumnDef>() - 128usize];
    ["Alignment of ColumnDef"][::std::mem::align_of::<ColumnDef>() - 8usize];
    ["Offset of field: ColumnDef::type_"][::std::mem::offset_of!(ColumnDef, type_) - 0usize];
    ["Offset of field: ColumnDef::colname"][::std::mem::offset_of!(ColumnDef, colname) - 8usize];
    ["Offset of field: ColumnDef::typeName"][::std::mem::offset_of!(ColumnDef, typeName) - 16usize];
    ["Offset of field: ColumnDef::compression"]
        [::std::mem::offset_of!(ColumnDef, compression) - 24usize];
    ["Offset of field: ColumnDef::inhcount"][::std::mem::offset_of!(ColumnDef, inhcount) - 32usize];
    ["Offset of field: ColumnDef::is_local"][::std::mem::offset_of!(ColumnDef, is_local) - 34usize];
    ["Offset of field: ColumnDef::is_not_null"]
        [::std::mem::offset_of!(ColumnDef, is_not_null) - 35usize];
    ["Offset of field: ColumnDef::is_from_type"]
        [::std::mem::offset_of!(ColumnDef, is_from_type) - 36usize];
    ["Offset of field: ColumnDef::storage"][::std::mem::offset_of!(ColumnDef, storage) - 37usize];
    ["Offset of field: ColumnDef::storage_name"]
        [::std::mem::offset_of!(ColumnDef, storage_name) - 40usize];
    ["Offset of field: ColumnDef::raw_default"]
        [::std::mem::offset_of!(ColumnDef, raw_default) - 48usize];
    ["Offset of field: ColumnDef::cooked_default"]
        [::std::mem::offset_of!(ColumnDef, cooked_default) - 56usize];
    ["Offset of field: ColumnDef::identity"][::std::mem::offset_of!(ColumnDef, identity) - 64usize];
    ["Offset of field: ColumnDef::identitySequence"]
        [::std::mem::offset_of!(ColumnDef, identitySequence) - 72usize];
    ["Offset of field: ColumnDef::generated"]
        [::std::mem::offset_of!(ColumnDef, generated) - 80usize];
    ["Offset of field: ColumnDef::collClause"]
        [::std::mem::offset_of!(ColumnDef, collClause) - 88usize];
    ["Offset of field: ColumnDef::collOid"][::std::mem::offset_of!(ColumnDef, collOid) - 96usize];
    ["Offset of field: ColumnDef::constraints"]
        [::std::mem::offset_of!(ColumnDef, constraints) - 104usize];
    ["Offset of field: ColumnDef::fdwoptions"]
        [::std::mem::offset_of!(ColumnDef, fdwoptions) - 112usize];
    ["Offset of field: ColumnDef::location"]
        [::std::mem::offset_of!(ColumnDef, location) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableLikeClause {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub options: bits32,
    pub relationOid: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TableLikeClause"][::std::mem::size_of::<TableLikeClause>() - 24usize];
    ["Alignment of TableLikeClause"][::std::mem::align_of::<TableLikeClause>() - 8usize];
    ["Offset of field: TableLikeClause::type_"]
        [::std::mem::offset_of!(TableLikeClause, type_) - 0usize];
    ["Offset of field: TableLikeClause::relation"]
        [::std::mem::offset_of!(TableLikeClause, relation) - 8usize];
    ["Offset of field: TableLikeClause::options"]
        [::std::mem::offset_of!(TableLikeClause, options) - 16usize];
    ["Offset of field: TableLikeClause::relationOid"]
        [::std::mem::offset_of!(TableLikeClause, relationOid) - 20usize];
};
pub const TableLikeOption_CREATE_TABLE_LIKE_COMMENTS: TableLikeOption = 1;
pub const TableLikeOption_CREATE_TABLE_LIKE_COMPRESSION: TableLikeOption = 2;
pub const TableLikeOption_CREATE_TABLE_LIKE_CONSTRAINTS: TableLikeOption = 4;
pub const TableLikeOption_CREATE_TABLE_LIKE_DEFAULTS: TableLikeOption = 8;
pub const TableLikeOption_CREATE_TABLE_LIKE_GENERATED: TableLikeOption = 16;
pub const TableLikeOption_CREATE_TABLE_LIKE_IDENTITY: TableLikeOption = 32;
pub const TableLikeOption_CREATE_TABLE_LIKE_INDEXES: TableLikeOption = 64;
pub const TableLikeOption_CREATE_TABLE_LIKE_STATISTICS: TableLikeOption = 128;
pub const TableLikeOption_CREATE_TABLE_LIKE_STORAGE: TableLikeOption = 256;
pub const TableLikeOption_CREATE_TABLE_LIKE_ALL: TableLikeOption = 2147483647;
pub type TableLikeOption = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IndexElem {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub expr: *mut Node,
    pub indexcolname: *mut ::std::os::raw::c_char,
    pub collation: *mut List,
    pub opclass: *mut List,
    pub opclassopts: *mut List,
    pub ordering: SortByDir,
    pub nulls_ordering: SortByNulls,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IndexElem"][::std::mem::size_of::<IndexElem>() - 64usize];
    ["Alignment of IndexElem"][::std::mem::align_of::<IndexElem>() - 8usize];
    ["Offset of field: IndexElem::type_"][::std::mem::offset_of!(IndexElem, type_) - 0usize];
    ["Offset of field: IndexElem::name"][::std::mem::offset_of!(IndexElem, name) - 8usize];
    ["Offset of field: IndexElem::expr"][::std::mem::offset_of!(IndexElem, expr) - 16usize];
    ["Offset of field: IndexElem::indexcolname"]
        [::std::mem::offset_of!(IndexElem, indexcolname) - 24usize];
    ["Offset of field: IndexElem::collation"]
        [::std::mem::offset_of!(IndexElem, collation) - 32usize];
    ["Offset of field: IndexElem::opclass"][::std::mem::offset_of!(IndexElem, opclass) - 40usize];
    ["Offset of field: IndexElem::opclassopts"]
        [::std::mem::offset_of!(IndexElem, opclassopts) - 48usize];
    ["Offset of field: IndexElem::ordering"][::std::mem::offset_of!(IndexElem, ordering) - 56usize];
    ["Offset of field: IndexElem::nulls_ordering"]
        [::std::mem::offset_of!(IndexElem, nulls_ordering) - 60usize];
};
pub const DefElemAction_DEFELEM_UNSPEC: DefElemAction = 0;
pub const DefElemAction_DEFELEM_SET: DefElemAction = 1;
pub const DefElemAction_DEFELEM_ADD: DefElemAction = 2;
pub const DefElemAction_DEFELEM_DROP: DefElemAction = 3;
pub type DefElemAction = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DefElem {
    pub type_: NodeTag,
    pub defnamespace: *mut ::std::os::raw::c_char,
    pub defname: *mut ::std::os::raw::c_char,
    pub arg: *mut Node,
    pub defaction: DefElemAction,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DefElem"][::std::mem::size_of::<DefElem>() - 40usize];
    ["Alignment of DefElem"][::std::mem::align_of::<DefElem>() - 8usize];
    ["Offset of field: DefElem::type_"][::std::mem::offset_of!(DefElem, type_) - 0usize];
    ["Offset of field: DefElem::defnamespace"]
        [::std::mem::offset_of!(DefElem, defnamespace) - 8usize];
    ["Offset of field: DefElem::defname"][::std::mem::offset_of!(DefElem, defname) - 16usize];
    ["Offset of field: DefElem::arg"][::std::mem::offset_of!(DefElem, arg) - 24usize];
    ["Offset of field: DefElem::defaction"][::std::mem::offset_of!(DefElem, defaction) - 32usize];
    ["Offset of field: DefElem::location"][::std::mem::offset_of!(DefElem, location) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LockingClause {
    pub type_: NodeTag,
    pub lockedRels: *mut List,
    pub strength: LockClauseStrength,
    pub waitPolicy: LockWaitPolicy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LockingClause"][::std::mem::size_of::<LockingClause>() - 24usize];
    ["Alignment of LockingClause"][::std::mem::align_of::<LockingClause>() - 8usize];
    ["Offset of field: LockingClause::type_"]
        [::std::mem::offset_of!(LockingClause, type_) - 0usize];
    ["Offset of field: LockingClause::lockedRels"]
        [::std::mem::offset_of!(LockingClause, lockedRels) - 8usize];
    ["Offset of field: LockingClause::strength"]
        [::std::mem::offset_of!(LockingClause, strength) - 16usize];
    ["Offset of field: LockingClause::waitPolicy"]
        [::std::mem::offset_of!(LockingClause, waitPolicy) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XmlSerialize {
    pub type_: NodeTag,
    pub xmloption: XmlOptionType,
    pub expr: *mut Node,
    pub typeName: *mut TypeName,
    pub indent: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XmlSerialize"][::std::mem::size_of::<XmlSerialize>() - 32usize];
    ["Alignment of XmlSerialize"][::std::mem::align_of::<XmlSerialize>() - 8usize];
    ["Offset of field: XmlSerialize::type_"][::std::mem::offset_of!(XmlSerialize, type_) - 0usize];
    ["Offset of field: XmlSerialize::xmloption"]
        [::std::mem::offset_of!(XmlSerialize, xmloption) - 4usize];
    ["Offset of field: XmlSerialize::expr"][::std::mem::offset_of!(XmlSerialize, expr) - 8usize];
    ["Offset of field: XmlSerialize::typeName"]
        [::std::mem::offset_of!(XmlSerialize, typeName) - 16usize];
    ["Offset of field: XmlSerialize::indent"]
        [::std::mem::offset_of!(XmlSerialize, indent) - 24usize];
    ["Offset of field: XmlSerialize::location"]
        [::std::mem::offset_of!(XmlSerialize, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartitionElem {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub expr: *mut Node,
    pub collation: *mut List,
    pub opclass: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PartitionElem"][::std::mem::size_of::<PartitionElem>() - 48usize];
    ["Alignment of PartitionElem"][::std::mem::align_of::<PartitionElem>() - 8usize];
    ["Offset of field: PartitionElem::type_"]
        [::std::mem::offset_of!(PartitionElem, type_) - 0usize];
    ["Offset of field: PartitionElem::name"][::std::mem::offset_of!(PartitionElem, name) - 8usize];
    ["Offset of field: PartitionElem::expr"][::std::mem::offset_of!(PartitionElem, expr) - 16usize];
    ["Offset of field: PartitionElem::collation"]
        [::std::mem::offset_of!(PartitionElem, collation) - 24usize];
    ["Offset of field: PartitionElem::opclass"]
        [::std::mem::offset_of!(PartitionElem, opclass) - 32usize];
    ["Offset of field: PartitionElem::location"]
        [::std::mem::offset_of!(PartitionElem, location) - 40usize];
};
pub const PartitionStrategy_PARTITION_STRATEGY_LIST: PartitionStrategy = 108;
pub const PartitionStrategy_PARTITION_STRATEGY_RANGE: PartitionStrategy = 114;
pub const PartitionStrategy_PARTITION_STRATEGY_HASH: PartitionStrategy = 104;
pub type PartitionStrategy = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartitionSpec {
    pub type_: NodeTag,
    pub strategy: PartitionStrategy,
    pub partParams: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PartitionSpec"][::std::mem::size_of::<PartitionSpec>() - 24usize];
    ["Alignment of PartitionSpec"][::std::mem::align_of::<PartitionSpec>() - 8usize];
    ["Offset of field: PartitionSpec::type_"]
        [::std::mem::offset_of!(PartitionSpec, type_) - 0usize];
    ["Offset of field: PartitionSpec::strategy"]
        [::std::mem::offset_of!(PartitionSpec, strategy) - 4usize];
    ["Offset of field: PartitionSpec::partParams"]
        [::std::mem::offset_of!(PartitionSpec, partParams) - 8usize];
    ["Offset of field: PartitionSpec::location"]
        [::std::mem::offset_of!(PartitionSpec, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartitionBoundSpec {
    pub type_: NodeTag,
    pub strategy: ::std::os::raw::c_char,
    pub is_default: bool,
    pub modulus: ::std::os::raw::c_int,
    pub remainder: ::std::os::raw::c_int,
    pub listdatums: *mut List,
    pub lowerdatums: *mut List,
    pub upperdatums: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PartitionBoundSpec"][::std::mem::size_of::<PartitionBoundSpec>() - 48usize];
    ["Alignment of PartitionBoundSpec"][::std::mem::align_of::<PartitionBoundSpec>() - 8usize];
    ["Offset of field: PartitionBoundSpec::type_"]
        [::std::mem::offset_of!(PartitionBoundSpec, type_) - 0usize];
    ["Offset of field: PartitionBoundSpec::strategy"]
        [::std::mem::offset_of!(PartitionBoundSpec, strategy) - 4usize];
    ["Offset of field: PartitionBoundSpec::is_default"]
        [::std::mem::offset_of!(PartitionBoundSpec, is_default) - 5usize];
    ["Offset of field: PartitionBoundSpec::modulus"]
        [::std::mem::offset_of!(PartitionBoundSpec, modulus) - 8usize];
    ["Offset of field: PartitionBoundSpec::remainder"]
        [::std::mem::offset_of!(PartitionBoundSpec, remainder) - 12usize];
    ["Offset of field: PartitionBoundSpec::listdatums"]
        [::std::mem::offset_of!(PartitionBoundSpec, listdatums) - 16usize];
    ["Offset of field: PartitionBoundSpec::lowerdatums"]
        [::std::mem::offset_of!(PartitionBoundSpec, lowerdatums) - 24usize];
    ["Offset of field: PartitionBoundSpec::upperdatums"]
        [::std::mem::offset_of!(PartitionBoundSpec, upperdatums) - 32usize];
    ["Offset of field: PartitionBoundSpec::location"]
        [::std::mem::offset_of!(PartitionBoundSpec, location) - 40usize];
};
pub const PartitionRangeDatumKind_PARTITION_RANGE_DATUM_MINVALUE: PartitionRangeDatumKind = -1;
pub const PartitionRangeDatumKind_PARTITION_RANGE_DATUM_VALUE: PartitionRangeDatumKind = 0;
pub const PartitionRangeDatumKind_PARTITION_RANGE_DATUM_MAXVALUE: PartitionRangeDatumKind = 1;
pub type PartitionRangeDatumKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartitionRangeDatum {
    pub type_: NodeTag,
    pub kind: PartitionRangeDatumKind,
    pub value: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PartitionRangeDatum"][::std::mem::size_of::<PartitionRangeDatum>() - 24usize];
    ["Alignment of PartitionRangeDatum"][::std::mem::align_of::<PartitionRangeDatum>() - 8usize];
    ["Offset of field: PartitionRangeDatum::type_"]
        [::std::mem::offset_of!(PartitionRangeDatum, type_) - 0usize];
    ["Offset of field: PartitionRangeDatum::kind"]
        [::std::mem::offset_of!(PartitionRangeDatum, kind) - 4usize];
    ["Offset of field: PartitionRangeDatum::value"]
        [::std::mem::offset_of!(PartitionRangeDatum, value) - 8usize];
    ["Offset of field: PartitionRangeDatum::location"]
        [::std::mem::offset_of!(PartitionRangeDatum, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PartitionCmd {
    pub type_: NodeTag,
    pub name: *mut RangeVar,
    pub bound: *mut PartitionBoundSpec,
    pub concurrent: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PartitionCmd"][::std::mem::size_of::<PartitionCmd>() - 32usize];
    ["Alignment of PartitionCmd"][::std::mem::align_of::<PartitionCmd>() - 8usize];
    ["Offset of field: PartitionCmd::type_"][::std::mem::offset_of!(PartitionCmd, type_) - 0usize];
    ["Offset of field: PartitionCmd::name"][::std::mem::offset_of!(PartitionCmd, name) - 8usize];
    ["Offset of field: PartitionCmd::bound"][::std::mem::offset_of!(PartitionCmd, bound) - 16usize];
    ["Offset of field: PartitionCmd::concurrent"]
        [::std::mem::offset_of!(PartitionCmd, concurrent) - 24usize];
};
pub const RTEKind_RTE_RELATION: RTEKind = 0;
pub const RTEKind_RTE_SUBQUERY: RTEKind = 1;
pub const RTEKind_RTE_JOIN: RTEKind = 2;
pub const RTEKind_RTE_FUNCTION: RTEKind = 3;
pub const RTEKind_RTE_TABLEFUNC: RTEKind = 4;
pub const RTEKind_RTE_VALUES: RTEKind = 5;
pub const RTEKind_RTE_CTE: RTEKind = 6;
pub const RTEKind_RTE_NAMEDTUPLESTORE: RTEKind = 7;
pub const RTEKind_RTE_RESULT: RTEKind = 8;
pub const RTEKind_RTE_GROUP: RTEKind = 9;
pub type RTEKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTblEntry {
    pub type_: NodeTag,
    pub alias: *mut Alias,
    pub eref: *mut Alias,
    pub rtekind: RTEKind,
    pub relid: Oid,
    pub inh: bool,
    pub relkind: ::std::os::raw::c_char,
    pub rellockmode: ::std::os::raw::c_int,
    pub perminfoindex: Index,
    pub tablesample: *mut TableSampleClause,
    pub subquery: *mut Query,
    pub security_barrier: bool,
    pub jointype: JoinType,
    pub joinmergedcols: ::std::os::raw::c_int,
    pub joinaliasvars: *mut List,
    pub joinleftcols: *mut List,
    pub joinrightcols: *mut List,
    pub join_using_alias: *mut Alias,
    pub functions: *mut List,
    pub funcordinality: bool,
    pub tablefunc: *mut TableFunc,
    pub values_lists: *mut List,
    pub ctename: *mut ::std::os::raw::c_char,
    pub ctelevelsup: Index,
    pub self_reference: bool,
    pub coltypes: *mut List,
    pub coltypmods: *mut List,
    pub colcollations: *mut List,
    pub enrname: *mut ::std::os::raw::c_char,
    pub enrtuples: Cardinality,
    pub groupexprs: *mut List,
    pub lateral: bool,
    pub inFromCl: bool,
    pub securityQuals: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTblEntry"][::std::mem::size_of::<RangeTblEntry>() - 224usize];
    ["Alignment of RangeTblEntry"][::std::mem::align_of::<RangeTblEntry>() - 8usize];
    ["Offset of field: RangeTblEntry::type_"]
        [::std::mem::offset_of!(RangeTblEntry, type_) - 0usize];
    ["Offset of field: RangeTblEntry::alias"]
        [::std::mem::offset_of!(RangeTblEntry, alias) - 8usize];
    ["Offset of field: RangeTblEntry::eref"][::std::mem::offset_of!(RangeTblEntry, eref) - 16usize];
    ["Offset of field: RangeTblEntry::rtekind"]
        [::std::mem::offset_of!(RangeTblEntry, rtekind) - 24usize];
    ["Offset of field: RangeTblEntry::relid"]
        [::std::mem::offset_of!(RangeTblEntry, relid) - 28usize];
    ["Offset of field: RangeTblEntry::inh"][::std::mem::offset_of!(RangeTblEntry, inh) - 32usize];
    ["Offset of field: RangeTblEntry::relkind"]
        [::std::mem::offset_of!(RangeTblEntry, relkind) - 33usize];
    ["Offset of field: RangeTblEntry::rellockmode"]
        [::std::mem::offset_of!(RangeTblEntry, rellockmode) - 36usize];
    ["Offset of field: RangeTblEntry::perminfoindex"]
        [::std::mem::offset_of!(RangeTblEntry, perminfoindex) - 40usize];
    ["Offset of field: RangeTblEntry::tablesample"]
        [::std::mem::offset_of!(RangeTblEntry, tablesample) - 48usize];
    ["Offset of field: RangeTblEntry::subquery"]
        [::std::mem::offset_of!(RangeTblEntry, subquery) - 56usize];
    ["Offset of field: RangeTblEntry::security_barrier"]
        [::std::mem::offset_of!(RangeTblEntry, security_barrier) - 64usize];
    ["Offset of field: RangeTblEntry::jointype"]
        [::std::mem::offset_of!(RangeTblEntry, jointype) - 68usize];
    ["Offset of field: RangeTblEntry::joinmergedcols"]
        [::std::mem::offset_of!(RangeTblEntry, joinmergedcols) - 72usize];
    ["Offset of field: RangeTblEntry::joinaliasvars"]
        [::std::mem::offset_of!(RangeTblEntry, joinaliasvars) - 80usize];
    ["Offset of field: RangeTblEntry::joinleftcols"]
        [::std::mem::offset_of!(RangeTblEntry, joinleftcols) - 88usize];
    ["Offset of field: RangeTblEntry::joinrightcols"]
        [::std::mem::offset_of!(RangeTblEntry, joinrightcols) - 96usize];
    ["Offset of field: RangeTblEntry::join_using_alias"]
        [::std::mem::offset_of!(RangeTblEntry, join_using_alias) - 104usize];
    ["Offset of field: RangeTblEntry::functions"]
        [::std::mem::offset_of!(RangeTblEntry, functions) - 112usize];
    ["Offset of field: RangeTblEntry::funcordinality"]
        [::std::mem::offset_of!(RangeTblEntry, funcordinality) - 120usize];
    ["Offset of field: RangeTblEntry::tablefunc"]
        [::std::mem::offset_of!(RangeTblEntry, tablefunc) - 128usize];
    ["Offset of field: RangeTblEntry::values_lists"]
        [::std::mem::offset_of!(RangeTblEntry, values_lists) - 136usize];
    ["Offset of field: RangeTblEntry::ctename"]
        [::std::mem::offset_of!(RangeTblEntry, ctename) - 144usize];
    ["Offset of field: RangeTblEntry::ctelevelsup"]
        [::std::mem::offset_of!(RangeTblEntry, ctelevelsup) - 152usize];
    ["Offset of field: RangeTblEntry::self_reference"]
        [::std::mem::offset_of!(RangeTblEntry, self_reference) - 156usize];
    ["Offset of field: RangeTblEntry::coltypes"]
        [::std::mem::offset_of!(RangeTblEntry, coltypes) - 160usize];
    ["Offset of field: RangeTblEntry::coltypmods"]
        [::std::mem::offset_of!(RangeTblEntry, coltypmods) - 168usize];
    ["Offset of field: RangeTblEntry::colcollations"]
        [::std::mem::offset_of!(RangeTblEntry, colcollations) - 176usize];
    ["Offset of field: RangeTblEntry::enrname"]
        [::std::mem::offset_of!(RangeTblEntry, enrname) - 184usize];
    ["Offset of field: RangeTblEntry::enrtuples"]
        [::std::mem::offset_of!(RangeTblEntry, enrtuples) - 192usize];
    ["Offset of field: RangeTblEntry::groupexprs"]
        [::std::mem::offset_of!(RangeTblEntry, groupexprs) - 200usize];
    ["Offset of field: RangeTblEntry::lateral"]
        [::std::mem::offset_of!(RangeTblEntry, lateral) - 208usize];
    ["Offset of field: RangeTblEntry::inFromCl"]
        [::std::mem::offset_of!(RangeTblEntry, inFromCl) - 209usize];
    ["Offset of field: RangeTblEntry::securityQuals"]
        [::std::mem::offset_of!(RangeTblEntry, securityQuals) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTEPermissionInfo {
    pub type_: NodeTag,
    pub relid: Oid,
    pub inh: bool,
    pub requiredPerms: AclMode,
    pub checkAsUser: Oid,
    pub selectedCols: *mut Bitmapset,
    pub insertedCols: *mut Bitmapset,
    pub updatedCols: *mut Bitmapset,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RTEPermissionInfo"][::std::mem::size_of::<RTEPermissionInfo>() - 56usize];
    ["Alignment of RTEPermissionInfo"][::std::mem::align_of::<RTEPermissionInfo>() - 8usize];
    ["Offset of field: RTEPermissionInfo::type_"]
        [::std::mem::offset_of!(RTEPermissionInfo, type_) - 0usize];
    ["Offset of field: RTEPermissionInfo::relid"]
        [::std::mem::offset_of!(RTEPermissionInfo, relid) - 4usize];
    ["Offset of field: RTEPermissionInfo::inh"]
        [::std::mem::offset_of!(RTEPermissionInfo, inh) - 8usize];
    ["Offset of field: RTEPermissionInfo::requiredPerms"]
        [::std::mem::offset_of!(RTEPermissionInfo, requiredPerms) - 16usize];
    ["Offset of field: RTEPermissionInfo::checkAsUser"]
        [::std::mem::offset_of!(RTEPermissionInfo, checkAsUser) - 24usize];
    ["Offset of field: RTEPermissionInfo::selectedCols"]
        [::std::mem::offset_of!(RTEPermissionInfo, selectedCols) - 32usize];
    ["Offset of field: RTEPermissionInfo::insertedCols"]
        [::std::mem::offset_of!(RTEPermissionInfo, insertedCols) - 40usize];
    ["Offset of field: RTEPermissionInfo::updatedCols"]
        [::std::mem::offset_of!(RTEPermissionInfo, updatedCols) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RangeTblFunction {
    pub type_: NodeTag,
    pub funcexpr: *mut Node,
    pub funccolcount: ::std::os::raw::c_int,
    pub funccolnames: *mut List,
    pub funccoltypes: *mut List,
    pub funccoltypmods: *mut List,
    pub funccolcollations: *mut List,
    pub funcparams: *mut Bitmapset,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RangeTblFunction"][::std::mem::size_of::<RangeTblFunction>() - 64usize];
    ["Alignment of RangeTblFunction"][::std::mem::align_of::<RangeTblFunction>() - 8usize];
    ["Offset of field: RangeTblFunction::type_"]
        [::std::mem::offset_of!(RangeTblFunction, type_) - 0usize];
    ["Offset of field: RangeTblFunction::funcexpr"]
        [::std::mem::offset_of!(RangeTblFunction, funcexpr) - 8usize];
    ["Offset of field: RangeTblFunction::funccolcount"]
        [::std::mem::offset_of!(RangeTblFunction, funccolcount) - 16usize];
    ["Offset of field: RangeTblFunction::funccolnames"]
        [::std::mem::offset_of!(RangeTblFunction, funccolnames) - 24usize];
    ["Offset of field: RangeTblFunction::funccoltypes"]
        [::std::mem::offset_of!(RangeTblFunction, funccoltypes) - 32usize];
    ["Offset of field: RangeTblFunction::funccoltypmods"]
        [::std::mem::offset_of!(RangeTblFunction, funccoltypmods) - 40usize];
    ["Offset of field: RangeTblFunction::funccolcollations"]
        [::std::mem::offset_of!(RangeTblFunction, funccolcollations) - 48usize];
    ["Offset of field: RangeTblFunction::funcparams"]
        [::std::mem::offset_of!(RangeTblFunction, funcparams) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableSampleClause {
    pub type_: NodeTag,
    pub tsmhandler: Oid,
    pub args: *mut List,
    pub repeatable: *mut Expr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TableSampleClause"][::std::mem::size_of::<TableSampleClause>() - 24usize];
    ["Alignment of TableSampleClause"][::std::mem::align_of::<TableSampleClause>() - 8usize];
    ["Offset of field: TableSampleClause::type_"]
        [::std::mem::offset_of!(TableSampleClause, type_) - 0usize];
    ["Offset of field: TableSampleClause::tsmhandler"]
        [::std::mem::offset_of!(TableSampleClause, tsmhandler) - 4usize];
    ["Offset of field: TableSampleClause::args"]
        [::std::mem::offset_of!(TableSampleClause, args) - 8usize];
    ["Offset of field: TableSampleClause::repeatable"]
        [::std::mem::offset_of!(TableSampleClause, repeatable) - 16usize];
};
pub const WCOKind_WCO_VIEW_CHECK: WCOKind = 0;
pub const WCOKind_WCO_RLS_INSERT_CHECK: WCOKind = 1;
pub const WCOKind_WCO_RLS_UPDATE_CHECK: WCOKind = 2;
pub const WCOKind_WCO_RLS_CONFLICT_CHECK: WCOKind = 3;
pub const WCOKind_WCO_RLS_MERGE_UPDATE_CHECK: WCOKind = 4;
pub const WCOKind_WCO_RLS_MERGE_DELETE_CHECK: WCOKind = 5;
pub type WCOKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WithCheckOption {
    pub type_: NodeTag,
    pub kind: WCOKind,
    pub relname: *mut ::std::os::raw::c_char,
    pub polname: *mut ::std::os::raw::c_char,
    pub qual: *mut Node,
    pub cascaded: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WithCheckOption"][::std::mem::size_of::<WithCheckOption>() - 40usize];
    ["Alignment of WithCheckOption"][::std::mem::align_of::<WithCheckOption>() - 8usize];
    ["Offset of field: WithCheckOption::type_"]
        [::std::mem::offset_of!(WithCheckOption, type_) - 0usize];
    ["Offset of field: WithCheckOption::kind"]
        [::std::mem::offset_of!(WithCheckOption, kind) - 4usize];
    ["Offset of field: WithCheckOption::relname"]
        [::std::mem::offset_of!(WithCheckOption, relname) - 8usize];
    ["Offset of field: WithCheckOption::polname"]
        [::std::mem::offset_of!(WithCheckOption, polname) - 16usize];
    ["Offset of field: WithCheckOption::qual"]
        [::std::mem::offset_of!(WithCheckOption, qual) - 24usize];
    ["Offset of field: WithCheckOption::cascaded"]
        [::std::mem::offset_of!(WithCheckOption, cascaded) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SortGroupClause {
    pub type_: NodeTag,
    pub tleSortGroupRef: Index,
    pub eqop: Oid,
    pub sortop: Oid,
    pub reverse_sort: bool,
    pub nulls_first: bool,
    pub hashable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SortGroupClause"][::std::mem::size_of::<SortGroupClause>() - 20usize];
    ["Alignment of SortGroupClause"][::std::mem::align_of::<SortGroupClause>() - 4usize];
    ["Offset of field: SortGroupClause::type_"]
        [::std::mem::offset_of!(SortGroupClause, type_) - 0usize];
    ["Offset of field: SortGroupClause::tleSortGroupRef"]
        [::std::mem::offset_of!(SortGroupClause, tleSortGroupRef) - 4usize];
    ["Offset of field: SortGroupClause::eqop"]
        [::std::mem::offset_of!(SortGroupClause, eqop) - 8usize];
    ["Offset of field: SortGroupClause::sortop"]
        [::std::mem::offset_of!(SortGroupClause, sortop) - 12usize];
    ["Offset of field: SortGroupClause::reverse_sort"]
        [::std::mem::offset_of!(SortGroupClause, reverse_sort) - 16usize];
    ["Offset of field: SortGroupClause::nulls_first"]
        [::std::mem::offset_of!(SortGroupClause, nulls_first) - 17usize];
    ["Offset of field: SortGroupClause::hashable"]
        [::std::mem::offset_of!(SortGroupClause, hashable) - 18usize];
};
pub const GroupingSetKind_GROUPING_SET_EMPTY: GroupingSetKind = 0;
pub const GroupingSetKind_GROUPING_SET_SIMPLE: GroupingSetKind = 1;
pub const GroupingSetKind_GROUPING_SET_ROLLUP: GroupingSetKind = 2;
pub const GroupingSetKind_GROUPING_SET_CUBE: GroupingSetKind = 3;
pub const GroupingSetKind_GROUPING_SET_SETS: GroupingSetKind = 4;
pub type GroupingSetKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GroupingSet {
    pub type_: NodeTag,
    pub kind: GroupingSetKind,
    pub content: *mut List,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GroupingSet"][::std::mem::size_of::<GroupingSet>() - 24usize];
    ["Alignment of GroupingSet"][::std::mem::align_of::<GroupingSet>() - 8usize];
    ["Offset of field: GroupingSet::type_"][::std::mem::offset_of!(GroupingSet, type_) - 0usize];
    ["Offset of field: GroupingSet::kind"][::std::mem::offset_of!(GroupingSet, kind) - 4usize];
    ["Offset of field: GroupingSet::content"]
        [::std::mem::offset_of!(GroupingSet, content) - 8usize];
    ["Offset of field: GroupingSet::location"]
        [::std::mem::offset_of!(GroupingSet, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WindowClause {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub refname: *mut ::std::os::raw::c_char,
    pub partitionClause: *mut List,
    pub orderClause: *mut List,
    pub frameOptions: ::std::os::raw::c_int,
    pub startOffset: *mut Node,
    pub endOffset: *mut Node,
    pub startInRangeFunc: Oid,
    pub endInRangeFunc: Oid,
    pub inRangeColl: Oid,
    pub inRangeAsc: bool,
    pub inRangeNullsFirst: bool,
    pub winref: Index,
    pub copiedOrder: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WindowClause"][::std::mem::size_of::<WindowClause>() - 88usize];
    ["Alignment of WindowClause"][::std::mem::align_of::<WindowClause>() - 8usize];
    ["Offset of field: WindowClause::type_"][::std::mem::offset_of!(WindowClause, type_) - 0usize];
    ["Offset of field: WindowClause::name"][::std::mem::offset_of!(WindowClause, name) - 8usize];
    ["Offset of field: WindowClause::refname"]
        [::std::mem::offset_of!(WindowClause, refname) - 16usize];
    ["Offset of field: WindowClause::partitionClause"]
        [::std::mem::offset_of!(WindowClause, partitionClause) - 24usize];
    ["Offset of field: WindowClause::orderClause"]
        [::std::mem::offset_of!(WindowClause, orderClause) - 32usize];
    ["Offset of field: WindowClause::frameOptions"]
        [::std::mem::offset_of!(WindowClause, frameOptions) - 40usize];
    ["Offset of field: WindowClause::startOffset"]
        [::std::mem::offset_of!(WindowClause, startOffset) - 48usize];
    ["Offset of field: WindowClause::endOffset"]
        [::std::mem::offset_of!(WindowClause, endOffset) - 56usize];
    ["Offset of field: WindowClause::startInRangeFunc"]
        [::std::mem::offset_of!(WindowClause, startInRangeFunc) - 64usize];
    ["Offset of field: WindowClause::endInRangeFunc"]
        [::std::mem::offset_of!(WindowClause, endInRangeFunc) - 68usize];
    ["Offset of field: WindowClause::inRangeColl"]
        [::std::mem::offset_of!(WindowClause, inRangeColl) - 72usize];
    ["Offset of field: WindowClause::inRangeAsc"]
        [::std::mem::offset_of!(WindowClause, inRangeAsc) - 76usize];
    ["Offset of field: WindowClause::inRangeNullsFirst"]
        [::std::mem::offset_of!(WindowClause, inRangeNullsFirst) - 77usize];
    ["Offset of field: WindowClause::winref"]
        [::std::mem::offset_of!(WindowClause, winref) - 80usize];
    ["Offset of field: WindowClause::copiedOrder"]
        [::std::mem::offset_of!(WindowClause, copiedOrder) - 84usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RowMarkClause {
    pub type_: NodeTag,
    pub rti: Index,
    pub strength: LockClauseStrength,
    pub waitPolicy: LockWaitPolicy,
    pub pushedDown: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RowMarkClause"][::std::mem::size_of::<RowMarkClause>() - 20usize];
    ["Alignment of RowMarkClause"][::std::mem::align_of::<RowMarkClause>() - 4usize];
    ["Offset of field: RowMarkClause::type_"]
        [::std::mem::offset_of!(RowMarkClause, type_) - 0usize];
    ["Offset of field: RowMarkClause::rti"][::std::mem::offset_of!(RowMarkClause, rti) - 4usize];
    ["Offset of field: RowMarkClause::strength"]
        [::std::mem::offset_of!(RowMarkClause, strength) - 8usize];
    ["Offset of field: RowMarkClause::waitPolicy"]
        [::std::mem::offset_of!(RowMarkClause, waitPolicy) - 12usize];
    ["Offset of field: RowMarkClause::pushedDown"]
        [::std::mem::offset_of!(RowMarkClause, pushedDown) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WithClause {
    pub type_: NodeTag,
    pub ctes: *mut List,
    pub recursive: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WithClause"][::std::mem::size_of::<WithClause>() - 24usize];
    ["Alignment of WithClause"][::std::mem::align_of::<WithClause>() - 8usize];
    ["Offset of field: WithClause::type_"][::std::mem::offset_of!(WithClause, type_) - 0usize];
    ["Offset of field: WithClause::ctes"][::std::mem::offset_of!(WithClause, ctes) - 8usize];
    ["Offset of field: WithClause::recursive"]
        [::std::mem::offset_of!(WithClause, recursive) - 16usize];
    ["Offset of field: WithClause::location"]
        [::std::mem::offset_of!(WithClause, location) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InferClause {
    pub type_: NodeTag,
    pub indexElems: *mut List,
    pub whereClause: *mut Node,
    pub conname: *mut ::std::os::raw::c_char,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InferClause"][::std::mem::size_of::<InferClause>() - 40usize];
    ["Alignment of InferClause"][::std::mem::align_of::<InferClause>() - 8usize];
    ["Offset of field: InferClause::type_"][::std::mem::offset_of!(InferClause, type_) - 0usize];
    ["Offset of field: InferClause::indexElems"]
        [::std::mem::offset_of!(InferClause, indexElems) - 8usize];
    ["Offset of field: InferClause::whereClause"]
        [::std::mem::offset_of!(InferClause, whereClause) - 16usize];
    ["Offset of field: InferClause::conname"]
        [::std::mem::offset_of!(InferClause, conname) - 24usize];
    ["Offset of field: InferClause::location"]
        [::std::mem::offset_of!(InferClause, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OnConflictClause {
    pub type_: NodeTag,
    pub action: OnConflictAction,
    pub infer: *mut InferClause,
    pub targetList: *mut List,
    pub whereClause: *mut Node,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OnConflictClause"][::std::mem::size_of::<OnConflictClause>() - 40usize];
    ["Alignment of OnConflictClause"][::std::mem::align_of::<OnConflictClause>() - 8usize];
    ["Offset of field: OnConflictClause::type_"]
        [::std::mem::offset_of!(OnConflictClause, type_) - 0usize];
    ["Offset of field: OnConflictClause::action"]
        [::std::mem::offset_of!(OnConflictClause, action) - 4usize];
    ["Offset of field: OnConflictClause::infer"]
        [::std::mem::offset_of!(OnConflictClause, infer) - 8usize];
    ["Offset of field: OnConflictClause::targetList"]
        [::std::mem::offset_of!(OnConflictClause, targetList) - 16usize];
    ["Offset of field: OnConflictClause::whereClause"]
        [::std::mem::offset_of!(OnConflictClause, whereClause) - 24usize];
    ["Offset of field: OnConflictClause::location"]
        [::std::mem::offset_of!(OnConflictClause, location) - 32usize];
};
pub const CTEMaterialize_CTEMaterializeDefault: CTEMaterialize = 0;
pub const CTEMaterialize_CTEMaterializeAlways: CTEMaterialize = 1;
pub const CTEMaterialize_CTEMaterializeNever: CTEMaterialize = 2;
pub type CTEMaterialize = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CTESearchClause {
    pub type_: NodeTag,
    pub search_col_list: *mut List,
    pub search_breadth_first: bool,
    pub search_seq_column: *mut ::std::os::raw::c_char,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CTESearchClause"][::std::mem::size_of::<CTESearchClause>() - 40usize];
    ["Alignment of CTESearchClause"][::std::mem::align_of::<CTESearchClause>() - 8usize];
    ["Offset of field: CTESearchClause::type_"]
        [::std::mem::offset_of!(CTESearchClause, type_) - 0usize];
    ["Offset of field: CTESearchClause::search_col_list"]
        [::std::mem::offset_of!(CTESearchClause, search_col_list) - 8usize];
    ["Offset of field: CTESearchClause::search_breadth_first"]
        [::std::mem::offset_of!(CTESearchClause, search_breadth_first) - 16usize];
    ["Offset of field: CTESearchClause::search_seq_column"]
        [::std::mem::offset_of!(CTESearchClause, search_seq_column) - 24usize];
    ["Offset of field: CTESearchClause::location"]
        [::std::mem::offset_of!(CTESearchClause, location) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CTECycleClause {
    pub type_: NodeTag,
    pub cycle_col_list: *mut List,
    pub cycle_mark_column: *mut ::std::os::raw::c_char,
    pub cycle_mark_value: *mut Node,
    pub cycle_mark_default: *mut Node,
    pub cycle_path_column: *mut ::std::os::raw::c_char,
    pub location: ParseLoc,
    pub cycle_mark_type: Oid,
    pub cycle_mark_typmod: ::std::os::raw::c_int,
    pub cycle_mark_collation: Oid,
    pub cycle_mark_neop: Oid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CTECycleClause"][::std::mem::size_of::<CTECycleClause>() - 72usize];
    ["Alignment of CTECycleClause"][::std::mem::align_of::<CTECycleClause>() - 8usize];
    ["Offset of field: CTECycleClause::type_"]
        [::std::mem::offset_of!(CTECycleClause, type_) - 0usize];
    ["Offset of field: CTECycleClause::cycle_col_list"]
        [::std::mem::offset_of!(CTECycleClause, cycle_col_list) - 8usize];
    ["Offset of field: CTECycleClause::cycle_mark_column"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_column) - 16usize];
    ["Offset of field: CTECycleClause::cycle_mark_value"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_value) - 24usize];
    ["Offset of field: CTECycleClause::cycle_mark_default"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_default) - 32usize];
    ["Offset of field: CTECycleClause::cycle_path_column"]
        [::std::mem::offset_of!(CTECycleClause, cycle_path_column) - 40usize];
    ["Offset of field: CTECycleClause::location"]
        [::std::mem::offset_of!(CTECycleClause, location) - 48usize];
    ["Offset of field: CTECycleClause::cycle_mark_type"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_type) - 52usize];
    ["Offset of field: CTECycleClause::cycle_mark_typmod"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_typmod) - 56usize];
    ["Offset of field: CTECycleClause::cycle_mark_collation"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_collation) - 60usize];
    ["Offset of field: CTECycleClause::cycle_mark_neop"]
        [::std::mem::offset_of!(CTECycleClause, cycle_mark_neop) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CommonTableExpr {
    pub type_: NodeTag,
    pub ctename: *mut ::std::os::raw::c_char,
    pub aliascolnames: *mut List,
    pub ctematerialized: CTEMaterialize,
    pub ctequery: *mut Node,
    pub search_clause: *mut CTESearchClause,
    pub cycle_clause: *mut CTECycleClause,
    pub location: ParseLoc,
    pub cterecursive: bool,
    pub cterefcount: ::std::os::raw::c_int,
    pub ctecolnames: *mut List,
    pub ctecoltypes: *mut List,
    pub ctecoltypmods: *mut List,
    pub ctecolcollations: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CommonTableExpr"][::std::mem::size_of::<CommonTableExpr>() - 104usize];
    ["Alignment of CommonTableExpr"][::std::mem::align_of::<CommonTableExpr>() - 8usize];
    ["Offset of field: CommonTableExpr::type_"]
        [::std::mem::offset_of!(CommonTableExpr, type_) - 0usize];
    ["Offset of field: CommonTableExpr::ctename"]
        [::std::mem::offset_of!(CommonTableExpr, ctename) - 8usize];
    ["Offset of field: CommonTableExpr::aliascolnames"]
        [::std::mem::offset_of!(CommonTableExpr, aliascolnames) - 16usize];
    ["Offset of field: CommonTableExpr::ctematerialized"]
        [::std::mem::offset_of!(CommonTableExpr, ctematerialized) - 24usize];
    ["Offset of field: CommonTableExpr::ctequery"]
        [::std::mem::offset_of!(CommonTableExpr, ctequery) - 32usize];
    ["Offset of field: CommonTableExpr::search_clause"]
        [::std::mem::offset_of!(CommonTableExpr, search_clause) - 40usize];
    ["Offset of field: CommonTableExpr::cycle_clause"]
        [::std::mem::offset_of!(CommonTableExpr, cycle_clause) - 48usize];
    ["Offset of field: CommonTableExpr::location"]
        [::std::mem::offset_of!(CommonTableExpr, location) - 56usize];
    ["Offset of field: CommonTableExpr::cterecursive"]
        [::std::mem::offset_of!(CommonTableExpr, cterecursive) - 60usize];
    ["Offset of field: CommonTableExpr::cterefcount"]
        [::std::mem::offset_of!(CommonTableExpr, cterefcount) - 64usize];
    ["Offset of field: CommonTableExpr::ctecolnames"]
        [::std::mem::offset_of!(CommonTableExpr, ctecolnames) - 72usize];
    ["Offset of field: CommonTableExpr::ctecoltypes"]
        [::std::mem::offset_of!(CommonTableExpr, ctecoltypes) - 80usize];
    ["Offset of field: CommonTableExpr::ctecoltypmods"]
        [::std::mem::offset_of!(CommonTableExpr, ctecoltypmods) - 88usize];
    ["Offset of field: CommonTableExpr::ctecolcollations"]
        [::std::mem::offset_of!(CommonTableExpr, ctecolcollations) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MergeWhenClause {
    pub type_: NodeTag,
    pub matchKind: MergeMatchKind,
    pub commandType: CmdType,
    pub override_: OverridingKind,
    pub condition: *mut Node,
    pub targetList: *mut List,
    pub values: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MergeWhenClause"][::std::mem::size_of::<MergeWhenClause>() - 40usize];
    ["Alignment of MergeWhenClause"][::std::mem::align_of::<MergeWhenClause>() - 8usize];
    ["Offset of field: MergeWhenClause::type_"]
        [::std::mem::offset_of!(MergeWhenClause, type_) - 0usize];
    ["Offset of field: MergeWhenClause::matchKind"]
        [::std::mem::offset_of!(MergeWhenClause, matchKind) - 4usize];
    ["Offset of field: MergeWhenClause::commandType"]
        [::std::mem::offset_of!(MergeWhenClause, commandType) - 8usize];
    ["Offset of field: MergeWhenClause::override_"]
        [::std::mem::offset_of!(MergeWhenClause, override_) - 12usize];
    ["Offset of field: MergeWhenClause::condition"]
        [::std::mem::offset_of!(MergeWhenClause, condition) - 16usize];
    ["Offset of field: MergeWhenClause::targetList"]
        [::std::mem::offset_of!(MergeWhenClause, targetList) - 24usize];
    ["Offset of field: MergeWhenClause::values"]
        [::std::mem::offset_of!(MergeWhenClause, values) - 32usize];
};
pub const ReturningOptionKind_RETURNING_OPTION_OLD: ReturningOptionKind = 0;
pub const ReturningOptionKind_RETURNING_OPTION_NEW: ReturningOptionKind = 1;
pub type ReturningOptionKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReturningOption {
    pub type_: NodeTag,
    pub option: ReturningOptionKind,
    pub value: *mut ::std::os::raw::c_char,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReturningOption"][::std::mem::size_of::<ReturningOption>() - 24usize];
    ["Alignment of ReturningOption"][::std::mem::align_of::<ReturningOption>() - 8usize];
    ["Offset of field: ReturningOption::type_"]
        [::std::mem::offset_of!(ReturningOption, type_) - 0usize];
    ["Offset of field: ReturningOption::option"]
        [::std::mem::offset_of!(ReturningOption, option) - 4usize];
    ["Offset of field: ReturningOption::value"]
        [::std::mem::offset_of!(ReturningOption, value) - 8usize];
    ["Offset of field: ReturningOption::location"]
        [::std::mem::offset_of!(ReturningOption, location) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReturningClause {
    pub type_: NodeTag,
    pub options: *mut List,
    pub exprs: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReturningClause"][::std::mem::size_of::<ReturningClause>() - 24usize];
    ["Alignment of ReturningClause"][::std::mem::align_of::<ReturningClause>() - 8usize];
    ["Offset of field: ReturningClause::type_"]
        [::std::mem::offset_of!(ReturningClause, type_) - 0usize];
    ["Offset of field: ReturningClause::options"]
        [::std::mem::offset_of!(ReturningClause, options) - 8usize];
    ["Offset of field: ReturningClause::exprs"]
        [::std::mem::offset_of!(ReturningClause, exprs) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TriggerTransition {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub isNew: bool,
    pub isTable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TriggerTransition"][::std::mem::size_of::<TriggerTransition>() - 24usize];
    ["Alignment of TriggerTransition"][::std::mem::align_of::<TriggerTransition>() - 8usize];
    ["Offset of field: TriggerTransition::type_"]
        [::std::mem::offset_of!(TriggerTransition, type_) - 0usize];
    ["Offset of field: TriggerTransition::name"]
        [::std::mem::offset_of!(TriggerTransition, name) - 8usize];
    ["Offset of field: TriggerTransition::isNew"]
        [::std::mem::offset_of!(TriggerTransition, isNew) - 16usize];
    ["Offset of field: TriggerTransition::isTable"]
        [::std::mem::offset_of!(TriggerTransition, isTable) - 17usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonOutput {
    pub type_: NodeTag,
    pub typeName: *mut TypeName,
    pub returning: *mut JsonReturning,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonOutput"][::std::mem::size_of::<JsonOutput>() - 24usize];
    ["Alignment of JsonOutput"][::std::mem::align_of::<JsonOutput>() - 8usize];
    ["Offset of field: JsonOutput::type_"][::std::mem::offset_of!(JsonOutput, type_) - 0usize];
    ["Offset of field: JsonOutput::typeName"]
        [::std::mem::offset_of!(JsonOutput, typeName) - 8usize];
    ["Offset of field: JsonOutput::returning"]
        [::std::mem::offset_of!(JsonOutput, returning) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonArgument {
    pub type_: NodeTag,
    pub val: *mut JsonValueExpr,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonArgument"][::std::mem::size_of::<JsonArgument>() - 24usize];
    ["Alignment of JsonArgument"][::std::mem::align_of::<JsonArgument>() - 8usize];
    ["Offset of field: JsonArgument::type_"][::std::mem::offset_of!(JsonArgument, type_) - 0usize];
    ["Offset of field: JsonArgument::val"][::std::mem::offset_of!(JsonArgument, val) - 8usize];
    ["Offset of field: JsonArgument::name"][::std::mem::offset_of!(JsonArgument, name) - 16usize];
};
pub const JsonQuotes_JS_QUOTES_UNSPEC: JsonQuotes = 0;
pub const JsonQuotes_JS_QUOTES_KEEP: JsonQuotes = 1;
pub const JsonQuotes_JS_QUOTES_OMIT: JsonQuotes = 2;
pub type JsonQuotes = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonFuncExpr {
    pub type_: NodeTag,
    pub op: JsonExprOp,
    pub column_name: *mut ::std::os::raw::c_char,
    pub context_item: *mut JsonValueExpr,
    pub pathspec: *mut Node,
    pub passing: *mut List,
    pub output: *mut JsonOutput,
    pub on_empty: *mut JsonBehavior,
    pub on_error: *mut JsonBehavior,
    pub wrapper: JsonWrapper,
    pub quotes: JsonQuotes,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonFuncExpr"][::std::mem::size_of::<JsonFuncExpr>() - 80usize];
    ["Alignment of JsonFuncExpr"][::std::mem::align_of::<JsonFuncExpr>() - 8usize];
    ["Offset of field: JsonFuncExpr::type_"][::std::mem::offset_of!(JsonFuncExpr, type_) - 0usize];
    ["Offset of field: JsonFuncExpr::op"][::std::mem::offset_of!(JsonFuncExpr, op) - 4usize];
    ["Offset of field: JsonFuncExpr::column_name"]
        [::std::mem::offset_of!(JsonFuncExpr, column_name) - 8usize];
    ["Offset of field: JsonFuncExpr::context_item"]
        [::std::mem::offset_of!(JsonFuncExpr, context_item) - 16usize];
    ["Offset of field: JsonFuncExpr::pathspec"]
        [::std::mem::offset_of!(JsonFuncExpr, pathspec) - 24usize];
    ["Offset of field: JsonFuncExpr::passing"]
        [::std::mem::offset_of!(JsonFuncExpr, passing) - 32usize];
    ["Offset of field: JsonFuncExpr::output"]
        [::std::mem::offset_of!(JsonFuncExpr, output) - 40usize];
    ["Offset of field: JsonFuncExpr::on_empty"]
        [::std::mem::offset_of!(JsonFuncExpr, on_empty) - 48usize];
    ["Offset of field: JsonFuncExpr::on_error"]
        [::std::mem::offset_of!(JsonFuncExpr, on_error) - 56usize];
    ["Offset of field: JsonFuncExpr::wrapper"]
        [::std::mem::offset_of!(JsonFuncExpr, wrapper) - 64usize];
    ["Offset of field: JsonFuncExpr::quotes"]
        [::std::mem::offset_of!(JsonFuncExpr, quotes) - 68usize];
    ["Offset of field: JsonFuncExpr::location"]
        [::std::mem::offset_of!(JsonFuncExpr, location) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTablePathSpec {
    pub type_: NodeTag,
    pub string: *mut Node,
    pub name: *mut ::std::os::raw::c_char,
    pub name_location: ParseLoc,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTablePathSpec"][::std::mem::size_of::<JsonTablePathSpec>() - 32usize];
    ["Alignment of JsonTablePathSpec"][::std::mem::align_of::<JsonTablePathSpec>() - 8usize];
    ["Offset of field: JsonTablePathSpec::type_"]
        [::std::mem::offset_of!(JsonTablePathSpec, type_) - 0usize];
    ["Offset of field: JsonTablePathSpec::string"]
        [::std::mem::offset_of!(JsonTablePathSpec, string) - 8usize];
    ["Offset of field: JsonTablePathSpec::name"]
        [::std::mem::offset_of!(JsonTablePathSpec, name) - 16usize];
    ["Offset of field: JsonTablePathSpec::name_location"]
        [::std::mem::offset_of!(JsonTablePathSpec, name_location) - 24usize];
    ["Offset of field: JsonTablePathSpec::location"]
        [::std::mem::offset_of!(JsonTablePathSpec, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTable {
    pub type_: NodeTag,
    pub context_item: *mut JsonValueExpr,
    pub pathspec: *mut JsonTablePathSpec,
    pub passing: *mut List,
    pub columns: *mut List,
    pub on_error: *mut JsonBehavior,
    pub alias: *mut Alias,
    pub lateral: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTable"][::std::mem::size_of::<JsonTable>() - 64usize];
    ["Alignment of JsonTable"][::std::mem::align_of::<JsonTable>() - 8usize];
    ["Offset of field: JsonTable::type_"][::std::mem::offset_of!(JsonTable, type_) - 0usize];
    ["Offset of field: JsonTable::context_item"]
        [::std::mem::offset_of!(JsonTable, context_item) - 8usize];
    ["Offset of field: JsonTable::pathspec"][::std::mem::offset_of!(JsonTable, pathspec) - 16usize];
    ["Offset of field: JsonTable::passing"][::std::mem::offset_of!(JsonTable, passing) - 24usize];
    ["Offset of field: JsonTable::columns"][::std::mem::offset_of!(JsonTable, columns) - 32usize];
    ["Offset of field: JsonTable::on_error"][::std::mem::offset_of!(JsonTable, on_error) - 40usize];
    ["Offset of field: JsonTable::alias"][::std::mem::offset_of!(JsonTable, alias) - 48usize];
    ["Offset of field: JsonTable::lateral"][::std::mem::offset_of!(JsonTable, lateral) - 56usize];
    ["Offset of field: JsonTable::location"][::std::mem::offset_of!(JsonTable, location) - 60usize];
};
pub const JsonTableColumnType_JTC_FOR_ORDINALITY: JsonTableColumnType = 0;
pub const JsonTableColumnType_JTC_REGULAR: JsonTableColumnType = 1;
pub const JsonTableColumnType_JTC_EXISTS: JsonTableColumnType = 2;
pub const JsonTableColumnType_JTC_FORMATTED: JsonTableColumnType = 3;
pub const JsonTableColumnType_JTC_NESTED: JsonTableColumnType = 4;
pub type JsonTableColumnType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonTableColumn {
    pub type_: NodeTag,
    pub coltype: JsonTableColumnType,
    pub name: *mut ::std::os::raw::c_char,
    pub typeName: *mut TypeName,
    pub pathspec: *mut JsonTablePathSpec,
    pub format: *mut JsonFormat,
    pub wrapper: JsonWrapper,
    pub quotes: JsonQuotes,
    pub columns: *mut List,
    pub on_empty: *mut JsonBehavior,
    pub on_error: *mut JsonBehavior,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonTableColumn"][::std::mem::size_of::<JsonTableColumn>() - 80usize];
    ["Alignment of JsonTableColumn"][::std::mem::align_of::<JsonTableColumn>() - 8usize];
    ["Offset of field: JsonTableColumn::type_"]
        [::std::mem::offset_of!(JsonTableColumn, type_) - 0usize];
    ["Offset of field: JsonTableColumn::coltype"]
        [::std::mem::offset_of!(JsonTableColumn, coltype) - 4usize];
    ["Offset of field: JsonTableColumn::name"]
        [::std::mem::offset_of!(JsonTableColumn, name) - 8usize];
    ["Offset of field: JsonTableColumn::typeName"]
        [::std::mem::offset_of!(JsonTableColumn, typeName) - 16usize];
    ["Offset of field: JsonTableColumn::pathspec"]
        [::std::mem::offset_of!(JsonTableColumn, pathspec) - 24usize];
    ["Offset of field: JsonTableColumn::format"]
        [::std::mem::offset_of!(JsonTableColumn, format) - 32usize];
    ["Offset of field: JsonTableColumn::wrapper"]
        [::std::mem::offset_of!(JsonTableColumn, wrapper) - 40usize];
    ["Offset of field: JsonTableColumn::quotes"]
        [::std::mem::offset_of!(JsonTableColumn, quotes) - 44usize];
    ["Offset of field: JsonTableColumn::columns"]
        [::std::mem::offset_of!(JsonTableColumn, columns) - 48usize];
    ["Offset of field: JsonTableColumn::on_empty"]
        [::std::mem::offset_of!(JsonTableColumn, on_empty) - 56usize];
    ["Offset of field: JsonTableColumn::on_error"]
        [::std::mem::offset_of!(JsonTableColumn, on_error) - 64usize];
    ["Offset of field: JsonTableColumn::location"]
        [::std::mem::offset_of!(JsonTableColumn, location) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonKeyValue {
    pub type_: NodeTag,
    pub key: *mut Expr,
    pub value: *mut JsonValueExpr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonKeyValue"][::std::mem::size_of::<JsonKeyValue>() - 24usize];
    ["Alignment of JsonKeyValue"][::std::mem::align_of::<JsonKeyValue>() - 8usize];
    ["Offset of field: JsonKeyValue::type_"][::std::mem::offset_of!(JsonKeyValue, type_) - 0usize];
    ["Offset of field: JsonKeyValue::key"][::std::mem::offset_of!(JsonKeyValue, key) - 8usize];
    ["Offset of field: JsonKeyValue::value"][::std::mem::offset_of!(JsonKeyValue, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonParseExpr {
    pub type_: NodeTag,
    pub expr: *mut JsonValueExpr,
    pub output: *mut JsonOutput,
    pub unique_keys: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonParseExpr"][::std::mem::size_of::<JsonParseExpr>() - 32usize];
    ["Alignment of JsonParseExpr"][::std::mem::align_of::<JsonParseExpr>() - 8usize];
    ["Offset of field: JsonParseExpr::type_"]
        [::std::mem::offset_of!(JsonParseExpr, type_) - 0usize];
    ["Offset of field: JsonParseExpr::expr"][::std::mem::offset_of!(JsonParseExpr, expr) - 8usize];
    ["Offset of field: JsonParseExpr::output"]
        [::std::mem::offset_of!(JsonParseExpr, output) - 16usize];
    ["Offset of field: JsonParseExpr::unique_keys"]
        [::std::mem::offset_of!(JsonParseExpr, unique_keys) - 24usize];
    ["Offset of field: JsonParseExpr::location"]
        [::std::mem::offset_of!(JsonParseExpr, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonScalarExpr {
    pub type_: NodeTag,
    pub expr: *mut Expr,
    pub output: *mut JsonOutput,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonScalarExpr"][::std::mem::size_of::<JsonScalarExpr>() - 32usize];
    ["Alignment of JsonScalarExpr"][::std::mem::align_of::<JsonScalarExpr>() - 8usize];
    ["Offset of field: JsonScalarExpr::type_"]
        [::std::mem::offset_of!(JsonScalarExpr, type_) - 0usize];
    ["Offset of field: JsonScalarExpr::expr"]
        [::std::mem::offset_of!(JsonScalarExpr, expr) - 8usize];
    ["Offset of field: JsonScalarExpr::output"]
        [::std::mem::offset_of!(JsonScalarExpr, output) - 16usize];
    ["Offset of field: JsonScalarExpr::location"]
        [::std::mem::offset_of!(JsonScalarExpr, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonSerializeExpr {
    pub type_: NodeTag,
    pub expr: *mut JsonValueExpr,
    pub output: *mut JsonOutput,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonSerializeExpr"][::std::mem::size_of::<JsonSerializeExpr>() - 32usize];
    ["Alignment of JsonSerializeExpr"][::std::mem::align_of::<JsonSerializeExpr>() - 8usize];
    ["Offset of field: JsonSerializeExpr::type_"]
        [::std::mem::offset_of!(JsonSerializeExpr, type_) - 0usize];
    ["Offset of field: JsonSerializeExpr::expr"]
        [::std::mem::offset_of!(JsonSerializeExpr, expr) - 8usize];
    ["Offset of field: JsonSerializeExpr::output"]
        [::std::mem::offset_of!(JsonSerializeExpr, output) - 16usize];
    ["Offset of field: JsonSerializeExpr::location"]
        [::std::mem::offset_of!(JsonSerializeExpr, location) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonObjectConstructor {
    pub type_: NodeTag,
    pub exprs: *mut List,
    pub output: *mut JsonOutput,
    pub absent_on_null: bool,
    pub unique: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonObjectConstructor"][::std::mem::size_of::<JsonObjectConstructor>() - 32usize];
    ["Alignment of JsonObjectConstructor"]
        [::std::mem::align_of::<JsonObjectConstructor>() - 8usize];
    ["Offset of field: JsonObjectConstructor::type_"]
        [::std::mem::offset_of!(JsonObjectConstructor, type_) - 0usize];
    ["Offset of field: JsonObjectConstructor::exprs"]
        [::std::mem::offset_of!(JsonObjectConstructor, exprs) - 8usize];
    ["Offset of field: JsonObjectConstructor::output"]
        [::std::mem::offset_of!(JsonObjectConstructor, output) - 16usize];
    ["Offset of field: JsonObjectConstructor::absent_on_null"]
        [::std::mem::offset_of!(JsonObjectConstructor, absent_on_null) - 24usize];
    ["Offset of field: JsonObjectConstructor::unique"]
        [::std::mem::offset_of!(JsonObjectConstructor, unique) - 25usize];
    ["Offset of field: JsonObjectConstructor::location"]
        [::std::mem::offset_of!(JsonObjectConstructor, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonArrayConstructor {
    pub type_: NodeTag,
    pub exprs: *mut List,
    pub output: *mut JsonOutput,
    pub absent_on_null: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonArrayConstructor"][::std::mem::size_of::<JsonArrayConstructor>() - 32usize];
    ["Alignment of JsonArrayConstructor"][::std::mem::align_of::<JsonArrayConstructor>() - 8usize];
    ["Offset of field: JsonArrayConstructor::type_"]
        [::std::mem::offset_of!(JsonArrayConstructor, type_) - 0usize];
    ["Offset of field: JsonArrayConstructor::exprs"]
        [::std::mem::offset_of!(JsonArrayConstructor, exprs) - 8usize];
    ["Offset of field: JsonArrayConstructor::output"]
        [::std::mem::offset_of!(JsonArrayConstructor, output) - 16usize];
    ["Offset of field: JsonArrayConstructor::absent_on_null"]
        [::std::mem::offset_of!(JsonArrayConstructor, absent_on_null) - 24usize];
    ["Offset of field: JsonArrayConstructor::location"]
        [::std::mem::offset_of!(JsonArrayConstructor, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonArrayQueryConstructor {
    pub type_: NodeTag,
    pub query: *mut Node,
    pub output: *mut JsonOutput,
    pub format: *mut JsonFormat,
    pub absent_on_null: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonArrayQueryConstructor"]
        [::std::mem::size_of::<JsonArrayQueryConstructor>() - 40usize];
    ["Alignment of JsonArrayQueryConstructor"]
        [::std::mem::align_of::<JsonArrayQueryConstructor>() - 8usize];
    ["Offset of field: JsonArrayQueryConstructor::type_"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, type_) - 0usize];
    ["Offset of field: JsonArrayQueryConstructor::query"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, query) - 8usize];
    ["Offset of field: JsonArrayQueryConstructor::output"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, output) - 16usize];
    ["Offset of field: JsonArrayQueryConstructor::format"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, format) - 24usize];
    ["Offset of field: JsonArrayQueryConstructor::absent_on_null"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, absent_on_null) - 32usize];
    ["Offset of field: JsonArrayQueryConstructor::location"]
        [::std::mem::offset_of!(JsonArrayQueryConstructor, location) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonAggConstructor {
    pub type_: NodeTag,
    pub output: *mut JsonOutput,
    pub agg_filter: *mut Node,
    pub agg_order: *mut List,
    pub over: *mut WindowDef,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonAggConstructor"][::std::mem::size_of::<JsonAggConstructor>() - 48usize];
    ["Alignment of JsonAggConstructor"][::std::mem::align_of::<JsonAggConstructor>() - 8usize];
    ["Offset of field: JsonAggConstructor::type_"]
        [::std::mem::offset_of!(JsonAggConstructor, type_) - 0usize];
    ["Offset of field: JsonAggConstructor::output"]
        [::std::mem::offset_of!(JsonAggConstructor, output) - 8usize];
    ["Offset of field: JsonAggConstructor::agg_filter"]
        [::std::mem::offset_of!(JsonAggConstructor, agg_filter) - 16usize];
    ["Offset of field: JsonAggConstructor::agg_order"]
        [::std::mem::offset_of!(JsonAggConstructor, agg_order) - 24usize];
    ["Offset of field: JsonAggConstructor::over"]
        [::std::mem::offset_of!(JsonAggConstructor, over) - 32usize];
    ["Offset of field: JsonAggConstructor::location"]
        [::std::mem::offset_of!(JsonAggConstructor, location) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonObjectAgg {
    pub type_: NodeTag,
    pub constructor: *mut JsonAggConstructor,
    pub arg: *mut JsonKeyValue,
    pub absent_on_null: bool,
    pub unique: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonObjectAgg"][::std::mem::size_of::<JsonObjectAgg>() - 32usize];
    ["Alignment of JsonObjectAgg"][::std::mem::align_of::<JsonObjectAgg>() - 8usize];
    ["Offset of field: JsonObjectAgg::type_"]
        [::std::mem::offset_of!(JsonObjectAgg, type_) - 0usize];
    ["Offset of field: JsonObjectAgg::constructor"]
        [::std::mem::offset_of!(JsonObjectAgg, constructor) - 8usize];
    ["Offset of field: JsonObjectAgg::arg"][::std::mem::offset_of!(JsonObjectAgg, arg) - 16usize];
    ["Offset of field: JsonObjectAgg::absent_on_null"]
        [::std::mem::offset_of!(JsonObjectAgg, absent_on_null) - 24usize];
    ["Offset of field: JsonObjectAgg::unique"]
        [::std::mem::offset_of!(JsonObjectAgg, unique) - 25usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JsonArrayAgg {
    pub type_: NodeTag,
    pub constructor: *mut JsonAggConstructor,
    pub arg: *mut JsonValueExpr,
    pub absent_on_null: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of JsonArrayAgg"][::std::mem::size_of::<JsonArrayAgg>() - 32usize];
    ["Alignment of JsonArrayAgg"][::std::mem::align_of::<JsonArrayAgg>() - 8usize];
    ["Offset of field: JsonArrayAgg::type_"][::std::mem::offset_of!(JsonArrayAgg, type_) - 0usize];
    ["Offset of field: JsonArrayAgg::constructor"]
        [::std::mem::offset_of!(JsonArrayAgg, constructor) - 8usize];
    ["Offset of field: JsonArrayAgg::arg"][::std::mem::offset_of!(JsonArrayAgg, arg) - 16usize];
    ["Offset of field: JsonArrayAgg::absent_on_null"]
        [::std::mem::offset_of!(JsonArrayAgg, absent_on_null) - 24usize];
};
#[doc = "\t\tRaw Grammar Output Statements"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RawStmt {
    pub type_: NodeTag,
    pub stmt: *mut Node,
    pub stmt_location: ParseLoc,
    pub stmt_len: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RawStmt"][::std::mem::size_of::<RawStmt>() - 24usize];
    ["Alignment of RawStmt"][::std::mem::align_of::<RawStmt>() - 8usize];
    ["Offset of field: RawStmt::type_"][::std::mem::offset_of!(RawStmt, type_) - 0usize];
    ["Offset of field: RawStmt::stmt"][::std::mem::offset_of!(RawStmt, stmt) - 8usize];
    ["Offset of field: RawStmt::stmt_location"]
        [::std::mem::offset_of!(RawStmt, stmt_location) - 16usize];
    ["Offset of field: RawStmt::stmt_len"][::std::mem::offset_of!(RawStmt, stmt_len) - 20usize];
};
#[doc = "\t\tOptimizable Statements"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InsertStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub cols: *mut List,
    pub selectStmt: *mut Node,
    pub onConflictClause: *mut OnConflictClause,
    pub returningClause: *mut ReturningClause,
    pub withClause: *mut WithClause,
    pub override_: OverridingKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InsertStmt"][::std::mem::size_of::<InsertStmt>() - 64usize];
    ["Alignment of InsertStmt"][::std::mem::align_of::<InsertStmt>() - 8usize];
    ["Offset of field: InsertStmt::type_"][::std::mem::offset_of!(InsertStmt, type_) - 0usize];
    ["Offset of field: InsertStmt::relation"]
        [::std::mem::offset_of!(InsertStmt, relation) - 8usize];
    ["Offset of field: InsertStmt::cols"][::std::mem::offset_of!(InsertStmt, cols) - 16usize];
    ["Offset of field: InsertStmt::selectStmt"]
        [::std::mem::offset_of!(InsertStmt, selectStmt) - 24usize];
    ["Offset of field: InsertStmt::onConflictClause"]
        [::std::mem::offset_of!(InsertStmt, onConflictClause) - 32usize];
    ["Offset of field: InsertStmt::returningClause"]
        [::std::mem::offset_of!(InsertStmt, returningClause) - 40usize];
    ["Offset of field: InsertStmt::withClause"]
        [::std::mem::offset_of!(InsertStmt, withClause) - 48usize];
    ["Offset of field: InsertStmt::override_"]
        [::std::mem::offset_of!(InsertStmt, override_) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeleteStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub usingClause: *mut List,
    pub whereClause: *mut Node,
    pub returningClause: *mut ReturningClause,
    pub withClause: *mut WithClause,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeleteStmt"][::std::mem::size_of::<DeleteStmt>() - 48usize];
    ["Alignment of DeleteStmt"][::std::mem::align_of::<DeleteStmt>() - 8usize];
    ["Offset of field: DeleteStmt::type_"][::std::mem::offset_of!(DeleteStmt, type_) - 0usize];
    ["Offset of field: DeleteStmt::relation"]
        [::std::mem::offset_of!(DeleteStmt, relation) - 8usize];
    ["Offset of field: DeleteStmt::usingClause"]
        [::std::mem::offset_of!(DeleteStmt, usingClause) - 16usize];
    ["Offset of field: DeleteStmt::whereClause"]
        [::std::mem::offset_of!(DeleteStmt, whereClause) - 24usize];
    ["Offset of field: DeleteStmt::returningClause"]
        [::std::mem::offset_of!(DeleteStmt, returningClause) - 32usize];
    ["Offset of field: DeleteStmt::withClause"]
        [::std::mem::offset_of!(DeleteStmt, withClause) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UpdateStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub targetList: *mut List,
    pub whereClause: *mut Node,
    pub fromClause: *mut List,
    pub returningClause: *mut ReturningClause,
    pub withClause: *mut WithClause,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UpdateStmt"][::std::mem::size_of::<UpdateStmt>() - 56usize];
    ["Alignment of UpdateStmt"][::std::mem::align_of::<UpdateStmt>() - 8usize];
    ["Offset of field: UpdateStmt::type_"][::std::mem::offset_of!(UpdateStmt, type_) - 0usize];
    ["Offset of field: UpdateStmt::relation"]
        [::std::mem::offset_of!(UpdateStmt, relation) - 8usize];
    ["Offset of field: UpdateStmt::targetList"]
        [::std::mem::offset_of!(UpdateStmt, targetList) - 16usize];
    ["Offset of field: UpdateStmt::whereClause"]
        [::std::mem::offset_of!(UpdateStmt, whereClause) - 24usize];
    ["Offset of field: UpdateStmt::fromClause"]
        [::std::mem::offset_of!(UpdateStmt, fromClause) - 32usize];
    ["Offset of field: UpdateStmt::returningClause"]
        [::std::mem::offset_of!(UpdateStmt, returningClause) - 40usize];
    ["Offset of field: UpdateStmt::withClause"]
        [::std::mem::offset_of!(UpdateStmt, withClause) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MergeStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub sourceRelation: *mut Node,
    pub joinCondition: *mut Node,
    pub mergeWhenClauses: *mut List,
    pub returningClause: *mut ReturningClause,
    pub withClause: *mut WithClause,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MergeStmt"][::std::mem::size_of::<MergeStmt>() - 56usize];
    ["Alignment of MergeStmt"][::std::mem::align_of::<MergeStmt>() - 8usize];
    ["Offset of field: MergeStmt::type_"][::std::mem::offset_of!(MergeStmt, type_) - 0usize];
    ["Offset of field: MergeStmt::relation"][::std::mem::offset_of!(MergeStmt, relation) - 8usize];
    ["Offset of field: MergeStmt::sourceRelation"]
        [::std::mem::offset_of!(MergeStmt, sourceRelation) - 16usize];
    ["Offset of field: MergeStmt::joinCondition"]
        [::std::mem::offset_of!(MergeStmt, joinCondition) - 24usize];
    ["Offset of field: MergeStmt::mergeWhenClauses"]
        [::std::mem::offset_of!(MergeStmt, mergeWhenClauses) - 32usize];
    ["Offset of field: MergeStmt::returningClause"]
        [::std::mem::offset_of!(MergeStmt, returningClause) - 40usize];
    ["Offset of field: MergeStmt::withClause"]
        [::std::mem::offset_of!(MergeStmt, withClause) - 48usize];
};
pub const SetOperation_SETOP_NONE: SetOperation = 0;
pub const SetOperation_SETOP_UNION: SetOperation = 1;
pub const SetOperation_SETOP_INTERSECT: SetOperation = 2;
pub const SetOperation_SETOP_EXCEPT: SetOperation = 3;
pub type SetOperation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SelectStmt {
    pub type_: NodeTag,
    pub distinctClause: *mut List,
    pub intoClause: *mut IntoClause,
    pub targetList: *mut List,
    pub fromClause: *mut List,
    pub whereClause: *mut Node,
    pub groupClause: *mut List,
    pub groupDistinct: bool,
    pub havingClause: *mut Node,
    pub windowClause: *mut List,
    pub valuesLists: *mut List,
    pub sortClause: *mut List,
    pub limitOffset: *mut Node,
    pub limitCount: *mut Node,
    pub limitOption: LimitOption,
    pub lockingClause: *mut List,
    pub withClause: *mut WithClause,
    pub op: SetOperation,
    pub all: bool,
    pub larg: *mut SelectStmt,
    pub rarg: *mut SelectStmt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SelectStmt"][::std::mem::size_of::<SelectStmt>() - 160usize];
    ["Alignment of SelectStmt"][::std::mem::align_of::<SelectStmt>() - 8usize];
    ["Offset of field: SelectStmt::type_"][::std::mem::offset_of!(SelectStmt, type_) - 0usize];
    ["Offset of field: SelectStmt::distinctClause"]
        [::std::mem::offset_of!(SelectStmt, distinctClause) - 8usize];
    ["Offset of field: SelectStmt::intoClause"]
        [::std::mem::offset_of!(SelectStmt, intoClause) - 16usize];
    ["Offset of field: SelectStmt::targetList"]
        [::std::mem::offset_of!(SelectStmt, targetList) - 24usize];
    ["Offset of field: SelectStmt::fromClause"]
        [::std::mem::offset_of!(SelectStmt, fromClause) - 32usize];
    ["Offset of field: SelectStmt::whereClause"]
        [::std::mem::offset_of!(SelectStmt, whereClause) - 40usize];
    ["Offset of field: SelectStmt::groupClause"]
        [::std::mem::offset_of!(SelectStmt, groupClause) - 48usize];
    ["Offset of field: SelectStmt::groupDistinct"]
        [::std::mem::offset_of!(SelectStmt, groupDistinct) - 56usize];
    ["Offset of field: SelectStmt::havingClause"]
        [::std::mem::offset_of!(SelectStmt, havingClause) - 64usize];
    ["Offset of field: SelectStmt::windowClause"]
        [::std::mem::offset_of!(SelectStmt, windowClause) - 72usize];
    ["Offset of field: SelectStmt::valuesLists"]
        [::std::mem::offset_of!(SelectStmt, valuesLists) - 80usize];
    ["Offset of field: SelectStmt::sortClause"]
        [::std::mem::offset_of!(SelectStmt, sortClause) - 88usize];
    ["Offset of field: SelectStmt::limitOffset"]
        [::std::mem::offset_of!(SelectStmt, limitOffset) - 96usize];
    ["Offset of field: SelectStmt::limitCount"]
        [::std::mem::offset_of!(SelectStmt, limitCount) - 104usize];
    ["Offset of field: SelectStmt::limitOption"]
        [::std::mem::offset_of!(SelectStmt, limitOption) - 112usize];
    ["Offset of field: SelectStmt::lockingClause"]
        [::std::mem::offset_of!(SelectStmt, lockingClause) - 120usize];
    ["Offset of field: SelectStmt::withClause"]
        [::std::mem::offset_of!(SelectStmt, withClause) - 128usize];
    ["Offset of field: SelectStmt::op"][::std::mem::offset_of!(SelectStmt, op) - 136usize];
    ["Offset of field: SelectStmt::all"][::std::mem::offset_of!(SelectStmt, all) - 140usize];
    ["Offset of field: SelectStmt::larg"][::std::mem::offset_of!(SelectStmt, larg) - 144usize];
    ["Offset of field: SelectStmt::rarg"][::std::mem::offset_of!(SelectStmt, rarg) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SetOperationStmt {
    pub type_: NodeTag,
    pub op: SetOperation,
    pub all: bool,
    pub larg: *mut Node,
    pub rarg: *mut Node,
    pub colTypes: *mut List,
    pub colTypmods: *mut List,
    pub colCollations: *mut List,
    pub groupClauses: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SetOperationStmt"][::std::mem::size_of::<SetOperationStmt>() - 64usize];
    ["Alignment of SetOperationStmt"][::std::mem::align_of::<SetOperationStmt>() - 8usize];
    ["Offset of field: SetOperationStmt::type_"]
        [::std::mem::offset_of!(SetOperationStmt, type_) - 0usize];
    ["Offset of field: SetOperationStmt::op"]
        [::std::mem::offset_of!(SetOperationStmt, op) - 4usize];
    ["Offset of field: SetOperationStmt::all"]
        [::std::mem::offset_of!(SetOperationStmt, all) - 8usize];
    ["Offset of field: SetOperationStmt::larg"]
        [::std::mem::offset_of!(SetOperationStmt, larg) - 16usize];
    ["Offset of field: SetOperationStmt::rarg"]
        [::std::mem::offset_of!(SetOperationStmt, rarg) - 24usize];
    ["Offset of field: SetOperationStmt::colTypes"]
        [::std::mem::offset_of!(SetOperationStmt, colTypes) - 32usize];
    ["Offset of field: SetOperationStmt::colTypmods"]
        [::std::mem::offset_of!(SetOperationStmt, colTypmods) - 40usize];
    ["Offset of field: SetOperationStmt::colCollations"]
        [::std::mem::offset_of!(SetOperationStmt, colCollations) - 48usize];
    ["Offset of field: SetOperationStmt::groupClauses"]
        [::std::mem::offset_of!(SetOperationStmt, groupClauses) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReturnStmt {
    pub type_: NodeTag,
    pub returnval: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReturnStmt"][::std::mem::size_of::<ReturnStmt>() - 16usize];
    ["Alignment of ReturnStmt"][::std::mem::align_of::<ReturnStmt>() - 8usize];
    ["Offset of field: ReturnStmt::type_"][::std::mem::offset_of!(ReturnStmt, type_) - 0usize];
    ["Offset of field: ReturnStmt::returnval"]
        [::std::mem::offset_of!(ReturnStmt, returnval) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PLAssignStmt {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
    pub indirection: *mut List,
    pub nnames: ::std::os::raw::c_int,
    pub val: *mut SelectStmt,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PLAssignStmt"][::std::mem::size_of::<PLAssignStmt>() - 48usize];
    ["Alignment of PLAssignStmt"][::std::mem::align_of::<PLAssignStmt>() - 8usize];
    ["Offset of field: PLAssignStmt::type_"][::std::mem::offset_of!(PLAssignStmt, type_) - 0usize];
    ["Offset of field: PLAssignStmt::name"][::std::mem::offset_of!(PLAssignStmt, name) - 8usize];
    ["Offset of field: PLAssignStmt::indirection"]
        [::std::mem::offset_of!(PLAssignStmt, indirection) - 16usize];
    ["Offset of field: PLAssignStmt::nnames"]
        [::std::mem::offset_of!(PLAssignStmt, nnames) - 24usize];
    ["Offset of field: PLAssignStmt::val"][::std::mem::offset_of!(PLAssignStmt, val) - 32usize];
    ["Offset of field: PLAssignStmt::location"]
        [::std::mem::offset_of!(PLAssignStmt, location) - 40usize];
};
pub const ObjectType_OBJECT_ACCESS_METHOD: ObjectType = 0;
pub const ObjectType_OBJECT_AGGREGATE: ObjectType = 1;
pub const ObjectType_OBJECT_AMOP: ObjectType = 2;
pub const ObjectType_OBJECT_AMPROC: ObjectType = 3;
pub const ObjectType_OBJECT_ATTRIBUTE: ObjectType = 4;
pub const ObjectType_OBJECT_CAST: ObjectType = 5;
pub const ObjectType_OBJECT_COLUMN: ObjectType = 6;
pub const ObjectType_OBJECT_COLLATION: ObjectType = 7;
pub const ObjectType_OBJECT_CONVERSION: ObjectType = 8;
pub const ObjectType_OBJECT_DATABASE: ObjectType = 9;
pub const ObjectType_OBJECT_DEFAULT: ObjectType = 10;
pub const ObjectType_OBJECT_DEFACL: ObjectType = 11;
pub const ObjectType_OBJECT_DOMAIN: ObjectType = 12;
pub const ObjectType_OBJECT_DOMCONSTRAINT: ObjectType = 13;
pub const ObjectType_OBJECT_EVENT_TRIGGER: ObjectType = 14;
pub const ObjectType_OBJECT_EXTENSION: ObjectType = 15;
pub const ObjectType_OBJECT_FDW: ObjectType = 16;
pub const ObjectType_OBJECT_FOREIGN_SERVER: ObjectType = 17;
pub const ObjectType_OBJECT_FOREIGN_TABLE: ObjectType = 18;
pub const ObjectType_OBJECT_FUNCTION: ObjectType = 19;
pub const ObjectType_OBJECT_INDEX: ObjectType = 20;
pub const ObjectType_OBJECT_LANGUAGE: ObjectType = 21;
pub const ObjectType_OBJECT_LARGEOBJECT: ObjectType = 22;
pub const ObjectType_OBJECT_MATVIEW: ObjectType = 23;
pub const ObjectType_OBJECT_OPCLASS: ObjectType = 24;
pub const ObjectType_OBJECT_OPERATOR: ObjectType = 25;
pub const ObjectType_OBJECT_OPFAMILY: ObjectType = 26;
pub const ObjectType_OBJECT_PARAMETER_ACL: ObjectType = 27;
pub const ObjectType_OBJECT_POLICY: ObjectType = 28;
pub const ObjectType_OBJECT_PROCEDURE: ObjectType = 29;
pub const ObjectType_OBJECT_PUBLICATION: ObjectType = 30;
pub const ObjectType_OBJECT_PUBLICATION_NAMESPACE: ObjectType = 31;
pub const ObjectType_OBJECT_PUBLICATION_REL: ObjectType = 32;
pub const ObjectType_OBJECT_ROLE: ObjectType = 33;
pub const ObjectType_OBJECT_ROUTINE: ObjectType = 34;
pub const ObjectType_OBJECT_RULE: ObjectType = 35;
pub const ObjectType_OBJECT_SCHEMA: ObjectType = 36;
pub const ObjectType_OBJECT_SEQUENCE: ObjectType = 37;
pub const ObjectType_OBJECT_SUBSCRIPTION: ObjectType = 38;
pub const ObjectType_OBJECT_STATISTIC_EXT: ObjectType = 39;
pub const ObjectType_OBJECT_TABCONSTRAINT: ObjectType = 40;
pub const ObjectType_OBJECT_TABLE: ObjectType = 41;
pub const ObjectType_OBJECT_TABLESPACE: ObjectType = 42;
pub const ObjectType_OBJECT_TRANSFORM: ObjectType = 43;
pub const ObjectType_OBJECT_TRIGGER: ObjectType = 44;
pub const ObjectType_OBJECT_TSCONFIGURATION: ObjectType = 45;
pub const ObjectType_OBJECT_TSDICTIONARY: ObjectType = 46;
pub const ObjectType_OBJECT_TSPARSER: ObjectType = 47;
pub const ObjectType_OBJECT_TSTEMPLATE: ObjectType = 48;
pub const ObjectType_OBJECT_TYPE: ObjectType = 49;
pub const ObjectType_OBJECT_USER_MAPPING: ObjectType = 50;
pub const ObjectType_OBJECT_VIEW: ObjectType = 51;
#[doc = "\t\tOther Statements (no optimizations required)\n\n\t\tThese are not touched by parser/analyze.c except to put them into\n\t\tthe utilityStmt field of a Query.  This is eventually passed to\n\t\tProcessUtility (by-passing rewriting and planning).  Some of the\n\t\tstatements do need attention from parse analysis, and this is\n\t\tdone by routines in parser/parse_utilcmd.c after ProcessUtility\n\t\treceives the command for execution.\n\t\tDECLARE CURSOR, EXPLAIN, and CREATE TABLE AS are special cases:\n\t\tthey contain optimizable statements, which get processed normally\n\t\tby parser/analyze.c."]
pub type ObjectType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateSchemaStmt {
    pub type_: NodeTag,
    pub schemaname: *mut ::std::os::raw::c_char,
    pub authrole: *mut RoleSpec,
    pub schemaElts: *mut List,
    pub if_not_exists: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateSchemaStmt"][::std::mem::size_of::<CreateSchemaStmt>() - 40usize];
    ["Alignment of CreateSchemaStmt"][::std::mem::align_of::<CreateSchemaStmt>() - 8usize];
    ["Offset of field: CreateSchemaStmt::type_"]
        [::std::mem::offset_of!(CreateSchemaStmt, type_) - 0usize];
    ["Offset of field: CreateSchemaStmt::schemaname"]
        [::std::mem::offset_of!(CreateSchemaStmt, schemaname) - 8usize];
    ["Offset of field: CreateSchemaStmt::authrole"]
        [::std::mem::offset_of!(CreateSchemaStmt, authrole) - 16usize];
    ["Offset of field: CreateSchemaStmt::schemaElts"]
        [::std::mem::offset_of!(CreateSchemaStmt, schemaElts) - 24usize];
    ["Offset of field: CreateSchemaStmt::if_not_exists"]
        [::std::mem::offset_of!(CreateSchemaStmt, if_not_exists) - 32usize];
};
pub const DropBehavior_DROP_RESTRICT: DropBehavior = 0;
pub const DropBehavior_DROP_CASCADE: DropBehavior = 1;
pub type DropBehavior = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterTableStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub cmds: *mut List,
    pub objtype: ObjectType,
    pub missing_ok: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterTableStmt"][::std::mem::size_of::<AlterTableStmt>() - 32usize];
    ["Alignment of AlterTableStmt"][::std::mem::align_of::<AlterTableStmt>() - 8usize];
    ["Offset of field: AlterTableStmt::type_"]
        [::std::mem::offset_of!(AlterTableStmt, type_) - 0usize];
    ["Offset of field: AlterTableStmt::relation"]
        [::std::mem::offset_of!(AlterTableStmt, relation) - 8usize];
    ["Offset of field: AlterTableStmt::cmds"]
        [::std::mem::offset_of!(AlterTableStmt, cmds) - 16usize];
    ["Offset of field: AlterTableStmt::objtype"]
        [::std::mem::offset_of!(AlterTableStmt, objtype) - 24usize];
    ["Offset of field: AlterTableStmt::missing_ok"]
        [::std::mem::offset_of!(AlterTableStmt, missing_ok) - 28usize];
};
pub const AlterTableType_AT_AddColumn: AlterTableType = 0;
pub const AlterTableType_AT_AddColumnToView: AlterTableType = 1;
pub const AlterTableType_AT_ColumnDefault: AlterTableType = 2;
pub const AlterTableType_AT_CookedColumnDefault: AlterTableType = 3;
pub const AlterTableType_AT_DropNotNull: AlterTableType = 4;
pub const AlterTableType_AT_SetNotNull: AlterTableType = 5;
pub const AlterTableType_AT_SetExpression: AlterTableType = 6;
pub const AlterTableType_AT_DropExpression: AlterTableType = 7;
pub const AlterTableType_AT_SetStatistics: AlterTableType = 8;
pub const AlterTableType_AT_SetOptions: AlterTableType = 9;
pub const AlterTableType_AT_ResetOptions: AlterTableType = 10;
pub const AlterTableType_AT_SetStorage: AlterTableType = 11;
pub const AlterTableType_AT_SetCompression: AlterTableType = 12;
pub const AlterTableType_AT_DropColumn: AlterTableType = 13;
pub const AlterTableType_AT_AddIndex: AlterTableType = 14;
pub const AlterTableType_AT_ReAddIndex: AlterTableType = 15;
pub const AlterTableType_AT_AddConstraint: AlterTableType = 16;
pub const AlterTableType_AT_ReAddConstraint: AlterTableType = 17;
pub const AlterTableType_AT_ReAddDomainConstraint: AlterTableType = 18;
pub const AlterTableType_AT_AlterConstraint: AlterTableType = 19;
pub const AlterTableType_AT_ValidateConstraint: AlterTableType = 20;
pub const AlterTableType_AT_AddIndexConstraint: AlterTableType = 21;
pub const AlterTableType_AT_DropConstraint: AlterTableType = 22;
pub const AlterTableType_AT_ReAddComment: AlterTableType = 23;
pub const AlterTableType_AT_AlterColumnType: AlterTableType = 24;
pub const AlterTableType_AT_AlterColumnGenericOptions: AlterTableType = 25;
pub const AlterTableType_AT_ChangeOwner: AlterTableType = 26;
pub const AlterTableType_AT_ClusterOn: AlterTableType = 27;
pub const AlterTableType_AT_DropCluster: AlterTableType = 28;
pub const AlterTableType_AT_SetLogged: AlterTableType = 29;
pub const AlterTableType_AT_SetUnLogged: AlterTableType = 30;
pub const AlterTableType_AT_DropOids: AlterTableType = 31;
pub const AlterTableType_AT_SetAccessMethod: AlterTableType = 32;
pub const AlterTableType_AT_SetTableSpace: AlterTableType = 33;
pub const AlterTableType_AT_SetRelOptions: AlterTableType = 34;
pub const AlterTableType_AT_ResetRelOptions: AlterTableType = 35;
pub const AlterTableType_AT_ReplaceRelOptions: AlterTableType = 36;
pub const AlterTableType_AT_EnableTrig: AlterTableType = 37;
pub const AlterTableType_AT_EnableAlwaysTrig: AlterTableType = 38;
pub const AlterTableType_AT_EnableReplicaTrig: AlterTableType = 39;
pub const AlterTableType_AT_DisableTrig: AlterTableType = 40;
pub const AlterTableType_AT_EnableTrigAll: AlterTableType = 41;
pub const AlterTableType_AT_DisableTrigAll: AlterTableType = 42;
pub const AlterTableType_AT_EnableTrigUser: AlterTableType = 43;
pub const AlterTableType_AT_DisableTrigUser: AlterTableType = 44;
pub const AlterTableType_AT_EnableRule: AlterTableType = 45;
pub const AlterTableType_AT_EnableAlwaysRule: AlterTableType = 46;
pub const AlterTableType_AT_EnableReplicaRule: AlterTableType = 47;
pub const AlterTableType_AT_DisableRule: AlterTableType = 48;
pub const AlterTableType_AT_AddInherit: AlterTableType = 49;
pub const AlterTableType_AT_DropInherit: AlterTableType = 50;
pub const AlterTableType_AT_AddOf: AlterTableType = 51;
pub const AlterTableType_AT_DropOf: AlterTableType = 52;
pub const AlterTableType_AT_ReplicaIdentity: AlterTableType = 53;
pub const AlterTableType_AT_EnableRowSecurity: AlterTableType = 54;
pub const AlterTableType_AT_DisableRowSecurity: AlterTableType = 55;
pub const AlterTableType_AT_ForceRowSecurity: AlterTableType = 56;
pub const AlterTableType_AT_NoForceRowSecurity: AlterTableType = 57;
pub const AlterTableType_AT_GenericOptions: AlterTableType = 58;
pub const AlterTableType_AT_AttachPartition: AlterTableType = 59;
pub const AlterTableType_AT_DetachPartition: AlterTableType = 60;
pub const AlterTableType_AT_DetachPartitionFinalize: AlterTableType = 61;
pub const AlterTableType_AT_AddIdentity: AlterTableType = 62;
pub const AlterTableType_AT_SetIdentity: AlterTableType = 63;
pub const AlterTableType_AT_DropIdentity: AlterTableType = 64;
pub const AlterTableType_AT_ReAddStatistics: AlterTableType = 65;
pub type AlterTableType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterTableCmd {
    pub type_: NodeTag,
    pub subtype: AlterTableType,
    pub name: *mut ::std::os::raw::c_char,
    pub num: int16,
    pub newowner: *mut RoleSpec,
    pub def: *mut Node,
    pub behavior: DropBehavior,
    pub missing_ok: bool,
    pub recurse: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterTableCmd"][::std::mem::size_of::<AlterTableCmd>() - 48usize];
    ["Alignment of AlterTableCmd"][::std::mem::align_of::<AlterTableCmd>() - 8usize];
    ["Offset of field: AlterTableCmd::type_"]
        [::std::mem::offset_of!(AlterTableCmd, type_) - 0usize];
    ["Offset of field: AlterTableCmd::subtype"]
        [::std::mem::offset_of!(AlterTableCmd, subtype) - 4usize];
    ["Offset of field: AlterTableCmd::name"][::std::mem::offset_of!(AlterTableCmd, name) - 8usize];
    ["Offset of field: AlterTableCmd::num"][::std::mem::offset_of!(AlterTableCmd, num) - 16usize];
    ["Offset of field: AlterTableCmd::newowner"]
        [::std::mem::offset_of!(AlterTableCmd, newowner) - 24usize];
    ["Offset of field: AlterTableCmd::def"][::std::mem::offset_of!(AlterTableCmd, def) - 32usize];
    ["Offset of field: AlterTableCmd::behavior"]
        [::std::mem::offset_of!(AlterTableCmd, behavior) - 40usize];
    ["Offset of field: AlterTableCmd::missing_ok"]
        [::std::mem::offset_of!(AlterTableCmd, missing_ok) - 44usize];
    ["Offset of field: AlterTableCmd::recurse"]
        [::std::mem::offset_of!(AlterTableCmd, recurse) - 45usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ATAlterConstraint {
    pub type_: NodeTag,
    pub conname: *mut ::std::os::raw::c_char,
    pub alterEnforceability: bool,
    pub is_enforced: bool,
    pub alterDeferrability: bool,
    pub deferrable: bool,
    pub initdeferred: bool,
    pub alterInheritability: bool,
    pub noinherit: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ATAlterConstraint"][::std::mem::size_of::<ATAlterConstraint>() - 24usize];
    ["Alignment of ATAlterConstraint"][::std::mem::align_of::<ATAlterConstraint>() - 8usize];
    ["Offset of field: ATAlterConstraint::type_"]
        [::std::mem::offset_of!(ATAlterConstraint, type_) - 0usize];
    ["Offset of field: ATAlterConstraint::conname"]
        [::std::mem::offset_of!(ATAlterConstraint, conname) - 8usize];
    ["Offset of field: ATAlterConstraint::alterEnforceability"]
        [::std::mem::offset_of!(ATAlterConstraint, alterEnforceability) - 16usize];
    ["Offset of field: ATAlterConstraint::is_enforced"]
        [::std::mem::offset_of!(ATAlterConstraint, is_enforced) - 17usize];
    ["Offset of field: ATAlterConstraint::alterDeferrability"]
        [::std::mem::offset_of!(ATAlterConstraint, alterDeferrability) - 18usize];
    ["Offset of field: ATAlterConstraint::deferrable"]
        [::std::mem::offset_of!(ATAlterConstraint, deferrable) - 19usize];
    ["Offset of field: ATAlterConstraint::initdeferred"]
        [::std::mem::offset_of!(ATAlterConstraint, initdeferred) - 20usize];
    ["Offset of field: ATAlterConstraint::alterInheritability"]
        [::std::mem::offset_of!(ATAlterConstraint, alterInheritability) - 21usize];
    ["Offset of field: ATAlterConstraint::noinherit"]
        [::std::mem::offset_of!(ATAlterConstraint, noinherit) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReplicaIdentityStmt {
    pub type_: NodeTag,
    pub identity_type: ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReplicaIdentityStmt"][::std::mem::size_of::<ReplicaIdentityStmt>() - 16usize];
    ["Alignment of ReplicaIdentityStmt"][::std::mem::align_of::<ReplicaIdentityStmt>() - 8usize];
    ["Offset of field: ReplicaIdentityStmt::type_"]
        [::std::mem::offset_of!(ReplicaIdentityStmt, type_) - 0usize];
    ["Offset of field: ReplicaIdentityStmt::identity_type"]
        [::std::mem::offset_of!(ReplicaIdentityStmt, identity_type) - 4usize];
    ["Offset of field: ReplicaIdentityStmt::name"]
        [::std::mem::offset_of!(ReplicaIdentityStmt, name) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterCollationStmt {
    pub type_: NodeTag,
    pub collname: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterCollationStmt"][::std::mem::size_of::<AlterCollationStmt>() - 16usize];
    ["Alignment of AlterCollationStmt"][::std::mem::align_of::<AlterCollationStmt>() - 8usize];
    ["Offset of field: AlterCollationStmt::type_"]
        [::std::mem::offset_of!(AlterCollationStmt, type_) - 0usize];
    ["Offset of field: AlterCollationStmt::collname"]
        [::std::mem::offset_of!(AlterCollationStmt, collname) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterDomainStmt {
    pub type_: NodeTag,
    pub subtype: ::std::os::raw::c_char,
    pub typeName: *mut List,
    pub name: *mut ::std::os::raw::c_char,
    pub def: *mut Node,
    pub behavior: DropBehavior,
    pub missing_ok: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterDomainStmt"][::std::mem::size_of::<AlterDomainStmt>() - 40usize];
    ["Alignment of AlterDomainStmt"][::std::mem::align_of::<AlterDomainStmt>() - 8usize];
    ["Offset of field: AlterDomainStmt::type_"]
        [::std::mem::offset_of!(AlterDomainStmt, type_) - 0usize];
    ["Offset of field: AlterDomainStmt::subtype"]
        [::std::mem::offset_of!(AlterDomainStmt, subtype) - 4usize];
    ["Offset of field: AlterDomainStmt::typeName"]
        [::std::mem::offset_of!(AlterDomainStmt, typeName) - 8usize];
    ["Offset of field: AlterDomainStmt::name"]
        [::std::mem::offset_of!(AlterDomainStmt, name) - 16usize];
    ["Offset of field: AlterDomainStmt::def"]
        [::std::mem::offset_of!(AlterDomainStmt, def) - 24usize];
    ["Offset of field: AlterDomainStmt::behavior"]
        [::std::mem::offset_of!(AlterDomainStmt, behavior) - 32usize];
    ["Offset of field: AlterDomainStmt::missing_ok"]
        [::std::mem::offset_of!(AlterDomainStmt, missing_ok) - 36usize];
};
pub const GrantTargetType_ACL_TARGET_OBJECT: GrantTargetType = 0;
pub const GrantTargetType_ACL_TARGET_ALL_IN_SCHEMA: GrantTargetType = 1;
pub const GrantTargetType_ACL_TARGET_DEFAULTS: GrantTargetType = 2;
pub type GrantTargetType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GrantStmt {
    pub type_: NodeTag,
    pub is_grant: bool,
    pub targtype: GrantTargetType,
    pub objtype: ObjectType,
    pub objects: *mut List,
    pub privileges: *mut List,
    pub grantees: *mut List,
    pub grant_option: bool,
    pub grantor: *mut RoleSpec,
    pub behavior: DropBehavior,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GrantStmt"][::std::mem::size_of::<GrantStmt>() - 64usize];
    ["Alignment of GrantStmt"][::std::mem::align_of::<GrantStmt>() - 8usize];
    ["Offset of field: GrantStmt::type_"][::std::mem::offset_of!(GrantStmt, type_) - 0usize];
    ["Offset of field: GrantStmt::is_grant"][::std::mem::offset_of!(GrantStmt, is_grant) - 4usize];
    ["Offset of field: GrantStmt::targtype"][::std::mem::offset_of!(GrantStmt, targtype) - 8usize];
    ["Offset of field: GrantStmt::objtype"][::std::mem::offset_of!(GrantStmt, objtype) - 12usize];
    ["Offset of field: GrantStmt::objects"][::std::mem::offset_of!(GrantStmt, objects) - 16usize];
    ["Offset of field: GrantStmt::privileges"]
        [::std::mem::offset_of!(GrantStmt, privileges) - 24usize];
    ["Offset of field: GrantStmt::grantees"][::std::mem::offset_of!(GrantStmt, grantees) - 32usize];
    ["Offset of field: GrantStmt::grant_option"]
        [::std::mem::offset_of!(GrantStmt, grant_option) - 40usize];
    ["Offset of field: GrantStmt::grantor"][::std::mem::offset_of!(GrantStmt, grantor) - 48usize];
    ["Offset of field: GrantStmt::behavior"][::std::mem::offset_of!(GrantStmt, behavior) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ObjectWithArgs {
    pub type_: NodeTag,
    pub objname: *mut List,
    pub objargs: *mut List,
    pub objfuncargs: *mut List,
    pub args_unspecified: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ObjectWithArgs"][::std::mem::size_of::<ObjectWithArgs>() - 40usize];
    ["Alignment of ObjectWithArgs"][::std::mem::align_of::<ObjectWithArgs>() - 8usize];
    ["Offset of field: ObjectWithArgs::type_"]
        [::std::mem::offset_of!(ObjectWithArgs, type_) - 0usize];
    ["Offset of field: ObjectWithArgs::objname"]
        [::std::mem::offset_of!(ObjectWithArgs, objname) - 8usize];
    ["Offset of field: ObjectWithArgs::objargs"]
        [::std::mem::offset_of!(ObjectWithArgs, objargs) - 16usize];
    ["Offset of field: ObjectWithArgs::objfuncargs"]
        [::std::mem::offset_of!(ObjectWithArgs, objfuncargs) - 24usize];
    ["Offset of field: ObjectWithArgs::args_unspecified"]
        [::std::mem::offset_of!(ObjectWithArgs, args_unspecified) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AccessPriv {
    pub type_: NodeTag,
    pub priv_name: *mut ::std::os::raw::c_char,
    pub cols: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccessPriv"][::std::mem::size_of::<AccessPriv>() - 24usize];
    ["Alignment of AccessPriv"][::std::mem::align_of::<AccessPriv>() - 8usize];
    ["Offset of field: AccessPriv::type_"][::std::mem::offset_of!(AccessPriv, type_) - 0usize];
    ["Offset of field: AccessPriv::priv_name"]
        [::std::mem::offset_of!(AccessPriv, priv_name) - 8usize];
    ["Offset of field: AccessPriv::cols"][::std::mem::offset_of!(AccessPriv, cols) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GrantRoleStmt {
    pub type_: NodeTag,
    pub granted_roles: *mut List,
    pub grantee_roles: *mut List,
    pub is_grant: bool,
    pub opt: *mut List,
    pub grantor: *mut RoleSpec,
    pub behavior: DropBehavior,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GrantRoleStmt"][::std::mem::size_of::<GrantRoleStmt>() - 56usize];
    ["Alignment of GrantRoleStmt"][::std::mem::align_of::<GrantRoleStmt>() - 8usize];
    ["Offset of field: GrantRoleStmt::type_"]
        [::std::mem::offset_of!(GrantRoleStmt, type_) - 0usize];
    ["Offset of field: GrantRoleStmt::granted_roles"]
        [::std::mem::offset_of!(GrantRoleStmt, granted_roles) - 8usize];
    ["Offset of field: GrantRoleStmt::grantee_roles"]
        [::std::mem::offset_of!(GrantRoleStmt, grantee_roles) - 16usize];
    ["Offset of field: GrantRoleStmt::is_grant"]
        [::std::mem::offset_of!(GrantRoleStmt, is_grant) - 24usize];
    ["Offset of field: GrantRoleStmt::opt"][::std::mem::offset_of!(GrantRoleStmt, opt) - 32usize];
    ["Offset of field: GrantRoleStmt::grantor"]
        [::std::mem::offset_of!(GrantRoleStmt, grantor) - 40usize];
    ["Offset of field: GrantRoleStmt::behavior"]
        [::std::mem::offset_of!(GrantRoleStmt, behavior) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterDefaultPrivilegesStmt {
    pub type_: NodeTag,
    pub options: *mut List,
    pub action: *mut GrantStmt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterDefaultPrivilegesStmt"]
        [::std::mem::size_of::<AlterDefaultPrivilegesStmt>() - 24usize];
    ["Alignment of AlterDefaultPrivilegesStmt"]
        [::std::mem::align_of::<AlterDefaultPrivilegesStmt>() - 8usize];
    ["Offset of field: AlterDefaultPrivilegesStmt::type_"]
        [::std::mem::offset_of!(AlterDefaultPrivilegesStmt, type_) - 0usize];
    ["Offset of field: AlterDefaultPrivilegesStmt::options"]
        [::std::mem::offset_of!(AlterDefaultPrivilegesStmt, options) - 8usize];
    ["Offset of field: AlterDefaultPrivilegesStmt::action"]
        [::std::mem::offset_of!(AlterDefaultPrivilegesStmt, action) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CopyStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub query: *mut Node,
    pub attlist: *mut List,
    pub is_from: bool,
    pub is_program: bool,
    pub filename: *mut ::std::os::raw::c_char,
    pub options: *mut List,
    pub whereClause: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopyStmt"][::std::mem::size_of::<CopyStmt>() - 64usize];
    ["Alignment of CopyStmt"][::std::mem::align_of::<CopyStmt>() - 8usize];
    ["Offset of field: CopyStmt::type_"][::std::mem::offset_of!(CopyStmt, type_) - 0usize];
    ["Offset of field: CopyStmt::relation"][::std::mem::offset_of!(CopyStmt, relation) - 8usize];
    ["Offset of field: CopyStmt::query"][::std::mem::offset_of!(CopyStmt, query) - 16usize];
    ["Offset of field: CopyStmt::attlist"][::std::mem::offset_of!(CopyStmt, attlist) - 24usize];
    ["Offset of field: CopyStmt::is_from"][::std::mem::offset_of!(CopyStmt, is_from) - 32usize];
    ["Offset of field: CopyStmt::is_program"]
        [::std::mem::offset_of!(CopyStmt, is_program) - 33usize];
    ["Offset of field: CopyStmt::filename"][::std::mem::offset_of!(CopyStmt, filename) - 40usize];
    ["Offset of field: CopyStmt::options"][::std::mem::offset_of!(CopyStmt, options) - 48usize];
    ["Offset of field: CopyStmt::whereClause"]
        [::std::mem::offset_of!(CopyStmt, whereClause) - 56usize];
};
pub const VariableSetKind_VAR_SET_VALUE: VariableSetKind = 0;
pub const VariableSetKind_VAR_SET_DEFAULT: VariableSetKind = 1;
pub const VariableSetKind_VAR_SET_CURRENT: VariableSetKind = 2;
pub const VariableSetKind_VAR_SET_MULTI: VariableSetKind = 3;
pub const VariableSetKind_VAR_RESET: VariableSetKind = 4;
pub const VariableSetKind_VAR_RESET_ALL: VariableSetKind = 5;
pub type VariableSetKind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VariableSetStmt {
    pub type_: NodeTag,
    pub kind: VariableSetKind,
    pub name: *mut ::std::os::raw::c_char,
    pub args: *mut List,
    pub jumble_args: bool,
    pub is_local: bool,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VariableSetStmt"][::std::mem::size_of::<VariableSetStmt>() - 32usize];
    ["Alignment of VariableSetStmt"][::std::mem::align_of::<VariableSetStmt>() - 8usize];
    ["Offset of field: VariableSetStmt::type_"]
        [::std::mem::offset_of!(VariableSetStmt, type_) - 0usize];
    ["Offset of field: VariableSetStmt::kind"]
        [::std::mem::offset_of!(VariableSetStmt, kind) - 4usize];
    ["Offset of field: VariableSetStmt::name"]
        [::std::mem::offset_of!(VariableSetStmt, name) - 8usize];
    ["Offset of field: VariableSetStmt::args"]
        [::std::mem::offset_of!(VariableSetStmt, args) - 16usize];
    ["Offset of field: VariableSetStmt::jumble_args"]
        [::std::mem::offset_of!(VariableSetStmt, jumble_args) - 24usize];
    ["Offset of field: VariableSetStmt::is_local"]
        [::std::mem::offset_of!(VariableSetStmt, is_local) - 25usize];
    ["Offset of field: VariableSetStmt::location"]
        [::std::mem::offset_of!(VariableSetStmt, location) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VariableShowStmt {
    pub type_: NodeTag,
    pub name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VariableShowStmt"][::std::mem::size_of::<VariableShowStmt>() - 16usize];
    ["Alignment of VariableShowStmt"][::std::mem::align_of::<VariableShowStmt>() - 8usize];
    ["Offset of field: VariableShowStmt::type_"]
        [::std::mem::offset_of!(VariableShowStmt, type_) - 0usize];
    ["Offset of field: VariableShowStmt::name"]
        [::std::mem::offset_of!(VariableShowStmt, name) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateStmt {
    pub type_: NodeTag,
    pub relation: *mut RangeVar,
    pub tableElts: *mut List,
    pub inhRelations: *mut List,
    pub partbound: *mut PartitionBoundSpec,
    pub partspec: *mut PartitionSpec,
    pub ofTypename: *mut TypeName,
    pub constraints: *mut List,
    pub nnconstraints: *mut List,
    pub options: *mut List,
    pub oncommit: OnCommitAction,
    pub tablespacename: *mut ::std::os::raw::c_char,
    pub accessMethod: *mut ::std::os::raw::c_char,
    pub if_not_exists: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateStmt"][::std::mem::size_of::<CreateStmt>() - 112usize];
    ["Alignment of CreateStmt"][::std::mem::align_of::<CreateStmt>() - 8usize];
    ["Offset of field: CreateStmt::type_"][::std::mem::offset_of!(CreateStmt, type_) - 0usize];
    ["Offset of field: CreateStmt::relation"]
        [::std::mem::offset_of!(CreateStmt, relation) - 8usize];
    ["Offset of field: CreateStmt::tableElts"]
        [::std::mem::offset_of!(CreateStmt, tableElts) - 16usize];
    ["Offset of field: CreateStmt::inhRelations"]
        [::std::mem::offset_of!(CreateStmt, inhRelations) - 24usize];
    ["Offset of field: CreateStmt::partbound"]
        [::std::mem::offset_of!(CreateStmt, partbound) - 32usize];
    ["Offset of field: CreateStmt::partspec"]
        [::std::mem::offset_of!(CreateStmt, partspec) - 40usize];
    ["Offset of field: CreateStmt::ofTypename"]
        [::std::mem::offset_of!(CreateStmt, ofTypename) - 48usize];
    ["Offset of field: CreateStmt::constraints"]
        [::std::mem::offset_of!(CreateStmt, constraints) - 56usize];
    ["Offset of field: CreateStmt::nnconstraints"]
        [::std::mem::offset_of!(CreateStmt, nnconstraints) - 64usize];
    ["Offset of field: CreateStmt::options"][::std::mem::offset_of!(CreateStmt, options) - 72usize];
    ["Offset of field: CreateStmt::oncommit"]
        [::std::mem::offset_of!(CreateStmt, oncommit) - 80usize];
    ["Offset of field: CreateStmt::tablespacename"]
        [::std::mem::offset_of!(CreateStmt, tablespacename) - 88usize];
    ["Offset of field: CreateStmt::accessMethod"]
        [::std::mem::offset_of!(CreateStmt, accessMethod) - 96usize];
    ["Offset of field: CreateStmt::if_not_exists"]
        [::std::mem::offset_of!(CreateStmt, if_not_exists) - 104usize];
};
pub const ConstrType_CONSTR_NULL: ConstrType = 0;
pub const ConstrType_CONSTR_NOTNULL: ConstrType = 1;
pub const ConstrType_CONSTR_DEFAULT: ConstrType = 2;
pub const ConstrType_CONSTR_IDENTITY: ConstrType = 3;
pub const ConstrType_CONSTR_GENERATED: ConstrType = 4;
pub const ConstrType_CONSTR_CHECK: ConstrType = 5;
pub const ConstrType_CONSTR_PRIMARY: ConstrType = 6;
pub const ConstrType_CONSTR_UNIQUE: ConstrType = 7;
pub const ConstrType_CONSTR_EXCLUSION: ConstrType = 8;
pub const ConstrType_CONSTR_FOREIGN: ConstrType = 9;
pub const ConstrType_CONSTR_ATTR_DEFERRABLE: ConstrType = 10;
pub const ConstrType_CONSTR_ATTR_NOT_DEFERRABLE: ConstrType = 11;
pub const ConstrType_CONSTR_ATTR_DEFERRED: ConstrType = 12;
pub const ConstrType_CONSTR_ATTR_IMMEDIATE: ConstrType = 13;
pub const ConstrType_CONSTR_ATTR_ENFORCED: ConstrType = 14;
pub const ConstrType_CONSTR_ATTR_NOT_ENFORCED: ConstrType = 15;
pub type ConstrType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Constraint {
    pub type_: NodeTag,
    pub contype: ConstrType,
    pub conname: *mut ::std::os::raw::c_char,
    pub deferrable: bool,
    pub initdeferred: bool,
    pub is_enforced: bool,
    pub skip_validation: bool,
    pub initially_valid: bool,
    pub is_no_inherit: bool,
    pub raw_expr: *mut Node,
    pub cooked_expr: *mut ::std::os::raw::c_char,
    pub generated_when: ::std::os::raw::c_char,
    pub generated_kind: ::std::os::raw::c_char,
    pub nulls_not_distinct: bool,
    pub keys: *mut List,
    pub without_overlaps: bool,
    pub including: *mut List,
    pub exclusions: *mut List,
    pub options: *mut List,
    pub indexname: *mut ::std::os::raw::c_char,
    pub indexspace: *mut ::std::os::raw::c_char,
    pub reset_default_tblspc: bool,
    pub access_method: *mut ::std::os::raw::c_char,
    pub where_clause: *mut Node,
    pub pktable: *mut RangeVar,
    pub fk_attrs: *mut List,
    pub pk_attrs: *mut List,
    pub fk_with_period: bool,
    pub pk_with_period: bool,
    pub fk_matchtype: ::std::os::raw::c_char,
    pub fk_upd_action: ::std::os::raw::c_char,
    pub fk_del_action: ::std::os::raw::c_char,
    pub fk_del_set_cols: *mut List,
    pub old_conpfeqop: *mut List,
    pub old_pktable_oid: Oid,
    pub location: ParseLoc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Constraint"][::std::mem::size_of::<Constraint>() - 184usize];
    ["Alignment of Constraint"][::std::mem::align_of::<Constraint>() - 8usize];
    ["Offset of field: Constraint::type_"][::std::mem::offset_of!(Constraint, type_) - 0usize];
    ["Offset of field: Constraint::contype"][::std::mem::offset_of!(Constraint, contype) - 4usize];
    ["Offset of field: Constraint::conname"][::std::mem::offset_of!(Constraint, conname) - 8usize];
    ["Offset of field: Constraint::deferrable"]
        [::std::mem::offset_of!(Constraint, deferrable) - 16usize];
    ["Offset of field: Constraint::initdeferred"]
        [::std::mem::offset_of!(Constraint, initdeferred) - 17usize];
    ["Offset of field: Constraint::is_enforced"]
        [::std::mem::offset_of!(Constraint, is_enforced) - 18usize];
    ["Offset of field: Constraint::skip_validation"]
        [::std::mem::offset_of!(Constraint, skip_validation) - 19usize];
    ["Offset of field: Constraint::initially_valid"]
        [::std::mem::offset_of!(Constraint, initially_valid) - 20usize];
    ["Offset of field: Constraint::is_no_inherit"]
        [::std::mem::offset_of!(Constraint, is_no_inherit) - 21usize];
    ["Offset of field: Constraint::raw_expr"]
        [::std::mem::offset_of!(Constraint, raw_expr) - 24usize];
    ["Offset of field: Constraint::cooked_expr"]
        [::std::mem::offset_of!(Constraint, cooked_expr) - 32usize];
    ["Offset of field: Constraint::generated_when"]
        [::std::mem::offset_of!(Constraint, generated_when) - 40usize];
    ["Offset of field: Constraint::generated_kind"]
        [::std::mem::offset_of!(Constraint, generated_kind) - 41usize];
    ["Offset of field: Constraint::nulls_not_distinct"]
        [::std::mem::offset_of!(Constraint, nulls_not_distinct) - 42usize];
    ["Offset of field: Constraint::keys"][::std::mem::offset_of!(Constraint, keys) - 48usize];
    ["Offset of field: Constraint::without_overlaps"]
        [::std::mem::offset_of!(Constraint, without_overlaps) - 56usize];
    ["Offset of field: Constraint::including"]
        [::std::mem::offset_of!(Constraint, including) - 64usize];
    ["Offset of field: Constraint::exclusions"]
        [::std::mem::offset_of!(Constraint, exclusions) - 72usize];
    ["Offset of field: Constraint::options"][::std::mem::offset_of!(Constraint, options) - 80usize];
    ["Offset of field: Constraint::indexname"]
        [::std::mem::offset_of!(Constraint, indexname) - 88usize];
    ["Offset of field: Constraint::indexspace"]
        [::std::mem::offset_of!(Constraint, indexspace) - 96usize];
    ["Offset of field: Constraint::reset_default_tblspc"]
        [::std::mem::offset_of!(Constraint, reset_default_tblspc) - 104usize];
    ["Offset of field: Constraint::access_method"]
        [::std::mem::offset_of!(Constraint, access_method) - 112usize];
    ["Offset of field: Constraint::where_clause"]
        [::std::mem::offset_of!(Constraint, where_clause) - 120usize];
    ["Offset of field: Constraint::pktable"]
        [::std::mem::offset_of!(Constraint, pktable) - 128usize];
    ["Offset of field: Constraint::fk_attrs"]
        [::std::mem::offset_of!(Constraint, fk_attrs) - 136usize];
    ["Offset of field: Constraint::pk_attrs"]
        [::std::mem::offset_of!(Constraint, pk_attrs) - 144usize];
    ["Offset of field: Constraint::fk_with_period"]
        [::std::mem::offset_of!(Constraint, fk_with_period) - 152usize];
    ["Offset of field: Constraint::pk_with_period"]
        [::std::mem::offset_of!(Constraint, pk_with_period) - 153usize];
    ["Offset of field: Constraint::fk_matchtype"]
        [::std::mem::offset_of!(Constraint, fk_matchtype) - 154usize];
    ["Offset of field: Constraint::fk_upd_action"]
        [::std::mem::offset_of!(Constraint, fk_upd_action) - 155usize];
    ["Offset of field: Constraint::fk_del_action"]
        [::std::mem::offset_of!(Constraint, fk_del_action) - 156usize];
    ["Offset of field: Constraint::fk_del_set_cols"]
        [::std::mem::offset_of!(Constraint, fk_del_set_cols) - 160usize];
    ["Offset of field: Constraint::old_conpfeqop"]
        [::std::mem::offset_of!(Constraint, old_conpfeqop) - 168usize];
    ["Offset of field: Constraint::old_pktable_oid"]
        [::std::mem::offset_of!(Constraint, old_pktable_oid) - 176usize];
    ["Offset of field: Constraint::location"]
        [::std::mem::offset_of!(Constraint, location) - 180usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateTableSpaceStmt {
    pub type_: NodeTag,
    pub tablespacename: *mut ::std::os::raw::c_char,
    pub owner: *mut RoleSpec,
    pub location: *mut ::std::os::raw::c_char,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateTableSpaceStmt"][::std::mem::size_of::<CreateTableSpaceStmt>() - 40usize];
    ["Alignment of CreateTableSpaceStmt"][::std::mem::align_of::<CreateTableSpaceStmt>() - 8usize];
    ["Offset of field: CreateTableSpaceStmt::type_"]
        [::std::mem::offset_of!(CreateTableSpaceStmt, type_) - 0usize];
    ["Offset of field: CreateTableSpaceStmt::tablespacename"]
        [::std::mem::offset_of!(CreateTableSpaceStmt, tablespacename) - 8usize];
    ["Offset of field: CreateTableSpaceStmt::owner"]
        [::std::mem::offset_of!(CreateTableSpaceStmt, owner) - 16usize];
    ["Offset of field: CreateTableSpaceStmt::location"]
        [::std::mem::offset_of!(CreateTableSpaceStmt, location) - 24usize];
    ["Offset of field: CreateTableSpaceStmt::options"]
        [::std::mem::offset_of!(CreateTableSpaceStmt, options) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DropTableSpaceStmt {
    pub type_: NodeTag,
    pub tablespacename: *mut ::std::os::raw::c_char,
    pub missing_ok: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DropTableSpaceStmt"][::std::mem::size_of::<DropTableSpaceStmt>() - 24usize];
    ["Alignment of DropTableSpaceStmt"][::std::mem::align_of::<DropTableSpaceStmt>() - 8usize];
    ["Offset of field: DropTableSpaceStmt::type_"]
        [::std::mem::offset_of!(DropTableSpaceStmt, type_) - 0usize];
    ["Offset of field: DropTableSpaceStmt::tablespacename"]
        [::std::mem::offset_of!(DropTableSpaceStmt, tablespacename) - 8usize];
    ["Offset of field: DropTableSpaceStmt::missing_ok"]
        [::std::mem::offset_of!(DropTableSpaceStmt, missing_ok) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterTableSpaceOptionsStmt {
    pub type_: NodeTag,
    pub tablespacename: *mut ::std::os::raw::c_char,
    pub options: *mut List,
    pub isReset: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterTableSpaceOptionsStmt"]
        [::std::mem::size_of::<AlterTableSpaceOptionsStmt>() - 32usize];
    ["Alignment of AlterTableSpaceOptionsStmt"]
        [::std::mem::align_of::<AlterTableSpaceOptionsStmt>() - 8usize];
    ["Offset of field: AlterTableSpaceOptionsStmt::type_"]
        [::std::mem::offset_of!(AlterTableSpaceOptionsStmt, type_) - 0usize];
    ["Offset of field: AlterTableSpaceOptionsStmt::tablespacename"]
        [::std::mem::offset_of!(AlterTableSpaceOptionsStmt, tablespacename) - 8usize];
    ["Offset of field: AlterTableSpaceOptionsStmt::options"]
        [::std::mem::offset_of!(AlterTableSpaceOptionsStmt, options) - 16usize];
    ["Offset of field: AlterTableSpaceOptionsStmt::isReset"]
        [::std::mem::offset_of!(AlterTableSpaceOptionsStmt, isReset) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterTableMoveAllStmt {
    pub type_: NodeTag,
    pub orig_tablespacename: *mut ::std::os::raw::c_char,
    pub objtype: ObjectType,
    pub roles: *mut List,
    pub new_tablespacename: *mut ::std::os::raw::c_char,
    pub nowait: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterTableMoveAllStmt"][::std::mem::size_of::<AlterTableMoveAllStmt>() - 48usize];
    ["Alignment of AlterTableMoveAllStmt"]
        [::std::mem::align_of::<AlterTableMoveAllStmt>() - 8usize];
    ["Offset of field: AlterTableMoveAllStmt::type_"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, type_) - 0usize];
    ["Offset of field: AlterTableMoveAllStmt::orig_tablespacename"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, orig_tablespacename) - 8usize];
    ["Offset of field: AlterTableMoveAllStmt::objtype"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, objtype) - 16usize];
    ["Offset of field: AlterTableMoveAllStmt::roles"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, roles) - 24usize];
    ["Offset of field: AlterTableMoveAllStmt::new_tablespacename"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, new_tablespacename) - 32usize];
    ["Offset of field: AlterTableMoveAllStmt::nowait"]
        [::std::mem::offset_of!(AlterTableMoveAllStmt, nowait) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateExtensionStmt {
    pub type_: NodeTag,
    pub extname: *mut ::std::os::raw::c_char,
    pub if_not_exists: bool,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateExtensionStmt"][::std::mem::size_of::<CreateExtensionStmt>() - 32usize];
    ["Alignment of CreateExtensionStmt"][::std::mem::align_of::<CreateExtensionStmt>() - 8usize];
    ["Offset of field: CreateExtensionStmt::type_"]
        [::std::mem::offset_of!(CreateExtensionStmt, type_) - 0usize];
    ["Offset of field: CreateExtensionStmt::extname"]
        [::std::mem::offset_of!(CreateExtensionStmt, extname) - 8usize];
    ["Offset of field: CreateExtensionStmt::if_not_exists"]
        [::std::mem::offset_of!(CreateExtensionStmt, if_not_exists) - 16usize];
    ["Offset of field: CreateExtensionStmt::options"]
        [::std::mem::offset_of!(CreateExtensionStmt, options) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterExtensionStmt {
    pub type_: NodeTag,
    pub extname: *mut ::std::os::raw::c_char,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterExtensionStmt"][::std::mem::size_of::<AlterExtensionStmt>() - 24usize];
    ["Alignment of AlterExtensionStmt"][::std::mem::align_of::<AlterExtensionStmt>() - 8usize];
    ["Offset of field: AlterExtensionStmt::type_"]
        [::std::mem::offset_of!(AlterExtensionStmt, type_) - 0usize];
    ["Offset of field: AlterExtensionStmt::extname"]
        [::std::mem::offset_of!(AlterExtensionStmt, extname) - 8usize];
    ["Offset of field: AlterExtensionStmt::options"]
        [::std::mem::offset_of!(AlterExtensionStmt, options) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterExtensionContentsStmt {
    pub type_: NodeTag,
    pub extname: *mut ::std::os::raw::c_char,
    pub action: ::std::os::raw::c_int,
    pub objtype: ObjectType,
    pub object: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterExtensionContentsStmt"]
        [::std::mem::size_of::<AlterExtensionContentsStmt>() - 32usize];
    ["Alignment of AlterExtensionContentsStmt"]
        [::std::mem::align_of::<AlterExtensionContentsStmt>() - 8usize];
    ["Offset of field: AlterExtensionContentsStmt::type_"]
        [::std::mem::offset_of!(AlterExtensionContentsStmt, type_) - 0usize];
    ["Offset of field: AlterExtensionContentsStmt::extname"]
        [::std::mem::offset_of!(AlterExtensionContentsStmt, extname) - 8usize];
    ["Offset of field: AlterExtensionContentsStmt::action"]
        [::std::mem::offset_of!(AlterExtensionContentsStmt, action) - 16usize];
    ["Offset of field: AlterExtensionContentsStmt::objtype"]
        [::std::mem::offset_of!(AlterExtensionContentsStmt, objtype) - 20usize];
    ["Offset of field: AlterExtensionContentsStmt::object"]
        [::std::mem::offset_of!(AlterExtensionContentsStmt, object) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateFdwStmt {
    pub type_: NodeTag,
    pub fdwname: *mut ::std::os::raw::c_char,
    pub func_options: *mut List,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateFdwStmt"][::std::mem::size_of::<CreateFdwStmt>() - 32usize];
    ["Alignment of CreateFdwStmt"][::std::mem::align_of::<CreateFdwStmt>() - 8usize];
    ["Offset of field: CreateFdwStmt::type_"]
        [::std::mem::offset_of!(CreateFdwStmt, type_) - 0usize];
    ["Offset of field: CreateFdwStmt::fdwname"]
        [::std::mem::offset_of!(CreateFdwStmt, fdwname) - 8usize];
    ["Offset of field: CreateFdwStmt::func_options"]
        [::std::mem::offset_of!(CreateFdwStmt, func_options) - 16usize];
    ["Offset of field: CreateFdwStmt::options"]
        [::std::mem::offset_of!(CreateFdwStmt, options) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterFdwStmt {
    pub type_: NodeTag,
    pub fdwname: *mut ::std::os::raw::c_char,
    pub func_options: *mut List,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterFdwStmt"][::std::mem::size_of::<AlterFdwStmt>() - 32usize];
    ["Alignment of AlterFdwStmt"][::std::mem::align_of::<AlterFdwStmt>() - 8usize];
    ["Offset of field: AlterFdwStmt::type_"][::std::mem::offset_of!(AlterFdwStmt, type_) - 0usize];
    ["Offset of field: AlterFdwStmt::fdwname"]
        [::std::mem::offset_of!(AlterFdwStmt, fdwname) - 8usize];
    ["Offset of field: AlterFdwStmt::func_options"]
        [::std::mem::offset_of!(AlterFdwStmt, func_options) - 16usize];
    ["Offset of field: AlterFdwStmt::options"]
        [::std::mem::offset_of!(AlterFdwStmt, options) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateForeignServerStmt {
    pub type_: NodeTag,
    pub servername: *mut ::std::os::raw::c_char,
    pub servertype: *mut ::std::os::raw::c_char,
    pub version: *mut ::std::os::raw::c_char,
    pub fdwname: *mut ::std::os::raw::c_char,
    pub if_not_exists: bool,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateForeignServerStmt"][::std::mem::size_of::<CreateForeignServerStmt>() - 56usize];
    ["Alignment of CreateForeignServerStmt"]
        [::std::mem::align_of::<CreateForeignServerStmt>() - 8usize];
    ["Offset of field: CreateForeignServerStmt::type_"]
        [::std::mem::offset_of!(CreateForeignServerStmt, type_) - 0usize];
    ["Offset of field: CreateForeignServerStmt::servername"]
        [::std::mem::offset_of!(CreateForeignServerStmt, servername) - 8usize];
    ["Offset of field: CreateForeignServerStmt::servertype"]
        [::std::mem::offset_of!(CreateForeignServerStmt, servertype) - 16usize];
    ["Offset of field: CreateForeignServerStmt::version"]
        [::std::mem::offset_of!(CreateForeignServerStmt, version) - 24usize];
    ["Offset of field: CreateForeignServerStmt::fdwname"]
        [::std::mem::offset_of!(CreateForeignServerStmt, fdwname) - 32usize];
    ["Offset of field: CreateForeignServerStmt::if_not_exists"]
        [::std::mem::offset_of!(CreateForeignServerStmt, if_not_exists) - 40usize];
    ["Offset of field: CreateForeignServerStmt::options"]
        [::std::mem::offset_of!(CreateForeignServerStmt, options) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterForeignServerStmt {
    pub type_: NodeTag,
    pub servername: *mut ::std::os::raw::c_char,
    pub version: *mut ::std::os::raw::c_char,
    pub options: *mut List,
    pub has_version: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterForeignServerStmt"][::std::mem::size_of::<AlterForeignServerStmt>() - 40usize];
    ["Alignment of AlterForeignServerStmt"]
        [::std::mem::align_of::<AlterForeignServerStmt>() - 8usize];
    ["Offset of field: AlterForeignServerStmt::type_"]
        [::std::mem::offset_of!(AlterForeignServerStmt, type_) - 0usize];
    ["Offset of field: AlterForeignServerStmt::servername"]
        [::std::mem::offset_of!(AlterForeignServerStmt, servername) - 8usize];
    ["Offset of field: AlterForeignServerStmt::version"]
        [::std::mem::offset_of!(AlterForeignServerStmt, version) - 16usize];
    ["Offset of field: AlterForeignServerStmt::options"]
        [::std::mem::offset_of!(AlterForeignServerStmt, options) - 24usize];
    ["Offset of field: AlterForeignServerStmt::has_version"]
        [::std::mem::offset_of!(AlterForeignServerStmt, has_version) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateForeignTableStmt {
    pub base: CreateStmt,
    pub servername: *mut ::std::os::raw::c_char,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateForeignTableStmt"][::std::mem::size_of::<CreateForeignTableStmt>() - 128usize];
    ["Alignment of CreateForeignTableStmt"]
        [::std::mem::align_of::<CreateForeignTableStmt>() - 8usize];
    ["Offset of field: CreateForeignTableStmt::base"]
        [::std::mem::offset_of!(CreateForeignTableStmt, base) - 0usize];
    ["Offset of field: CreateForeignTableStmt::servername"]
        [::std::mem::offset_of!(CreateForeignTableStmt, servername) - 112usize];
    ["Offset of field: CreateForeignTableStmt::options"]
        [::std::mem::offset_of!(CreateForeignTableStmt, options) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateUserMappingStmt {
    pub type_: NodeTag,
    pub user: *mut RoleSpec,
    pub servername: *mut ::std::os::raw::c_char,
    pub if_not_exists: bool,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateUserMappingStmt"][::std::mem::size_of::<CreateUserMappingStmt>() - 40usize];
    ["Alignment of CreateUserMappingStmt"]
        [::std::mem::align_of::<CreateUserMappingStmt>() - 8usize];
    ["Offset of field: CreateUserMappingStmt::type_"]
        [::std::mem::offset_of!(CreateUserMappingStmt, type_) - 0usize];
    ["Offset of field: CreateUserMappingStmt::user"]
        [::std::mem::offset_of!(CreateUserMappingStmt, user) - 8usize];
    ["Offset of field: CreateUserMappingStmt::servername"]
        [::std::mem::offset_of!(CreateUserMappingStmt, servername) - 16usize];
    ["Offset of field: CreateUserMappingStmt::if_not_exists"]
        [::std::mem::offset_of!(CreateUserMappingStmt, if_not_exists) - 24usize];
    ["Offset of field: CreateUserMappingStmt::options"]
        [::std::mem::offset_of!(CreateUserMappingStmt, options) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterUserMappingStmt {
    pub type_: NodeTag,
    pub user: *mut RoleSpec,
    pub servername: *mut ::std::os::raw::c_char,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterUserMappingStmt"][::std::mem::size_of::<AlterUserMappingStmt>() - 32usize];
    ["Alignment of AlterUserMappingStmt"][::std::mem::align_of::<AlterUserMappingStmt>() - 8usize];
    ["Offset of field: AlterUserMappingStmt::type_"]
        [::std::mem::offset_of!(AlterUserMappingStmt, type_) - 0usize];
    ["Offset of field: AlterUserMappingStmt::user"]
        [::std::mem::offset_of!(AlterUserMappingStmt, user) - 8usize];
    ["Offset of field: AlterUserMappingStmt::servername"]
        [::std::mem::offset_of!(AlterUserMappingStmt, servername) - 16usize];
    ["Offset of field: AlterUserMappingStmt::options"]
        [::std::mem::offset_of!(AlterUserMappingStmt, options) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DropUserMappingStmt {
    pub type_: NodeTag,
    pub user: *mut RoleSpec,
    pub servername: *mut ::std::os::raw::c_char,
    pub missing_ok: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DropUserMappingStmt"][::std::mem::size_of::<DropUserMappingStmt>() - 32usize];
    ["Alignment of DropUserMappingStmt"][::std::mem::align_of::<DropUserMappingStmt>() - 8usize];
    ["Offset of field: DropUserMappingStmt::type_"]
        [::std::mem::offset_of!(DropUserMappingStmt, type_) - 0usize];
    ["Offset of field: DropUserMappingStmt::user"]
        [::std::mem::offset_of!(DropUserMappingStmt, user) - 8usize];
    ["Offset of field: DropUserMappingStmt::servername"]
        [::std::mem::offset_of!(DropUserMappingStmt, servername) - 16usize];
    ["Offset of field: DropUserMappingStmt::missing_ok"]
        [::std::mem::offset_of!(DropUserMappingStmt, missing_ok) - 24usize];
};
pub const ImportForeignSchemaType_FDW_IMPORT_SCHEMA_ALL: ImportForeignSchemaType = 0;
pub const ImportForeignSchemaType_FDW_IMPORT_SCHEMA_LIMIT_TO: ImportForeignSchemaType = 1;
pub const ImportForeignSchemaType_FDW_IMPORT_SCHEMA_EXCEPT: ImportForeignSchemaType = 2;
pub type ImportForeignSchemaType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImportForeignSchemaStmt {
    pub type_: NodeTag,
    pub server_name: *mut ::std::os::raw::c_char,
    pub remote_schema: *mut ::std::os::raw::c_char,
    pub local_schema: *mut ::std::os::raw::c_char,
    pub list_type: ImportForeignSchemaType,
    pub table_list: *mut List,
    pub options: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImportForeignSchemaStmt"][::std::mem::size_of::<ImportForeignSchemaStmt>() - 56usize];
    ["Alignment of ImportForeignSchemaStmt"]
        [::std::mem::align_of::<ImportForeignSchemaStmt>() - 8usize];
    ["Offset of field: ImportForeignSchemaStmt::type_"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, type_) - 0usize];
    ["Offset of field: ImportForeignSchemaStmt::server_name"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, server_name) - 8usize];
    ["Offset of field: ImportForeignSchemaStmt::remote_schema"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, remote_schema) - 16usize];
    ["Offset of field: ImportForeignSchemaStmt::local_schema"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, local_schema) - 24usize];
    ["Offset of field: ImportForeignSchemaStmt::list_type"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, list_type) - 32usize];
    ["Offset of field: ImportForeignSchemaStmt::table_list"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, table_list) - 40usize];
    ["Offset of field: ImportForeignSchemaStmt::options"]
        [::std::mem::offset_of!(ImportForeignSchemaStmt, options) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreatePolicyStmt {
    pub type_: NodeTag,
    pub policy_name: *mut ::std::os::raw::c_char,
    pub table: *mut RangeVar,
    pub cmd_name: *mut ::std::os::raw::c_char,
    pub permissive: bool,
    pub roles: *mut List,
    pub qual: *mut Node,
    pub with_check: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreatePolicyStmt"][::std::mem::size_of::<CreatePolicyStmt>() - 64usize];
    ["Alignment of CreatePolicyStmt"][::std::mem::align_of::<CreatePolicyStmt>() - 8usize];
    ["Offset of field: CreatePolicyStmt::type_"]
        [::std::mem::offset_of!(CreatePolicyStmt, type_) - 0usize];
    ["Offset of field: CreatePolicyStmt::policy_name"]
        [::std::mem::offset_of!(CreatePolicyStmt, policy_name) - 8usize];
    ["Offset of field: CreatePolicyStmt::table"]
        [::std::mem::offset_of!(CreatePolicyStmt, table) - 16usize];
    ["Offset of field: CreatePolicyStmt::cmd_name"]
        [::std::mem::offset_of!(CreatePolicyStmt, cmd_name) - 24usize];
    ["Offset of field: CreatePolicyStmt::permissive"]
        [::std::mem::offset_of!(CreatePolicyStmt, permissive) - 32usize];
    ["Offset of field: CreatePolicyStmt::roles"]
        [::std::mem::offset_of!(CreatePolicyStmt, roles) - 40usize];
    ["Offset of field: CreatePolicyStmt::qual"]
        [::std::mem::offset_of!(CreatePolicyStmt, qual) - 48usize];
    ["Offset of field: CreatePolicyStmt::with_check"]
        [::std::mem::offset_of!(CreatePolicyStmt, with_check) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterPolicyStmt {
    pub type_: NodeTag,
    pub policy_name: *mut ::std::os::raw::c_char,
    pub table: *mut RangeVar,
    pub roles: *mut List,
    pub qual: *mut Node,
    pub with_check: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlterPolicyStmt"][::std::mem::size_of::<AlterPolicyStmt>() - 48usize];
    ["Alignment of AlterPolicyStmt"][::std::mem::align_of::<AlterPolicyStmt>() - 8usize];
    ["Offset of field: AlterPolicyStmt::type_"]
        [::std::mem::offset_of!(AlterPolicyStmt, type_) - 0usize];
    ["Offset of field: AlterPolicyStmt::policy_name"]
        [::std::mem::offset_of!(AlterPolicyStmt, policy_name) - 8usize];
    ["Offset of field: AlterPolicyStmt::table"]
        [::std::mem::offset_of!(AlterPolicyStmt, table) - 16usize];
    ["Offset of field: AlterPolicyStmt::roles"]
        [::std::mem::offset_of!(AlterPolicyStmt, roles) - 24usize];
    ["Offset of field: AlterPolicyStmt::qual"]
        [::std::mem::offset_of!(AlterPolicyStmt, qual) - 32usize];
    ["Offset of field: AlterPolicyStmt::with_check"]
        [::std::mem::offset_of!(AlterPolicyStmt, with_check) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateAmStmt {
    pub type_: NodeTag,
    pub amname: *mut ::std::os::raw::c_char,
    pub handler_name: *mut List,
    pub amtype: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateAmStmt"][::std::mem::size_of::<CreateAmStmt>() - 32usize];
    ["Alignment of CreateAmStmt"][::std::mem::align_of::<CreateAmStmt>() - 8usize];
    ["Offset of field: CreateAmStmt::type_"][::std::mem::offset_of!(CreateAmStmt, type_) - 0usize];
    ["Offset of field: CreateAmStmt::amname"]
        [::std::mem::offset_of!(CreateAmStmt, amname) - 8usize];
    ["Offset of field: CreateAmStmt::handler_name"]
        [::std::mem::offset_of!(CreateAmStmt, handler_name) - 16usize];
    ["Offset of field: CreateAmStmt::amtype"]
        [::std::mem::offset_of!(CreateAmStmt, amtype) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateTrigStmt {
    pub type_: NodeTag,
    pub replace: bool,
    pub isconstraint: bool,
    pub trigname: *mut ::std::os::raw::c_char,
    pub relation: *mut RangeVar,
    pub funcname: *mut List,
    pub args: *mut List,
    pub row: bool,
    pub timing: int16,
    pub events: int16,
    pub columns: *mut List,
    pub whenClause: *mut Node,
    pub transitionRels: *mut List,
    pub deferrable: bool,
    pub initdeferred: bool,
    pub constrrel: *mut RangeVar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateTrigStmt"][::std::mem::size_of::<CreateTrigStmt>() - 88usize];
    ["Alignment of CreateTrigStmt"][::std::mem::align_of::<CreateTrigStmt>() - 8usize];
    ["Offset of field: CreateTrigStmt::type_"]
        [::std::mem::offset_of!(CreateTrigStmt, type_) - 0usize];
    ["Offset of field: CreateTrigStmt::replace"]
        [::std::mem::offset_of!(CreateTrigStmt, replace) - 4usize];
    ["Offset of field: CreateTrigStmt::isconstraint"]
        [::std::mem::offset_of!(CreateTrigStmt, isconstraint) - 5usize];
    ["Offset of field: CreateTrigStmt::trigname"]
        [::std::mem::offset_of!(CreateTrigStmt, trigname) - 8usize];
    ["Offset of field: CreateTrigStmt::relation"]
        [::std::mem::offset_of!(CreateTrigStmt, relation) - 16usize];
    ["Offset of field: CreateTrigStmt::funcname"]
        [::std::mem::offset_of!(CreateTrigStmt, funcname) - 24usize];
    ["Offset of field: CreateTrigStmt::args"]
        [::std::mem::offset_of!(CreateTrigStmt, args) - 32usize];
    ["Offset of field: CreateTrigStmt::row"][::std::mem::offset_of!(CreateTrigStmt, row) - 40usize];
    ["Offset of field: CreateTrigStmt::timing"]
        [::std::mem::offset_of!(CreateTrigStmt, timing) - 42usize];
    ["Offset of field: CreateTrigStmt::events"]
        [::std::mem::offset_of!(CreateTrigStmt, events) - 44usize];
    ["Offset of field: CreateTrigStmt::columns"]
        [::std::mem::offset_of!(CreateTrigStmt, columns) - 48usize];
    ["Offset of field: CreateTrigStmt::whenClause"]
        [::std::mem::offset_of!(CreateTrigStmt, whenClause) - 56usize];
    ["Offset of field: CreateTrigStmt::transitionRels"]
        [::std::mem::offset_of!(CreateTrigStmt, transitionRels) - 64usize];
    ["Offset of field: CreateTrigStmt::deferrable"]
        [::std::mem::offset_of!(CreateTrigStmt, deferrable) - 72usize];
    ["Offset of field: CreateTrigStmt::initdeferred"]
        [::std::mem::offset_of!(CreateTrigStmt, initdeferred) - 73usize];
    ["Offset of field: CreateTrigStmt::constrrel"]
        [::std::mem::offset_of!(CreateTrigStmt, constrrel) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CreateEventTrigStmt {
    pub type_: NodeTag,
    pub trigname: *mut ::std::os::raw::c_char,
    pub eventname: *mut ::std::os::raw::c_char,
    pub whenclause: *mut List,
    pub funcname: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CreateEventTrigStmt"][::std::mem::size_of::<CreateEventTrigStmt>() - 40usize];
    ["Alignment of CreateEventTrigStmt"][::std::mem::align_of::<CreateEventTrigStmt>() - 8usize];
    ["Offset of field: CreateEventTrigStmt::type_"]
        [::std::mem::offset_of!(CreateEventTrigStmt, type_) - 0usize];
    ["Offset of field: CreateEventTrigStmt::trigname"]
        [::std::mem::offset_of!(CreateEventTrigStmt, trigname) - 8usize];
    ["Offset of field: CreateEventTrigStmt::eventname"]
        [::std::mem::offset_of!(CreateEventTrigStmt, eventname) - 16usize];
    ["Offset of field: CreateEventTrigStmt::whenclause"]
        [::std::mem::offset_of!(CreateEventTrigStmt, whenclause) - 24usize];
    ["Offset of field: CreateEventTrigStmt::funcname"]
        [::std::mem::offset_of!(CreateEventTrigStmt, funcname) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlterEventTrigStmt {
    pub type_: NodeTag,
    pub trigname: *mut ::std::os::raw::c_char,
    pub tgenabled: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
